[
    {
        "title": "",
        "rating": "",
        "text": "Great quality camera for a cheap price!!! Night vision and normal day vision video quality is excellent. Haven't had any issues with lagging either. The tilt and rotate all work great. We got 3 several months ago. 1 stopped working BUT it was dropped twice. No connectivity issues, super easy to set up and doesn't require reconnection after its unplugged and plugged back in."
    },
    {
        "title": "",
        "rating": "",
        "text": "EXTREMELY EASY TO USE • COST-EFFECTIVE • VERSATILE • SATISFYING: I happened to buy a 4-pack of Kasa smart plugs recently. After experiencing firsthand how easy it was to integrate them into my existing and very average home Wi-Fi system - not to mention tie their control into existing Amazon smart devices such as my Echo Dot and EchoPop - I simply couldn't resist the urge to (join the rest of you in the 21st century and) purchase a camera.\n\nAPPLICATION: I wanted an easy to buy, implement, use and maintain a remote controllable and reasonably 'smart' surveillance system - just to keep an eye on things that happen on the street. I learned very quickly the Kasa camera system has features that enable it to not only track motion but specifically people when desired (see Activity Zones IMG) ; features include various levels of tracking up to and including \"Patrol Mode\" which will cause the camera to rotate through the four savable \"scenes\" at the specified interval(s) allowing for 360° monitoring from just one camera. Even has NIGHT VISION.\n\nI actually bought two cameras and haven't even set up the second one because the first is already doing so much!\n\nTIPS & TRICKS: Make sure you purchase a reasonable quality 64 GB mini SD card. That is the maximum size card this model of Kasa camera can utilize. TO INSERT THE CARD: using the mobile interface pan the camera upward until the mini SD card port and reset buttons are exposed (see IMGs.) Insert the card LABEL UP and press until firmly clicked and secured in its final position. I have been running the camera \"24/7\" (the actual mode is known as \"24/7 Monitoring\") at maximum resolution of 1080p for ~ 3 days and have used less than 25% of the 64 GB capacity. (see IMGs)\n\nHOW TO SAVE EVIDENCE: Should something unfortunate occur and you find yourself in the position of needing to save that which your camera captured you can simply click on \"24/7 recording\" & move the saved timeline bar to the requisite point, wait for playback to start and click the 🔴 in the lower right-hand portion on the playback screen. (Note: Give the video recall some time - after all it is the camera having to go back and read saved data while still recording and saving new data, transmit saved data through the Wi-Fi network to your phone and ultimately save it in a new location. Even the fastest systems will take a moment.) Following these steps will save a video of what was recorded that you will find in your video gallery. *There is a portion of the app allocated to Activity Alerts Tracking which is available with a Kasa Care subscription; I do not have that subscription thus I am unable to speak to those features at this time but imagine they facilitate easier activity recall and saving.\n\nWHAT TO DO NOW: Click purchase. 😊 Seriously this thing is fabulous especially for the price point. Off the top of my head some of the easiest applications I can think of would be keeping an eye on your pets or your kids while they're at home or having an extra pair of eyes when needed.\n\n*** Keep in mind this review is written from the standpoint of someone seeking easy applications and easy use - If you are looking for something that is sturdy, has own/redundant power, data storage and signaling capacity, is designed to survive not only adverse weather/climate but also potential tampering this is not the device I would recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "Amazing camera for peace of mind. I’m a dog trainer, and have a “dog room” in my garage, and this camera was a LIFE saver! I seriously have so much more peace of mind knowing even if I leave my home, I can still see what’s going on and have a track record of everything that has happened if need be to show clients proof. It also allows others to join, so my employee can join as well and update accordingly. It’s very motion sensitive which I WANT and picks up even when the dogs are just barking and I need to go in there to see what’s going on. Amazing tool for pet owners, care takers, buisness owners, and people who just want general security in their home & want to know what’s going on and have a record of such.\n\nDisclaimer** amazing for nanny cams, pet cams, and general monitoring but it does have a monthly subscription to be able to save videos, but it’s very low & absolutely worth it to me as someone who operates a business and likes a paper trail.\n\nAll in all, have had no issues with connection (and mine is in my garage!!!) so far away from the router, no issues with the app, and I’ve been extremely satirized with all that it can do for the price!\n\nDefinitely worth it. 10 out of 10!"
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s a great product, I only wish it allowed storage in the case I can’t look at the camera immediately. However great quality for the price. You’re still able to move it from your phone when away, and can hear audio or turn off audio"
    },
    {
        "title": "",
        "rating": "",
        "text": "Setup was a breeze—just downloaded the app following the steps, and it was operational within 10 minutes.\" Also the video quality is excellent 👌"
    },
    {
        "title": "",
        "rating": "",
        "text": "Tried a WYZE v4 first but turns out it was about as useful a camera as a brick would be.\n\nIt would NOT connect to my WIFI from either of my routers(I have a Xfinity modem/router but it's old so I bought a Netgear Nighthawk some years ago to boost the signal at a one time cost rather than renting extra equipment every month from Xfinity cause they refuse to replace anything that's outdated), it would NOT get detected by the WYZE app whether I used the same wifi signal or not so I couldn't even troubleshoot it since the app didn't know it existed in the first place. To make matters worse it costs $45 which is the most expensive brick I ever owned in my life so I returned it for a full refund and decided to try 1 more time with a cheaper but comparable camera. That's when I picked this up.\n\nI went in a skeptic assuming I would have the same problems as I always did with WYZE(tried a v3 or maybe v2 years ago, same problem as the v4 so I guess WYZE is just incapable of actual improvement and favors dumb gimmicks instead. The only thing that changed was the app layout which admittedly LOOKS better now but looks can be deceiving...)\n\nTurns out I was wrong and NOT every camera on Amazon is an overpriced pile of junk! This camera is half the price, connected immediately with 0 delays and functions exactly as advertised. This cameras App has performed nearly perfectly and I can even move this camera FAR from my router without any impact on the signal quality. I can keep my phone on 5G and STILL use EVERY feature on the app. I can also be far away from my router, house, and this camera without losing any features. That means I can get notified of activities, pan/tilt manually, toggle NV, change app settings/schedules, set up to 4 viewpoints, set detection zones in said viewpoints, record manually, turn the status LED on/off, download recorded activities(manual recordings OR detection-based recordings) and Etc...\n\nThe cloud service is cheap but in a GOOD way. Only $3/month per device(up to 4) or $10/month for up to 10 devices which is extremely affordable.\n\nThe quality of videos is very good IMO although I do wish the Frame rate was a little higher(I don't KNOW the exact Frame Rate but I'm a big time Gamer who just loves loves LOVES to toggle his FPS display ON and set it to high accuracy mode.) Based on what I have seen so far I think it's about 10-15 FPS so really fast movements will look like a smudge but natural movements shouldn't have that problem. It might not be the BEST option for monitoring(I don't know WHAT is cause this is only my 3rd attempt at finding a decent camera for basic monitoring but it's gone above and beyond my expectations at this pricepoint.) I'm actually about to get 2 or 3 more of these once I finish and submit my updated review.\n\nSome notes:\nWhen you plug it in for the first time it will probably start moving suddenly on it's own, this is NORMAL. It's a way to test the motor and range of motion for the pan/tilt feature and can be done manually in the app as well. I've moved to different outlets twice now and it has not done that on it's own either time leading me to believe it's only a one-time automated check up of sorts.\n\nBy coincidence, I found one minor flaw on the app which I'm not sure was a fluke or an actual Bug. I was watching a live video feed and tried to manually record something I wasn't sure would trigger motion detection but apparently it DID and my fool self forgot about the minor delay so it popped up in my notification panel \"Activity detected on ___\" but did not appear in the app right away so I refreshed it. When I went to reciew download it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera, put in an SD card with a lot of memory, add the Kasa app and you’ve got an instant security system with no monthly fees. When we’re on vacation we can see what’s going on at our house, rotate the camera for different views, and have it notify us of unusual sounds. I have one looking out the front window and one on a back window, if it hears a noise inside I rotate it to look in the house. It sees in the dark. Works great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have 5 of these cameras. One has stopped working, after two years. It does not pan very much anymore. The otherd still work, but they sometimes have issues connecting while I am away from home and I have to re-add them when I get home for it to work again. The SD card for recording also gets \"corrupted \" occasionally and requires reformatting. But as I use them to monitor my dog when I'm not home, the recording is not 100% necessary."
    },
    {
        "title": "",
        "rating": "",
        "text": "To clarify, this is NOT a bad camera. Quite the opposite, as a matter of fact. I have the same camera, just the slightly \"cheaper\" version. When I say, \"cheaper\" I don't mean cheap. I just mean it costs less. I would not classify either version as cheap. If this review were for the \"basic\" model, it would have five stars. The reason for this model receiving just 3 of 5 possible stars is because there is an option for the camera to pan and tilt. It has motion detection and will automatically patrol if you choose it to do so. These functionalities all work fine and as expected. The motion sensing is actually pretty great and from an upstairs window it will catch people walking all the way across the street, which is much farther than the advertised 30 foot distance. The night vision works, but not through a window.\n\nI've never had any connection problems after having gotten it initially setup. That was kind of a pain, in all honesty. You wouldn't think it, but manually scrolling the camera to point upwards just to reach the reset button or to access the SD card is a poor design choice, in my opinion. The fact that's where the reset connection button is also makes it annoying, because you press and hold the button for it to begin doing its thing, searching for networks and devices and whatnot. Sometimes it will find the network and everything you're looking for right away, but other times it gives you the most confusing run around until you've disconnected and restarted the camera about a dozen times.\n\nThat being said, once you get the camera connected to your network and through the app, it works pretty flawlessly. It does load a little bit slow, so if you get a notification and open it up live, the motion that it caught may have already come and gone, but you can always revert to the 24/7 recording function and search through the recording history with footnotes that will take you right to the motion or object detection. Say a person walks by, it will save a bookmark for person detected. With a 256gb SD card, my camera tends to hold about 2-3 weeks worth of footage and I record 24/7.\n\nI used the motion tracking feature for a little while after I first got the camera so that I could follow people to see which direction they've gone after they pass my apartment. I have my parking space right in front of my unit, but someone still slashed the tires one night, hence the camera. It's a great feature, but I have a lot of car and foot traffic in front of my house that caused the camera to be panning left and right far too often. I didn't want to overwork it, so I turned it off. I don't think this is a quality issue here, but a motor/gear issue within the camera body itself that controls the panning and tilting functions that sound like they'll get pretty tired pretty soon if there's a lot of motion tracking. It doesn't sound terrible and it's only as loud as a very small fraction of a vibrating phone when it turns, but in a quiet room and it's tracking people in the early morning it's enough for you to want it to stop. But it's as easy as opening the settings and turning off motion tracking, but it will still record. If you have constant patrol or motion tracking, it's likely to run out of motor power sooner than later. I didn't want to put it to the test, because you can set \"viewpoints\" to your devices. I set up three viewpoints to cover my parking space and vehicle. I have a viewpoint to the left, with my vehicle on the right side of the frame. I have a second viewpoint that points directly at my vehicle, dead center in the parking space, and I have another viewpoint that keeps my vehicle in the left side of the frame. I can view a large swath of the street in front of my house and my neighbors feel better knowing I have a decent camera, because we all know that our complexes security cameras suck and point at nothing of importance.\n\nSo, to hit the algorithm for the cameras durability - I don't think they're waterproof, I wouldn't want to drop it, it is made out of cheap plastic after all, but I've never had any lens issues so far. My biggest worry about it's long-term durability would be focused mostly on the gears and motor that turns and pans the camera.\n\nWithin the My Kasa app, you can open it and it will display your list of devices, assuming you have multiple. If it's just a single device, it will show just the one device. You can select your device and it will pull up its real-time live feed. There is a microphone and audio settings on it, so if it's inside you can talk to your dog or whatever, you can hear your dog bark etc.\n\nMy other issue with this camera, and this is specifically about the white version of the camera that supposedly has a higher quality of video (something I could not tell the difference between, I'll explain here shortly) is the fact that when it does go through motion tracking or any sort of panning, it will return to its original viewpoint. That would be fine, having my vehicle dead center, but the viewpoint tells itself that the real viewpoint is several degrees off and is often pointing a bit higher than you originally had the viewpoint set. This leads you to having to reset the pan/tilt of the device almost every time it's done tracking motion.\n\nNow the difference in definition and quality, for me, was negligible, at best. Neither of the cameras could clearly read my license plate, so there was no difference in resolution quality there. I think the white version is supposed to be running a higher quality camera, but I think it's built off of the basic materials still used in the base model, which causes it to have a lag, slight delay, and it takes longer to load in the app. If anything, the higher \"quality\" is actually reduced because I don't think the hardware can withstand the power of the software and the lens capabilities.\n\nLong story short, get the base model for $20 and you won't be happier. Beats a $100 Ring by miles. If you really want a doorbell that badly, then I guess get a Ring and have fun changing the terribly short-lasting batteries every day. Or hardwire it into your wall, which, if we're being real here, is something that pretty much nobody ever feels like doing."
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s a great camera. It can rotate so that I can look around my whole room and I’m able to see clearly and speak through it. Very nice to see and talk to my pets while I’m not home.\nBUT! I do not like how hot the camera gets after my 10 hour work shift. When I get home the camera feels pretty hot to touch along with the power block. With how hot it gets, I am too nervous to continue using because I’m scared that one day I’m going to see the camera explode and my apartment on fire. The whole point of why I want a camera is to see my pets safe. Because of how hot it gets, I do not trust this camera and have not used it since.\n\nI have seen this camera do a 360 and stopped at me and titled up pointing the camera at my face. Idk if it’s like a calibration thing or what, but talk about freaky. 10/10 freaky overheating camera. I’m moving on to a different camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I had reservations about purchasing this camera due to reviews about the camera not lasting very long. So far, I've not experienced any issues with the camera.\n\nI don't like the fact that I can't set a schedule for when the camera is on/off. The only option is for the camera to run 24/7 or to manually turn the camera off by unplugging it or using a surge suppressor strip with a power switch.\n\nI love the ability to set specific locations that I can quickly access when viewing through the camera from my smartphone. That is a really nice feature in my opinion.\n\nNight vision is exceptional, especially if you have street lighting. I have my camera set up to view out of one of the windows at the front of our home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Product was super simple to set up and use. Many people find it's a hassle to set up the cameras to access the app on their phones to view while away from home. This one is super simple and so I no longer have to see which one of my 2 dogs started the horseplay and tore my freshly made bed up I simply review the footage and know already so I can call them out by name. Dogs are not happy because Chaos likes being able to blame his older brother Jaxson but now the gig is up. Chaos you are guilty!! But seriously all true it does work great and simple to set up. Motion sets the camera to run so no holding or finding a spot to sit it abd you still miss everything as it rotates too. Buy it you will love it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought this to keep an eye on my two \"house dogs\". that has a tendency to get a little wild when left alone very long. I wasn't sure it would work the way I wanted it to. I was afraid I would need to be connected to wi fi on both the camera and my phone, but only needs the camera connected. I was pleasantly surprised when I was out in the boonies, with no wi fi anywhere near, that I could watch the dogs and speak to them if I need to. Works great in the car also."
    },
    {
        "title": "",
        "rating": "",
        "text": "Ive purchased two of these cameras to spy on my birds while I'm at work and I love them! They are so simple to set up and use, the app is great! The camera visibility is very clear and you have the ability to zoom in and out. I think the best feature of this is the notification for movement detection! I appreciate having a notification to my phone when I am away and I see someone has entered my apartment, yep my maintenance loves to come in unannounced. And you better believe I am screen recording their movements and talking through the camera to them, also another nice feature! All in All, This Is a BUY!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This has been the BEST camera I’ve had! Just the one camera covers the entire room! I love the motion detection and the person detection features! You can record 24 hours a day with a SD Card , so you won’t miss a beat! Plus with the 2-way microphone, you can speak to whoever is in the room with the camera or your pets from far away! Definitely a great buy, totally worth the money!"
    },
    {
        "title": "",
        "rating": "",
        "text": "La cámara inteligente Kasa Pan/Tilt es una excelente opción para vigilar el hogar. La imagen en 1080p es muy nítida, incluso en condiciones de poca luz, y el modo visión nocturna ofrece buena claridad sin saturar los tonos.\n\nLa función Pan/Tilt permite mover la cámara desde la app con suavidad y amplio rango, ideal para cubrir toda una habitación. La configuración es rápida y sencilla, la app Kasa es intuitiva y se conecta fácilmente a redes de 2.4 GHz.\n\nEl audio bidireccional funciona muy bien: el micrófono capta con claridad y el altavoz es suficientemente fuerte para comunicarte con alguien en casa o con tu mascota. También se integra fácilmente con Alexa y Google Assistant, lo que añade comodidad.\n\nEn resumen, una cámara compacta, fiable y con excelente calidad de imagen, perfecta para seguridad doméstica o monitoreo de bebés y mascotas. Muy recomendable por su relación calidad-precio."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buy this camera!! It has everything needed. It pans all ways and it sounds quiet compared to another one I tired. It auto adjusts to day and night. It has a microphone to talk into and also one to hear from. You can insert a mini SD for 24 hr recording if needed. You connect the app to your phone and it will notify you if there is every any motion detected from a human or pet."
    },
    {
        "title": "",
        "rating": "",
        "text": "It takes great videos, but wasn’t tracking motion. I contacted the company and was told that we have to have BOTH patrol and motion tracking on for the motion tracking to work.\nThe view is clear, and colors are crisp and accurate, and after looking up the instructions found here on Amazon ( nothing included in the box) I found where the sd card goes. I can find the videos that were taken and are in the app, but cannot find the still shots that it says are saved to “photos”. The still shots (screenshots) are not in my phone photo gallery, nor can I see anywhere in the app that they are stored. That is frustrating.\nI already had to Kasa app because I have a bunch of the smart plugs, so this was incredibly easy to set up. If there were better information here on Amazon for this product, I might give it a 5*. But for now it only gets 4."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ve had this camera for over two years and it works perfectly. Due to poor WiFi signal I was having difficulty resetting it. Called Kasa and spoke w Jonathan. Very helpful and patient w me in adding my cameras as new devices. He walked me through in a professional manner and got my sense of humor. They were down for a while bc it’s for my Dad and we don’t live close, but now I have comfort in seeing his whereabouts. Highly recommend cameras and their support team!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice size of item, connects to wifi, and has options to set up areas of your choice to keep a close eye on. Also rotates anywhere when motion is detected, and can be used to talk to others. You can purchase a micro chip to record anything around. Has an app to download to keep an eye on things while you're away from home"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m a really anxious cat parent and had to leave my cat alone over the weekend while I was out of town. My friend has two of these cameras in her apartment and has had them for over three years while loving them. For the price, I decided to give one a try to ease my anxiety.\nThe camera was delivered quickly, easy to set up, and easy to connect to my WiFi. I set it up and connected it to my WiFi and the camera app the night before I left. It was easy to build the scope of your room and the camera gives you four options to set and main points of focus. I set them up for the places my cat likes to lay in my bedroom.\nChecking the camera was easy, even at night due to the night vision of the camera. It’s bright, clear, and easy to move as needed to view different parts of the room. It’s extremely compact and light, and comes with the hardware to hang from a wall/ceiling if desired.\nFor the money, this is absolutely worth the ease of mind when leaving your pet/home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Best thing for going out of town for a couple of days! My cat was leery of it at first but now he’s used to it. I will be going out of town for 3 night and 4 days in December. With this, he will not miss any of his wet food meals. I have it set for 4am for 3 days in a row and then I clean and refill."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have been having difficulty with this camera for months. Turns out the camera wasn’t picking up motion because I changed the settings a while ago because it was so sensitive my phone was going off with every little sound even sounds outside my apartment it was driving me crazy. I called customer service and spoke with Alexander and he jumped right in, listened to my issue and gave proper instructions to fix the issue And then I realized I made the sensitivity too low which made the camera stop picking up motion, He was very patient and kind I think I will hold on to this camera now."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera to talk/watch my dog who has bad separation anxiety. I can talk to him if he starts barking, can hear me from other rooms in home also. It’s set up in my living room, installation was easy. I do not pay for extra features."
    },
    {
        "title": "",
        "rating": "",
        "text": "I didn't know how well I would like this camera, but I've had it now for a couple of months and its been great. The camera brightness is really nice. It also has night vision which is helpful as well. You are able to turn the camera to any direction and will get a full view of any room. The app works very well its easy to use. Gives me peace of mind when not at home."
    },
    {
        "title": "",
        "rating": "",
        "text": "It works for what I wanted. You do have to purchase like $40 a year subscription to save pictures to look at or video and it is grainy when you’re looking out of the distance but up close you can figure it out.. I got what I paid for"
    },
    {
        "title": "",
        "rating": "",
        "text": "Works and cover all of the angles of my house the app works well and I keeping plug in every time so I have access all day, just if you want to record need to be premium membership is just that I don’t liked"
    },
    {
        "title": "",
        "rating": "",
        "text": "I recently bought this camera and I’m really happy with it.\nThe video quality is great, the connection is stable, and it lets me check on my dog anytime I want.\nThe setup was very easy and didn’t take more than a few minutes.\nOverall, I’m very satisfied and would definitely recommend it to other pet"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa Smart 2023 New Indoor Pan-Tilt Security Camera (EC71) is a versatile and feature-rich security solution for monitoring your home, pets, and babies. With its 1080p HD video quality, night vision, motion detection, and compatibility with Alexa and Google Home, it offers a comprehensive security package. Its ability to pan and tilt provides extensive coverage, and options for both local and cloud storage add to its flexibility.\n\nKey Features:\n1. 360° Pan/Tilt Field of View:\n- The camera's 360° horizontal and 113° vertical range allows you to monitor an entire room or walkway. The Patrol Mode feature lets you set intervals to monitor different regions automatically.\n\n2. Motion Tracking:\n- The camera can automatically track moving objects or people, providing real-time alerts to enhance your security system's effectiveness.\n\n3. Detection & Instant Notification:\n- Get push notifications when motion or a person is detected. You can also enable baby crying detection, making it suitable as a baby monitor. Notifications help you discern important events from everyday activities.\n\n4. 2-Way Audio with Built-In Siren:\n- The 2-way audio feature allows you to communicate with pets or family members remotely. The built-in siren can deter intruders, enhancing home security.\n\n5. Secure Local or Cloud Storage:\n- Save footage on a microSD card (up to 256 GB, not included) or subscribe to Kasa Care for cloud storage with a 30-day video history and additional features like Video Summary and Activity Notifications with Snapshots.\n\n6. Night Vision up to 30 Ft.:\n- The integrated IR system provides clear night vision up to 30 feet, ensuring you don’t miss any activity in low-light conditions.\n\n7. 1080P Full HD Video:\n- Capture detailed 1080p Full HD video, making it easy to see small details like what your baby is holding or what your pet is playing with.\n\n8. Works with Alexa & Google Home:\n- Compatible with Amazon Alexa and Google Home, you can use voice commands to view live streams on devices like Echo Show or Google Chromecast.\n\nPros:\n- Extensive Coverage: The 360° pan and 113° tilt provide comprehensive room coverage.\n- Versatile Monitoring: Suitable for home security, pet monitoring, and baby monitoring.\n- Real-Time Alerts: Instant notifications for motion, people, and baby crying.\n- 2-Way Communication: Interact with pets or family members remotely.\n- Multiple Storage Options: Choose between local microSD storage and cloud storage with Kasa Care.\n- Clear Night Vision: Up to 30 feet of night vision ensures you don’t miss activity in the dark.\n- High-Definition Video: 1080p HD video for clear and detailed footage.\n- Smart Home Integration: Works seamlessly with Alexa and Google Home.\n\nCons:\n- Occasional Slow Response: Some users report that the camera can be slow to respond at times.\n- SD Card Not Included: The microSD card for local storage is not included, which requires an additional purchase.\n- Subscription Cost: Accessing full cloud storage features requires a subscription to Kasa Care.\n\nConclusion:\nThe Kasa Smart 2023 New Indoor Pan-Tilt Security Camera (EC71) is a highly functional and flexible security solution for any home. Its wide range of features, including motion tracking, 2-way audio, night vision, and compatibility with smart home devices, make it a standout choice. While there may be occasional slow response times, the overall performance and ease of use make it a worthwhile investment for enhancing your home security.\n\nRecommendation:\nI highly recommend this camera to anyone in need of a reliable and versatile indoor security solution. Its extensive features, coupled with high-definition video quality and smart home integration, provide excellent value for the price. Whether you're monitoring pets, babies, or general home security, this camera is a robust and user-friendly choice."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ll start by saying I’m super tech challenged! This was so easy to set up and just as easy to use! I’m only using it as a pet cam & for that purpose it is perfect! The picture is crystal clear and I’m honestly obsessed with checking on my pets now! If you need a mid day pick you up, get this! I smile every time I see them playing or stretching out relaxing. Only flaw I’ve found is when trying to use the follow the motion option it ends up set on my ceiling fan that stays on 100% of the time. Otherwise for the purpose I intended it for it is great quality, it detects my pets and is a nice size to sit on the feeding table I use. I bought a memory card to make setting up that much easier. This way I didn’t have to join any membership or anything."
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice little camera. Pretty inconspicuous. Clear view. Motion sensors could be a little better. Also, wish didn’t require a fee for recording."
    },
    {
        "title": "",
        "rating": "",
        "text": "So, I do security cameras for other folks as part of my job, but I needed an inexpensive, basic camera for inside my own home. This camera does well. Noise and motion detection is good (sometimes too good - it catches reflections real easy!). Yes, you can hear the motor when it turns, so, a little less quality build encasing the motor, but for the price - hey, that's reasonable (so 4 stars). The tracker gets bored quickly and resets to home. There are multiple features on this camera, like the patrol mode and zone monitoring that seem like they might be GREAT features. Frankly, I'm just too lazy to go through all the learning curves to deal with that (and the added features are not overly \"user friendly\" - and if that's the case for me, that means it's not pleasant for the average user, so a bonus, but a waste unless you want to take the time to learn it all). My living room is not large enough to need the full 360deg, and its noise detection can tell if someone's coming from off-screen. It does recognize people (which substituted the patrol mode for me). Great for night vision. Not obnoxious in size. Not intrusive. It's app is pretty basic - just like every other app out there but I DO like NO subscription fees just to \"use\" it (there may be some to store to the cloud?). It may have ads, but I haven't noticed. I did buy my own SD card, got the class 10, 256 GB high fidelity card, and ran this at 2k. Quality was GREAT. I tried 1080. Quality was still amazing. I went down to the 720... and quality was STILL great (but not for face recognition in low light). I'm not looking more than 25 - 30 feet away and the details are MORE than sufficient, giving me even longer record times before it overwrites. It doesn't always alert me on the app when it sees motion, that is touch and go? Maybe a network issue. I did have a 1-time loss of wifi with router at the very beginning, but that remedied itself. (and sometimes, it is slow to connect - but that is all network dependent, not necessarily the camera). Long story short - if someone's breaking into your home, you want to know immediately. You want faces. And, you want to be able to report it. This does that and well enough for the price (in fact, it just beeped at me thru my phone while sitting at work and typing this). Again, it's in the $30 - $40 range... so it's not going to be \"high class\". But, to get to that range, you're \"usually\" jumping into the $200-1200+ per camera category, so... for my tight budget, no. It has some mounting options, nothing fancy (like all others in this price range). It's corded, but you can always find solutions for that (and it's not a hidden cam, so cord doesn't really matter, and no battery powered cam will give you good, constant operations without fast draining). Funny note - it picked up motion on our TV screen while binging Supernatural! As an IT person who does camera set-up security, if you're on a budget, I recommend this. I was going to get a Hiseeu cam because of their quality build, but honestly, the Kasa has audio detection, better audio quality, near the same range of vertical motion, does not have to be mounted up-side down (can sit on its base), is smaller / less obvious, does well at night, does lack the \"emergency lights\" option (unless I'm mistaken, someone please correct me), and has a \"patrol\" mode (which, if you've ever used 360 degree cameras, you suddenly realize that it can't see someone coming from a blind spot and becomes obnoxiously useless without a patrol mode and/or audio detection) - and altogether, even tho the Hiseeu motor is quiet and the build is stronger (and it can pair with an NVR whereas I have no idea if the Kasa can), that STILL makes Kasa the better option for me (on a budget)."
    },
    {
        "title": "",
        "rating": "",
        "text": "The effect far exceeded my expectations. The night vision and picture clarity are both excellent. The installation is very simple, and it can also be monitored through my own Wi-Fi, allowing me to keep track of the store's situation even when I'm out."
    },
    {
        "title": "",
        "rating": "",
        "text": "I love this camera. Rotates, adjusts to sound and movement. Playback and other options. Battery life is good and it has a charging cord to stay plugged in if needed. Quality is overall good. A variety of angles. Camera looks and functions well, with good wifi connectivity."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have like about five of these and they all work very well. Never had an issue purchased a few years ago for my son who is nonverbal autistic and it is great for monitoring him with the Kasa app."
    },
    {
        "title": "",
        "rating": "",
        "text": "Camera does the job and all without having to pay fees monthly. Angle is great but the zooming isn't the best. Overall design gets the basic job done!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Recently, became nearly full time caregiver for my 77 year old mother. we tried a wrist based call bell but her capacity to learn, sadly has diminished. so, needed a discrete way to monitor her remotely. this camera is very discreet and matches the tv stand. she loves framed pictures so there is a pretty discreet opening that alllows nearly 360 degree view of the living room where she spends most of her time. I can move the camera remotely, and it even has a feature that will follow her as she moves. however, thus far i haven't used that feature very much. I think if the camera is moving alot, it may wear out the mechanism prematurely. camera seems well built, and make sure you get a Class 10 micro sd card. I bought amazon basics brand, and it works flawlessly, and if it starts to fail, they are cheap enough to replace. name brands go for over 40.00! yikes. i bought 128gb card. you can go as high as 256gb cards. but 128gb will get you probably over a week of footage. (your mileage may vary) depending on how active the camera is and how busy the area your monitoring is. you can turn off the front LED indicator, so camera is super discrete. the kasa app is super easy to use, and you can subscribe to kasa care for 30 days of recording history if you chose to. it's pretty reasonably priced as well, i personally don't use it, but like having that option.\ncamera ONLY WORKS on 2.5ghz network so make sure your setup allows you to assign devices to 2.4ghz band, word of caution, if your using a ISP supplied router, this won't work. you will need to go with 3rd party router (i use tp link) and it works flawlessly.\nyou can set the camera to listen for sound/motion and even a baby crying. there are settings that can be changed for sensitivty, and you can use patrol mode. camera will move/tilt up and down, at preset intervals.\nyou can talk through the camera if needed, i don't use this feature because i'm doing discreet monitoring.\nI have a very old kasa spot camera (probably 13 years old now) and it still works, but having some intermittent issues. I prefer all my cameras to be of the same brand, so i don't have to cycle through 2 or 3 different apps on my phone. app works well. and you can even download it on your MacBook if using ios. not sure about windows though, ive read it doesn't work with windows based systems.\nThis is a very good deal and a good price point, and has served it's purpose well, and i have only used this particular model for a few days.\nif you need discreet monitoring or surveillance this is a cost effective way to do it. i suggest getting the black one opposed to white. the color white sticks out like a sore thumb, but the black color blends in and assures discretion.\nway to go kasa! great camera at a great price."
    },
    {
        "title": "",
        "rating": "",
        "text": "LOVE this camera! Pans the room AND tilts up and down and you can talk to your dog to comfort them. I am using it with my puppy when she is in her playpen if I can't take her with me. The camera and picture quality is great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera works well and does connect to our phones. The only problem is that you can save the videos or view outside of real time without a subscription."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is my 2nd Kasa camera and I really like it. Only thing to note is that sound is not the best compared to other cameras I have. If you need this camera for the sound, then I would look into getting a different one. Connection was pretty straight forward. Once you are connected to your network, I haven't had any connectivity issues. In terms of visibility, you can move all around. Also, you can save favorite views of the place so you don't have to set it up every time you use it. Overall I recommend getting this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "I like this camera because it doesn't need internet and I don't have to have a subscription to see 24/7 videos because you can put a SD card for that. Also you can maneuver the camera on your phone app and you can put it to see up down to the right and to the left also it has night vision you can see clearly when the room is dark. Really nice camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "This little camera was super easy to setup and provides a beautiful picture. I also purchased an SD card to save videos."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera was very easy to set up. The picture and sound quality were excellent. Very user friendly."
    },
    {
        "title": "",
        "rating": "",
        "text": "Love this. Some slight Delay with the notifications which is why it gets a 4 out of 5. However clear picture and easy to setup. If you want to store data you would need to add a SIM card!"
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera works perfect, night vision is great and I can always hold to zoom on my phone.\nComes with some items for mounting on your wall as well. Great purchase."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is an excellent security camera that you don’t have to pay a monthly fee and you are notified when ever someone enters the room. Set up is not explained very well but you can get telephone support and that is what I did and Ivan was excellent in his directions and I was up and running first time out. I would recommend this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera works great. It have good quality. Very sensitive. Good product"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m honestly impressed with how well this camera performs. Setup was super easy with the Kasa app. It connected right away and started working within minutes. The pan and tilt feature is smooth and quiet, which makes it great for keeping an eye on pets or checking different parts of the room without needing multiple cameras.\n\nThe video quality is crisp (especially for 1080p), and the night vision is surprisingly clear. Motion detection alerts come through quickly, and I love that I can view live footage anytime from my phone. It even integrates perfectly with Alexa, so I can pull up the feed hands-free.\n\nOverall, it’s reliable, easy to use, and the peace of mind it gives me is well worth it. Highly recommend to anyone looking for an affordable, high-quality indoor camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I couldn’t be happier with my Kasa Spot Pan Tilt Camera! The picture quality is crisp, the movement is smooth, and the app makes it so easy to keep an eye on things. I’ll admit, I was a little nervous about setting it up, but thankfully I had the incredible support of Paolo, who went above and beyond to walk me through every step. He explained everything so clearly and patiently that the whole process turned from intimidating to effortless.\n\nThe camera itself is fantastic, but what really made this purchase a 5-star experience was the customer support. Paolo’s kindness, professionalism, and thorough explanations gave me complete confidence in using my new camera.\n\nIf you’re looking for a reliable, easy-to-use home security camera, I highly recommend the Kasa Spot Pan Tilt—and make sure to ask for Paolo if you need help getting started. He made all the difference!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This little pet camera has been awesome. Guess my daughter peace of mind to be able to check on the dog while we are away. The image is terrific. It sets up quick and easy. It is electric, so we don't have to worry about batteries wifi connectability has not proven any issues with speed. Would totally buy again."
    },
    {
        "title": "",
        "rating": "",
        "text": "for a small camera this works really well very happy with it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Wanted a camera just to see what my dog does when we are not home. Turns out, he sleeps - a LOT. Easy to set up, app works great."
    },
    {
        "title": "",
        "rating": "",
        "text": "So far its had a few ticks but its day one and bug seems fix, I will update to 5stars if all goes well this month !\nIf it contiues to work this would be unbeatable for the price and would recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa EC71 offers sharp 1080p video, smooth pan-tilt control, and easy app integration at a great price. It’s perfect for indoor monitoring of pets or rooms, with night vision and two-way audio included. Setup is simple, though it only supports 2.4 GHz Wi-Fi and lacks outdoor durability. A solid, budget-friendly smart camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "I needed another camera to watch a particular part of the house. This one was reasonably priced, and works very well. Easy to install. I also installed a small infrared, LED light, and at night the whole area is lit up, almost like daylight."
    },
    {
        "title": "",
        "rating": "",
        "text": "So easy to set up and install very convenient. I like the way it follows any movement around without you having to look around manually. It's very light. So if you hang it on the ceiling, you don't have to worry about it. Falling off or pulling the screws out. Because it's very light, hardly weighs anything at all. I'm actually adding 2 outside kasa cameras to my Amazon cart"
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent little camera I use for my office. Make sure you order a Micro card for recording so you don't have to pay for an cloud subscription.\nI purchased a 64 and it is more than enough space to record your events.\nMy daughter purchased one for the kids room and she loves it for monitoring the baby and kids."
    },
    {
        "title": "",
        "rating": "",
        "text": "Me encantó, la calidad de la cámara es muy buena y lo mejor puedes comunicarte con tus hijos desde el trabajo. Es muy fácil de activar."
    },
    {
        "title": "",
        "rating": "",
        "text": "Hi, so far I love my Kasa Cameras, the picture quality is superb especially the night vision, I’m wowed. The only thing I don’t like is that there’s no Alarm Button on it, why is that when it’s a Security Camera??. And why is there no fast forward or rewind button?"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa Smart Indoor Pan-Tilt Home Security Camera (EC71) is a fantastic option for anyone looking to add reliable, high-quality security or monitoring to their home. I purchased a used version for only $16—what an absolute steal for everything this camera offers! From picture quality to functionality, this camera delivers in every category. Here's my detailed breakdown:\n\nPicture Quality:\nThe 1080p HD video is crystal clear, capturing every detail in both light and dark environments. The night vision is particularly impressive—easily some of the best I’ve seen in any camera at this price range. It provides sharp and clear images, even in complete darkness, which makes it perfect for monitoring pets, children, or your home at night.\n\nAudio:\nThe Audio quality is great and not laggy at all! I was seriously impressed by how clear it is.\n\nPan & Tilt Functionality:\nThis camera's ability to pan and tilt is a game-changer. It provides a full view of the room, from front to back, with no blind spots. The tilt mode can also be set to Activity Tracking, which allows the camera to automatically follow any person or motion it detects. This feature works seamlessly and adds an extra layer of security and convenience.\n\nStorage Options:\nThe ability to use an SD card is a major plus, as it allows for local storage without the need for a subscription. If you prefer cloud storage, that’s also an option, giving you flexibility based on your needs.\n\nMounting & Installation:\nThe camera comes with easy-to-use mounting hardware, making installation a breeze. Whether you want to place it on a shelf or mount it on a wall, it’s simple to set up in minutes.\n\nApp & Smart Integration:\nThe Kasa Smart app is incredibly user-friendly and intuitive. You can view live footage, set up motion zones, control the pan and tilt, and even receive motion alerts—all from your phone. Plus, it integrates perfectly with Alexa and Google Home, allowing you to use voice commands for added convenience.\n\nExtra Features:\nMotion Detection Alerts: Get instant notifications on your phone whenever motion is detected.\nTwo-Way Audio: Communicate directly through the camera using your smartphone, whether you’re checking in on a pet or giving instructions to someone at home.\nCustomizable Motion Zones: You can define specific areas for the camera to monitor, reducing unnecessary alerts.\nWiFi Connectivity: Works seamlessly on 2.4GHz WiFi networks, ensuring a stable connection.\nFinal Thoughts:\nFor just $16 (used), this camera has exceeded my expectations in every way. It’s perfect for monitoring pets, children, or your home, and the pan-tilt function and night vision make it stand out from other cameras in this price range. The Kasa Smart app is intuitive and reliable, and the ability to use local SD card storage means no additional subscription costs.\n\nIf you're looking for a budget-friendly, high-quality indoor security camera with all the bells and whistles, this is it. Whether new or used, the Kasa Smart Indoor Pan-Tilt Camera is an incredible value for its price. Highly recommended! 🌟"
    },
    {
        "title": "",
        "rating": "",
        "text": "These cameras are excellent! The price paid is minimal compared to the total amount of functionality.\nThey do track objects that trigger them, maybe not as smoothly as higher priced options (I don’t know, have not tried others).\nFor the mobility of relocating the camera by simply picking it up and finding a new location, it’s massively more practical than the full wired systems available. Until you know where you want those more expensive cameras to be permanently installed, these cameras are a great alternative! Also, great for keeping a watch on who’s passing by your place at window-level.\n\nWired cameras have to be mounted high enough to be safe from getting ripped down by trespassers, these see through windows during the day very well. Interior night vision is top notch, seeing outside through windows at night is more difficult.\n\nWith the sensitivity turned up, every time a tree branch blows it triggers the cameras. This leads to near constant triggering of alerts during the late Spring, Summer and early Fall.\nAnd, lots of recordings every day. So, you need to use the App to designate areas to watch for motion, or it’ll drive you nuts and frustrate you. To the point that you may start to ignore the notices.\n\nThe App provides great control, and allows remote on/off, sensitivity setting changes, you can set to record noise triggers or remove that, set trigger zones, move the camera via the App, and other adjustments.\nI have noticed that the App actually does offer more functions, and work a little more smoothly, through my phone than my very new tablet. No idea why, it should be the same App for both platforms, no?\nBut, of course watching the playback on the larger screen is so much better, so I do use both.\n\nThe service plan allows storage of recordings from up to 10 cameras for $10 per month. Much more cost effective than others I looked into.\n\nThe cons:\nCan’t see thru glass with the built-in lights, at night. Reflection off the glass blinds the camera.\nThat should have been obvious to me from the start, since these are designed for indoor use only. but I had naively hoped for better night vision performance.\nSo, if looking out a window, get a motion-activated light to trigger so you can see what’s going on out there. Just don’t set it up where it will shine in your bedroom and wake you up.\n\nApp functionality on phone is higher than on tablet, no idea why. You will want to have the App on at least a phone, if not both.\n\nSometimes, some cameras will trigger, others won’t, for the same event.\nDeer moving around the house sometimes are ignored by one camera, recorded by another. Also happened that another outdoor camera from another manufacturer recorded a vehicle trespassing, these cameras didn’t. Had to adjust the sensor sensitivity, but I think the baseline software settings should be set to trigger sooner on vehicles.\n\nBranches moving on the breeze cause constant notices, even with Person Detection Mode activated.\nA more elaborate software system might offer better monitoring, but for the pro systems, this requires fully wired systems with dedicated main recording components/control systems . Much more expensive, and I can’t afford to open the walls throughout the property.\n\nOverall, these are great! I have bought several models, both the fixed ones and the bigger moving ones. All look great when set to the highest recording resolution, seem to last a long time, and are a breeze to set up or switch from spot to spot.\nI very much recommend this camera! I also hope the manufacturer can produce a 4K version."
    },
    {
        "title": "",
        "rating": "",
        "text": "Exelente buen producto funciona muy bien"
    },
    {
        "title": "",
        "rating": "",
        "text": "This cámara is amazing"
    },
    {
        "title": "",
        "rating": "",
        "text": "Got this to replace an older pet cam we use for our dog. It was super easy to set up. The picture quality is great during daytime and night. Camera can easily be adjusted side to side or up and down in view mode. Also has zoom capabilities. Size of your hand and not noticeable right away. Has sound and you can also talk through camera when viewing. The security of knowing we can look in on our dog while we’re out is nice. It can easily be unplugged and taken on vacation as well! Great purchase!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Quality size and function is great on this came works as it says. App is nice."
    },
    {
        "title": "",
        "rating": "",
        "text": "Le daría un 5 pero, si tienes un celular que no permite tener una memoria micro externa no podrás guardar las grabaciones, solo podrás ver la cámara en vivo. Tampoco me permite comprar el almacenamiento que trae la aplicación."
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought this to watch my pups while I’m gone, it’s exactly what I needed , works great, haven’t bought the sad card yet so just using it live, but it’s great"
    },
    {
        "title": "",
        "rating": "",
        "text": "Very good! Camera is worth it! Nice size where it can fit anywhere."
    },
    {
        "title": "",
        "rating": "",
        "text": "I got this indoor cam months ago and couldnt figure out how to get it going-- then ive have had many health problems that has kept me from getting help. Finally today in July,\nI was able to speak to a Kasa customer service helper named Aldrin... I am so pleased: he had me getting the camera connected and working in just a few minutes. I'm so happy because now I can get my outdoor version of this camera that shows via motion detection who or what is happening. I'm very grateful to Aldrin at kasa support. So the cool part of this device is the sd card is safely tucked below in the tilt panel below camera lens. This model moves about in Pan and tilt and left and right 360 motions. I did need to download the kasa app.\nmake sure you know your wifi password before starting the process. It was way easier to set up with help. If you don't understand something don't be afraid to contact support. It appears to me this is a fine little security cam. I got this to monitor my cats (and visiting animals) inside my garage. Not exposed to rain etc. So its inside. It is set to notify me when they come into area of detection. I have other kasa smart home plugs so I wanted to stay with a company I already liked. I do recommend this if it's your first camera.\nIt can record 24/7 onto my 128gb SD card, after the first 24hrs it used very little memory of the128gb. I figure I will erase it at some point.\nBut I saw you can subscribe to a kasa \"cloud type\" service. I was in a hurry so I didn't read that offer. I figured I can do later."
    },
    {
        "title": "",
        "rating": "",
        "text": "The reason I gave it4 stars is because it doesn't record like ring so if you miss something you can't go back and see it it's a good product if you just sitting watching it ,and its very hard setting it up I had to get my daughter to set it up for me ,. I purchased this to watch my mom whom has Dementia So therefore when I'm upstairs doing something I could look on my phone to see if she's OK But I really wish it would record or at least take a snapshot Does not let you"
    },
    {
        "title": "",
        "rating": "",
        "text": "I like it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Me encanto esta Camara, es divetido ver las cosas que suceden en casa mientras se esta trabajando, tiene opcion de guardr los videos en una micro USB o en la nuve."
    },
    {
        "title": "",
        "rating": "",
        "text": "Tiene buena imagen, incluso nocturna. La tengo en la sala más que nada para ver qué hacen mis perritas sin embargo también la giro hacia la puerta."
    },
    {
        "title": "",
        "rating": "",
        "text": "The ameee are the best cameras I have ever had I love their quality the very strong material the very impeccable image and above all I listen and listen to me very well, it has a good night vision and easy to install 👏🏻"
    },
    {
        "title": "",
        "rating": "",
        "text": "The quality is honestly pretty decent for the price but it doesnt always catch all motion. 😔 i bought this camera to make sure my cat is okay when im not home or nearby but it only gives me SOME motion detection notifications not all, even when im in the room with my cat it doesnt detect me which is kind of annoying especially since me and my cat always have funny moments together. thought the camera would catch it but nope😔"
    },
    {
        "title": "",
        "rating": "",
        "text": "Se ve muy bien en colores es Perfecto el Precio"
    },
    {
        "title": "",
        "rating": "",
        "text": "Size is okay and is some what easy to setup if you know what your doing and brightness is okay battery life is good and quality is okay and great security"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa app wants you to buy the monthly subscription. Go to the Google play store and down load one of the other apps and you can by pass the subscription."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buena resolucion y es igual que en la foto"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera! Mounts easy. Picture quality is excellent!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought 3 of these for my inside my home. They work super great. Clear picture when you use it on your phone and you can also use your tv to view the cameras. You can also detail the camera if you need sounds for a baby or kids. Very nice 100% recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great quality and nice that it has the slot for the sd card."
    },
    {
        "title": "",
        "rating": "",
        "text": "Sometimes it turns on by itself and can't be turned off through the mobile app. In that case, you need to unplug the power and restart it."
    },
    {
        "title": "",
        "rating": "",
        "text": "Works great a must have for inside garage or porch as long as its under a covered porch it gets great day or night photos great inside security camera, you need a SD card to be able to record 24/7 and its not very costly either. Thanks for this amazing camera, a inside photo of me at work now if you can see how clear the image is here well the night vision is just as great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera is so great! I was definitely sceptical about it given how cheap it was, but I am so happy I bought it. It's so easy to turn on and set up. The app is great, besides having small issues with payment for kasa care. The quality of the image and the night vision are awesome. I love that it moves around to track any motion. I'm using it to keep an eye on my 9 week old foster kitten and it detects even the smallest movements she makes. You can change the motion sensitivity though. Overall I think this product is amazing and way worth the money!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Esta muy muy buena y a un excelente precio comprar con ella una tarjeta SD a mi falto pero yo feliz con mi compra"
    },
    {
        "title": "",
        "rating": "",
        "text": "This purchase was the second attempt to find a wi-fi camera for my elderly mom’s room. It helps us to see when she is awake at night. This camera was so easy to set up, unlike a previous purchase that would stop working. I will purchase this one again for other areas in my home. Picture is clear and the device provides clear sound quality to speak to your loved ones remotely. I think you will be happy with this device, like I am."
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s ok suited it’s purpose"
    },
    {
        "title": "",
        "rating": "",
        "text": "Mi vida si no has comprado esto no te lo\nPierdas es excelente las tengo en mi casa msravillosa las tengo cuarto sala donde quiera maravillosas"
    },
    {
        "title": "",
        "rating": "",
        "text": "Charlayne Oquindo Helped me from customer service! Very polite and patient. Now camera works perfectly"
    },
    {
        "title": "",
        "rating": "",
        "text": "I really like the cameras. I got them for the dogs when I am out the house. Connection is good, but the mic is delayed. But it’s a good product"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have more security and peace of mind since I acquired it because I can control my house in real time"
    },
    {
        "title": "",
        "rating": "",
        "text": "Lo mejor"
    },
    {
        "title": "",
        "rating": "",
        "text": "My first security camera and it did not disappoint. The flexibility of 360 of the best feature. It also has zoom which is an additional bonus"
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought two of these. Great camera and great price. The app is easy to follow. We used these to monitor my MIL while on hospice in our home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Totally recommended!!! Works perfect even in no light condition, easy to set up and works as expected."
    },
    {
        "title": "",
        "rating": "",
        "text": "I am writing this review for the Kasa smart indoor camera EC70, features may change from past to future models. I do have a separate security system for the outdoors, and I wanted something simple and portable to use indoors. I chose the Kasa camera because I already have the Kasa smart plugs. For about $20 dollars this is a camera with a lot of nice features. It is extremely easy to install and use. First, download the Kasa Smart App and create an account. Second, plug the camera into a power source, open the app add the camera and follow the directions. Once added, use the 3rd party tab to add to your Alexa account and google home account. If you already have added those accounts, then the camera will automatically be added and you can access it through the Alexa and google home app. The camera once added did require a firmware update and this took about 2 minutes. Some helpful tips I learned during my encounter with set up. The EC70 camera will accept a microSD card from 8 to 256GB used for local storage. Even though it tells you during set up to add, you will NOT be able to do so unless the camera is tilted up as high as it can go. So, you may have to finish set up, then start the camera and tilt it up before you can install it. For the Alexa app, the app will NOT turn the EC70 camera on or off. I am able to connect the camera to my Echo Show and FireTV only. The camera WILL send notifications to any Amazon device, and you are able to pick which devices to receive notifications. For google home, it is essentially the same, you need to have a Nest or Chromecast device in order to view the EC70 camera output. You probably will need to use the google help page for instructions on how to set it up. You can set the EC70 camera for different views of the area you wish to see, and can also place it on patrol mode to automatically move to each view. There are a wide range of positions available to meet your particular specifications and needs. The camera is mobile, unless you attach it to a wall or ceiling with the included bracket. The picture quality is great, and you do have options for the video quality settings depending on your wifi. I read other reviews and some of the negativity of the EC70 camera most likely is due to your wifi, not the actual equipment. I have used this camera to watch the front door when I am in the back, and also to watch the dogs. It is nice to receive the notification that they are at the door, so I can let them out to do their business. I am very happy with my purchase. I hope you find this review helpful."
    },
    {
        "title": "",
        "rating": "",
        "text": "This product deserves my first review. I do special needs pet rescue and this camera is easy to set up and lets me see how the animals are adapting when I’m not home. The night vision is incredible. Just ordered another!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Renald is a good agent, well explained & highly recommended"
    },
    {
        "title": "",
        "rating": "",
        "text": "Connects well, easy to use, and very affordable. I love it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great quality camera for a cheap price!!! Night vision and normal day vision video quality is excellent. Haven't had any issues with lagging either. The tilt and rotate all work great. We got 3 several months ago. 1 stopped working BUT it was dropped twice. No connectivity issues, super easy to set up and doesn't require reconnection after its unplugged and plugged back in."
    },
    {
        "title": "",
        "rating": "",
        "text": "EXTREMELY EASY TO USE • COST-EFFECTIVE • VERSATILE • SATISFYING: I happened to buy a 4-pack of Kasa smart plugs recently. After experiencing firsthand how easy it was to integrate them into my existing and very average home Wi-Fi system - not to mention tie their control into existing Amazon smart devices such as my Echo Dot and EchoPop - I simply couldn't resist the urge to (join the rest of you in the 21st century and) purchase a camera.\n\nAPPLICATION: I wanted an easy to buy, implement, use and maintain a remote controllable and reasonably 'smart' surveillance system - just to keep an eye on things that happen on the street. I learned very quickly the Kasa camera system has features that enable it to not only track motion but specifically people when desired (see Activity Zones IMG) ; features include various levels of tracking up to and including \"Patrol Mode\" which will cause the camera to rotate through the four savable \"scenes\" at the specified interval(s) allowing for 360° monitoring from just one camera. Even has NIGHT VISION.\n\nI actually bought two cameras and haven't even set up the second one because the first is already doing so much!\n\nTIPS & TRICKS: Make sure you purchase a reasonable quality 64 GB mini SD card. That is the maximum size card this model of Kasa camera can utilize. TO INSERT THE CARD: using the mobile interface pan the camera upward until the mini SD card port and reset buttons are exposed (see IMGs.) Insert the card LABEL UP and press until firmly clicked and secured in its final position. I have been running the camera \"24/7\" (the actual mode is known as \"24/7 Monitoring\") at maximum resolution of 1080p for ~ 3 days and have used less than 25% of the 64 GB capacity. (see IMGs)\n\nHOW TO SAVE EVIDENCE: Should something unfortunate occur and you find yourself in the position of needing to save that which your camera captured you can simply click on \"24/7 recording\" & move the saved timeline bar to the requisite point, wait for playback to start and click the 🔴 in the lower right-hand portion on the playback screen. (Note: Give the video recall some time - after all it is the camera having to go back and read saved data while still recording and saving new data, transmit saved data through the Wi-Fi network to your phone and ultimately save it in a new location. Even the fastest systems will take a moment.) Following these steps will save a video of what was recorded that you will find in your video gallery. *There is a portion of the app allocated to Activity Alerts Tracking which is available with a Kasa Care subscription; I do not have that subscription thus I am unable to speak to those features at this time but imagine they facilitate easier activity recall and saving.\n\nWHAT TO DO NOW: Click purchase. 😊 Seriously this thing is fabulous especially for the price point. Off the top of my head some of the easiest applications I can think of would be keeping an eye on your pets or your kids while they're at home or having an extra pair of eyes when needed.\n\n*** Keep in mind this review is written from the standpoint of someone seeking easy applications and easy use - If you are looking for something that is sturdy, has own/redundant power, data storage and signaling capacity, is designed to survive not only adverse weather/climate but also potential tampering this is not the device I would recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "Amazing camera for peace of mind. I’m a dog trainer, and have a “dog room” in my garage, and this camera was a LIFE saver! I seriously have so much more peace of mind knowing even if I leave my home, I can still see what’s going on and have a track record of everything that has happened if need be to show clients proof. It also allows others to join, so my employee can join as well and update accordingly. It’s very motion sensitive which I WANT and picks up even when the dogs are just barking and I need to go in there to see what’s going on. Amazing tool for pet owners, care takers, buisness owners, and people who just want general security in their home & want to know what’s going on and have a record of such.\n\nDisclaimer** amazing for nanny cams, pet cams, and general monitoring but it does have a monthly subscription to be able to save videos, but it’s very low & absolutely worth it to me as someone who operates a business and likes a paper trail.\n\nAll in all, have had no issues with connection (and mine is in my garage!!!) so far away from the router, no issues with the app, and I’ve been extremely satirized with all that it can do for the price!\n\nDefinitely worth it. 10 out of 10!"
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s a great product, I only wish it allowed storage in the case I can’t look at the camera immediately. However great quality for the price. You’re still able to move it from your phone when away, and can hear audio or turn off audio"
    },
    {
        "title": "",
        "rating": "",
        "text": "Setup was a breeze—just downloaded the app following the steps, and it was operational within 10 minutes.\" Also the video quality is excellent 👌"
    },
    {
        "title": "",
        "rating": "",
        "text": "Tried a WYZE v4 first but turns out it was about as useful a camera as a brick would be.\n\nIt would NOT connect to my WIFI from either of my routers(I have a Xfinity modem/router but it's old so I bought a Netgear Nighthawk some years ago to boost the signal at a one time cost rather than renting extra equipment every month from Xfinity cause they refuse to replace anything that's outdated), it would NOT get detected by the WYZE app whether I used the same wifi signal or not so I couldn't even troubleshoot it since the app didn't know it existed in the first place. To make matters worse it costs $45 which is the most expensive brick I ever owned in my life so I returned it for a full refund and decided to try 1 more time with a cheaper but comparable camera. That's when I picked this up.\n\nI went in a skeptic assuming I would have the same problems as I always did with WYZE(tried a v3 or maybe v2 years ago, same problem as the v4 so I guess WYZE is just incapable of actual improvement and favors dumb gimmicks instead. The only thing that changed was the app layout which admittedly LOOKS better now but looks can be deceiving...)\n\nTurns out I was wrong and NOT every camera on Amazon is an overpriced pile of junk! This camera is half the price, connected immediately with 0 delays and functions exactly as advertised. This cameras App has performed nearly perfectly and I can even move this camera FAR from my router without any impact on the signal quality. I can keep my phone on 5G and STILL use EVERY feature on the app. I can also be far away from my router, house, and this camera without losing any features. That means I can get notified of activities, pan/tilt manually, toggle NV, change app settings/schedules, set up to 4 viewpoints, set detection zones in said viewpoints, record manually, turn the status LED on/off, download recorded activities(manual recordings OR detection-based recordings) and Etc...\n\nThe cloud service is cheap but in a GOOD way. Only $3/month per device(up to 4) or $10/month for up to 10 devices which is extremely affordable.\n\nThe quality of videos is very good IMO although I do wish the Frame rate was a little higher(I don't KNOW the exact Frame Rate but I'm a big time Gamer who just loves loves LOVES to toggle his FPS display ON and set it to high accuracy mode.) Based on what I have seen so far I think it's about 10-15 FPS so really fast movements will look like a smudge but natural movements shouldn't have that problem. It might not be the BEST option for monitoring(I don't know WHAT is cause this is only my 3rd attempt at finding a decent camera for basic monitoring but it's gone above and beyond my expectations at this pricepoint.) I'm actually about to get 2 or 3 more of these once I finish and submit my updated review.\n\nSome notes:\nWhen you plug it in for the first time it will probably start moving suddenly on it's own, this is NORMAL. It's a way to test the motor and range of motion for the pan/tilt feature and can be done manually in the app as well. I've moved to different outlets twice now and it has not done that on it's own either time leading me to believe it's only a one-time automated check up of sorts.\n\nBy coincidence, I found one minor flaw on the app which I'm not sure was a fluke or an actual Bug. I was watching a live video feed and tried to manually record something I wasn't sure would trigger motion detection but apparently it DID and my fool self forgot about the minor delay so it popped up in my notification panel \"Activity detected on ___\" but did not appear in the app right away so I refreshed it. When I went to reciew download it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera, put in an SD card with a lot of memory, add the Kasa app and you’ve got an instant security system with no monthly fees. When we’re on vacation we can see what’s going on at our house, rotate the camera for different views, and have it notify us of unusual sounds. I have one looking out the front window and one on a back window, if it hears a noise inside I rotate it to look in the house. It sees in the dark. Works great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have 5 of these cameras. One has stopped working, after two years. It does not pan very much anymore. The otherd still work, but they sometimes have issues connecting while I am away from home and I have to re-add them when I get home for it to work again. The SD card for recording also gets \"corrupted \" occasionally and requires reformatting. But as I use them to monitor my dog when I'm not home, the recording is not 100% necessary."
    },
    {
        "title": "",
        "rating": "",
        "text": "To clarify, this is NOT a bad camera. Quite the opposite, as a matter of fact. I have the same camera, just the slightly \"cheaper\" version. When I say, \"cheaper\" I don't mean cheap. I just mean it costs less. I would not classify either version as cheap. If this review were for the \"basic\" model, it would have five stars. The reason for this model receiving just 3 of 5 possible stars is because there is an option for the camera to pan and tilt. It has motion detection and will automatically patrol if you choose it to do so. These functionalities all work fine and as expected. The motion sensing is actually pretty great and from an upstairs window it will catch people walking all the way across the street, which is much farther than the advertised 30 foot distance. The night vision works, but not through a window.\n\nI've never had any connection problems after having gotten it initially setup. That was kind of a pain, in all honesty. You wouldn't think it, but manually scrolling the camera to point upwards just to reach the reset button or to access the SD card is a poor design choice, in my opinion. The fact that's where the reset connection button is also makes it annoying, because you press and hold the button for it to begin doing its thing, searching for networks and devices and whatnot. Sometimes it will find the network and everything you're looking for right away, but other times it gives you the most confusing run around until you've disconnected and restarted the camera about a dozen times.\n\nThat being said, once you get the camera connected to your network and through the app, it works pretty flawlessly. It does load a little bit slow, so if you get a notification and open it up live, the motion that it caught may have already come and gone, but you can always revert to the 24/7 recording function and search through the recording history with footnotes that will take you right to the motion or object detection. Say a person walks by, it will save a bookmark for person detected. With a 256gb SD card, my camera tends to hold about 2-3 weeks worth of footage and I record 24/7.\n\nI used the motion tracking feature for a little while after I first got the camera so that I could follow people to see which direction they've gone after they pass my apartment. I have my parking space right in front of my unit, but someone still slashed the tires one night, hence the camera. It's a great feature, but I have a lot of car and foot traffic in front of my house that caused the camera to be panning left and right far too often. I didn't want to overwork it, so I turned it off. I don't think this is a quality issue here, but a motor/gear issue within the camera body itself that controls the panning and tilting functions that sound like they'll get pretty tired pretty soon if there's a lot of motion tracking. It doesn't sound terrible and it's only as loud as a very small fraction of a vibrating phone when it turns, but in a quiet room and it's tracking people in the early morning it's enough for you to want it to stop. But it's as easy as opening the settings and turning off motion tracking, but it will still record. If you have constant patrol or motion tracking, it's likely to run out of motor power sooner than later. I didn't want to put it to the test, because you can set \"viewpoints\" to your devices. I set up three viewpoints to cover my parking space and vehicle. I have a viewpoint to the left, with my vehicle on the right side of the frame. I have a second viewpoint that points directly at my vehicle, dead center in the parking space, and I have another viewpoint that keeps my vehicle in the left side of the frame. I can view a large swath of the street in front of my house and my neighbors feel better knowing I have a decent camera, because we all know that our complexes security cameras suck and point at nothing of importance.\n\nSo, to hit the algorithm for the cameras durability - I don't think they're waterproof, I wouldn't want to drop it, it is made out of cheap plastic after all, but I've never had any lens issues so far. My biggest worry about it's long-term durability would be focused mostly on the gears and motor that turns and pans the camera.\n\nWithin the My Kasa app, you can open it and it will display your list of devices, assuming you have multiple. If it's just a single device, it will show just the one device. You can select your device and it will pull up its real-time live feed. There is a microphone and audio settings on it, so if it's inside you can talk to your dog or whatever, you can hear your dog bark etc.\n\nMy other issue with this camera, and this is specifically about the white version of the camera that supposedly has a higher quality of video (something I could not tell the difference between, I'll explain here shortly) is the fact that when it does go through motion tracking or any sort of panning, it will return to its original viewpoint. That would be fine, having my vehicle dead center, but the viewpoint tells itself that the real viewpoint is several degrees off and is often pointing a bit higher than you originally had the viewpoint set. This leads you to having to reset the pan/tilt of the device almost every time it's done tracking motion.\n\nNow the difference in definition and quality, for me, was negligible, at best. Neither of the cameras could clearly read my license plate, so there was no difference in resolution quality there. I think the white version is supposed to be running a higher quality camera, but I think it's built off of the basic materials still used in the base model, which causes it to have a lag, slight delay, and it takes longer to load in the app. If anything, the higher \"quality\" is actually reduced because I don't think the hardware can withstand the power of the software and the lens capabilities.\n\nLong story short, get the base model for $20 and you won't be happier. Beats a $100 Ring by miles. If you really want a doorbell that badly, then I guess get a Ring and have fun changing the terribly short-lasting batteries every day. Or hardwire it into your wall, which, if we're being real here, is something that pretty much nobody ever feels like doing."
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s a great camera. It can rotate so that I can look around my whole room and I’m able to see clearly and speak through it. Very nice to see and talk to my pets while I’m not home.\nBUT! I do not like how hot the camera gets after my 10 hour work shift. When I get home the camera feels pretty hot to touch along with the power block. With how hot it gets, I am too nervous to continue using because I’m scared that one day I’m going to see the camera explode and my apartment on fire. The whole point of why I want a camera is to see my pets safe. Because of how hot it gets, I do not trust this camera and have not used it since.\n\nI have seen this camera do a 360 and stopped at me and titled up pointing the camera at my face. Idk if it’s like a calibration thing or what, but talk about freaky. 10/10 freaky overheating camera. I’m moving on to a different camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I had reservations about purchasing this camera due to reviews about the camera not lasting very long. So far, I've not experienced any issues with the camera.\n\nI don't like the fact that I can't set a schedule for when the camera is on/off. The only option is for the camera to run 24/7 or to manually turn the camera off by unplugging it or using a surge suppressor strip with a power switch.\n\nI love the ability to set specific locations that I can quickly access when viewing through the camera from my smartphone. That is a really nice feature in my opinion.\n\nNight vision is exceptional, especially if you have street lighting. I have my camera set up to view out of one of the windows at the front of our home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Product was super simple to set up and use. Many people find it's a hassle to set up the cameras to access the app on their phones to view while away from home. This one is super simple and so I no longer have to see which one of my 2 dogs started the horseplay and tore my freshly made bed up I simply review the footage and know already so I can call them out by name. Dogs are not happy because Chaos likes being able to blame his older brother Jaxson but now the gig is up. Chaos you are guilty!! But seriously all true it does work great and simple to set up. Motion sets the camera to run so no holding or finding a spot to sit it abd you still miss everything as it rotates too. Buy it you will love it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought this to keep an eye on my two \"house dogs\". that has a tendency to get a little wild when left alone very long. I wasn't sure it would work the way I wanted it to. I was afraid I would need to be connected to wi fi on both the camera and my phone, but only needs the camera connected. I was pleasantly surprised when I was out in the boonies, with no wi fi anywhere near, that I could watch the dogs and speak to them if I need to. Works great in the car also."
    },
    {
        "title": "",
        "rating": "",
        "text": "Ive purchased two of these cameras to spy on my birds while I'm at work and I love them! They are so simple to set up and use, the app is great! The camera visibility is very clear and you have the ability to zoom in and out. I think the best feature of this is the notification for movement detection! I appreciate having a notification to my phone when I am away and I see someone has entered my apartment, yep my maintenance loves to come in unannounced. And you better believe I am screen recording their movements and talking through the camera to them, also another nice feature! All in All, This Is a BUY!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This has been the BEST camera I’ve had! Just the one camera covers the entire room! I love the motion detection and the person detection features! You can record 24 hours a day with a SD Card , so you won’t miss a beat! Plus with the 2-way microphone, you can speak to whoever is in the room with the camera or your pets from far away! Definitely a great buy, totally worth the money!"
    },
    {
        "title": "",
        "rating": "",
        "text": "La cámara inteligente Kasa Pan/Tilt es una excelente opción para vigilar el hogar. La imagen en 1080p es muy nítida, incluso en condiciones de poca luz, y el modo visión nocturna ofrece buena claridad sin saturar los tonos.\n\nLa función Pan/Tilt permite mover la cámara desde la app con suavidad y amplio rango, ideal para cubrir toda una habitación. La configuración es rápida y sencilla, la app Kasa es intuitiva y se conecta fácilmente a redes de 2.4 GHz.\n\nEl audio bidireccional funciona muy bien: el micrófono capta con claridad y el altavoz es suficientemente fuerte para comunicarte con alguien en casa o con tu mascota. También se integra fácilmente con Alexa y Google Assistant, lo que añade comodidad.\n\nEn resumen, una cámara compacta, fiable y con excelente calidad de imagen, perfecta para seguridad doméstica o monitoreo de bebés y mascotas. Muy recomendable por su relación calidad-precio."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buy this camera!! It has everything needed. It pans all ways and it sounds quiet compared to another one I tired. It auto adjusts to day and night. It has a microphone to talk into and also one to hear from. You can insert a mini SD for 24 hr recording if needed. You connect the app to your phone and it will notify you if there is every any motion detected from a human or pet."
    },
    {
        "title": "",
        "rating": "",
        "text": "It takes great videos, but wasn’t tracking motion. I contacted the company and was told that we have to have BOTH patrol and motion tracking on for the motion tracking to work.\nThe view is clear, and colors are crisp and accurate, and after looking up the instructions found here on Amazon ( nothing included in the box) I found where the sd card goes. I can find the videos that were taken and are in the app, but cannot find the still shots that it says are saved to “photos”. The still shots (screenshots) are not in my phone photo gallery, nor can I see anywhere in the app that they are stored. That is frustrating.\nI already had to Kasa app because I have a bunch of the smart plugs, so this was incredibly easy to set up. If there were better information here on Amazon for this product, I might give it a 5*. But for now it only gets 4."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ve had this camera for over two years and it works perfectly. Due to poor WiFi signal I was having difficulty resetting it. Called Kasa and spoke w Jonathan. Very helpful and patient w me in adding my cameras as new devices. He walked me through in a professional manner and got my sense of humor. They were down for a while bc it’s for my Dad and we don’t live close, but now I have comfort in seeing his whereabouts. Highly recommend cameras and their support team!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice size of item, connects to wifi, and has options to set up areas of your choice to keep a close eye on. Also rotates anywhere when motion is detected, and can be used to talk to others. You can purchase a micro chip to record anything around. Has an app to download to keep an eye on things while you're away from home"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m a really anxious cat parent and had to leave my cat alone over the weekend while I was out of town. My friend has two of these cameras in her apartment and has had them for over three years while loving them. For the price, I decided to give one a try to ease my anxiety.\nThe camera was delivered quickly, easy to set up, and easy to connect to my WiFi. I set it up and connected it to my WiFi and the camera app the night before I left. It was easy to build the scope of your room and the camera gives you four options to set and main points of focus. I set them up for the places my cat likes to lay in my bedroom.\nChecking the camera was easy, even at night due to the night vision of the camera. It’s bright, clear, and easy to move as needed to view different parts of the room. It’s extremely compact and light, and comes with the hardware to hang from a wall/ceiling if desired.\nFor the money, this is absolutely worth the ease of mind when leaving your pet/home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Best thing for going out of town for a couple of days! My cat was leery of it at first but now he’s used to it. I will be going out of town for 3 night and 4 days in December. With this, he will not miss any of his wet food meals. I have it set for 4am for 3 days in a row and then I clean and refill."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have been having difficulty with this camera for months. Turns out the camera wasn’t picking up motion because I changed the settings a while ago because it was so sensitive my phone was going off with every little sound even sounds outside my apartment it was driving me crazy. I called customer service and spoke with Alexander and he jumped right in, listened to my issue and gave proper instructions to fix the issue And then I realized I made the sensitivity too low which made the camera stop picking up motion, He was very patient and kind I think I will hold on to this camera now."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera to talk/watch my dog who has bad separation anxiety. I can talk to him if he starts barking, can hear me from other rooms in home also. It’s set up in my living room, installation was easy. I do not pay for extra features."
    },
    {
        "title": "",
        "rating": "",
        "text": "I didn't know how well I would like this camera, but I've had it now for a couple of months and its been great. The camera brightness is really nice. It also has night vision which is helpful as well. You are able to turn the camera to any direction and will get a full view of any room. The app works very well its easy to use. Gives me peace of mind when not at home."
    },
    {
        "title": "",
        "rating": "",
        "text": "It works for what I wanted. You do have to purchase like $40 a year subscription to save pictures to look at or video and it is grainy when you’re looking out of the distance but up close you can figure it out.. I got what I paid for"
    },
    {
        "title": "",
        "rating": "",
        "text": "Works and cover all of the angles of my house the app works well and I keeping plug in every time so I have access all day, just if you want to record need to be premium membership is just that I don’t liked"
    },
    {
        "title": "",
        "rating": "",
        "text": "I recently bought this camera and I’m really happy with it.\nThe video quality is great, the connection is stable, and it lets me check on my dog anytime I want.\nThe setup was very easy and didn’t take more than a few minutes.\nOverall, I’m very satisfied and would definitely recommend it to other pet"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa Smart 2023 New Indoor Pan-Tilt Security Camera (EC71) is a versatile and feature-rich security solution for monitoring your home, pets, and babies. With its 1080p HD video quality, night vision, motion detection, and compatibility with Alexa and Google Home, it offers a comprehensive security package. Its ability to pan and tilt provides extensive coverage, and options for both local and cloud storage add to its flexibility.\n\nKey Features:\n1. 360° Pan/Tilt Field of View:\n- The camera's 360° horizontal and 113° vertical range allows you to monitor an entire room or walkway. The Patrol Mode feature lets you set intervals to monitor different regions automatically.\n\n2. Motion Tracking:\n- The camera can automatically track moving objects or people, providing real-time alerts to enhance your security system's effectiveness.\n\n3. Detection & Instant Notification:\n- Get push notifications when motion or a person is detected. You can also enable baby crying detection, making it suitable as a baby monitor. Notifications help you discern important events from everyday activities.\n\n4. 2-Way Audio with Built-In Siren:\n- The 2-way audio feature allows you to communicate with pets or family members remotely. The built-in siren can deter intruders, enhancing home security.\n\n5. Secure Local or Cloud Storage:\n- Save footage on a microSD card (up to 256 GB, not included) or subscribe to Kasa Care for cloud storage with a 30-day video history and additional features like Video Summary and Activity Notifications with Snapshots.\n\n6. Night Vision up to 30 Ft.:\n- The integrated IR system provides clear night vision up to 30 feet, ensuring you don’t miss any activity in low-light conditions.\n\n7. 1080P Full HD Video:\n- Capture detailed 1080p Full HD video, making it easy to see small details like what your baby is holding or what your pet is playing with.\n\n8. Works with Alexa & Google Home:\n- Compatible with Amazon Alexa and Google Home, you can use voice commands to view live streams on devices like Echo Show or Google Chromecast.\n\nPros:\n- Extensive Coverage: The 360° pan and 113° tilt provide comprehensive room coverage.\n- Versatile Monitoring: Suitable for home security, pet monitoring, and baby monitoring.\n- Real-Time Alerts: Instant notifications for motion, people, and baby crying.\n- 2-Way Communication: Interact with pets or family members remotely.\n- Multiple Storage Options: Choose between local microSD storage and cloud storage with Kasa Care.\n- Clear Night Vision: Up to 30 feet of night vision ensures you don’t miss activity in the dark.\n- High-Definition Video: 1080p HD video for clear and detailed footage.\n- Smart Home Integration: Works seamlessly with Alexa and Google Home.\n\nCons:\n- Occasional Slow Response: Some users report that the camera can be slow to respond at times.\n- SD Card Not Included: The microSD card for local storage is not included, which requires an additional purchase.\n- Subscription Cost: Accessing full cloud storage features requires a subscription to Kasa Care.\n\nConclusion:\nThe Kasa Smart 2023 New Indoor Pan-Tilt Security Camera (EC71) is a highly functional and flexible security solution for any home. Its wide range of features, including motion tracking, 2-way audio, night vision, and compatibility with smart home devices, make it a standout choice. While there may be occasional slow response times, the overall performance and ease of use make it a worthwhile investment for enhancing your home security.\n\nRecommendation:\nI highly recommend this camera to anyone in need of a reliable and versatile indoor security solution. Its extensive features, coupled with high-definition video quality and smart home integration, provide excellent value for the price. Whether you're monitoring pets, babies, or general home security, this camera is a robust and user-friendly choice."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ll start by saying I’m super tech challenged! This was so easy to set up and just as easy to use! I’m only using it as a pet cam & for that purpose it is perfect! The picture is crystal clear and I’m honestly obsessed with checking on my pets now! If you need a mid day pick you up, get this! I smile every time I see them playing or stretching out relaxing. Only flaw I’ve found is when trying to use the follow the motion option it ends up set on my ceiling fan that stays on 100% of the time. Otherwise for the purpose I intended it for it is great quality, it detects my pets and is a nice size to sit on the feeding table I use. I bought a memory card to make setting up that much easier. This way I didn’t have to join any membership or anything."
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice little camera. Pretty inconspicuous. Clear view. Motion sensors could be a little better. Also, wish didn’t require a fee for recording."
    },
    {
        "title": "",
        "rating": "",
        "text": "So, I do security cameras for other folks as part of my job, but I needed an inexpensive, basic camera for inside my own home. This camera does well. Noise and motion detection is good (sometimes too good - it catches reflections real easy!). Yes, you can hear the motor when it turns, so, a little less quality build encasing the motor, but for the price - hey, that's reasonable (so 4 stars). The tracker gets bored quickly and resets to home. There are multiple features on this camera, like the patrol mode and zone monitoring that seem like they might be GREAT features. Frankly, I'm just too lazy to go through all the learning curves to deal with that (and the added features are not overly \"user friendly\" - and if that's the case for me, that means it's not pleasant for the average user, so a bonus, but a waste unless you want to take the time to learn it all). My living room is not large enough to need the full 360deg, and its noise detection can tell if someone's coming from off-screen. It does recognize people (which substituted the patrol mode for me). Great for night vision. Not obnoxious in size. Not intrusive. It's app is pretty basic - just like every other app out there but I DO like NO subscription fees just to \"use\" it (there may be some to store to the cloud?). It may have ads, but I haven't noticed. I did buy my own SD card, got the class 10, 256 GB high fidelity card, and ran this at 2k. Quality was GREAT. I tried 1080. Quality was still amazing. I went down to the 720... and quality was STILL great (but not for face recognition in low light). I'm not looking more than 25 - 30 feet away and the details are MORE than sufficient, giving me even longer record times before it overwrites. It doesn't always alert me on the app when it sees motion, that is touch and go? Maybe a network issue. I did have a 1-time loss of wifi with router at the very beginning, but that remedied itself. (and sometimes, it is slow to connect - but that is all network dependent, not necessarily the camera). Long story short - if someone's breaking into your home, you want to know immediately. You want faces. And, you want to be able to report it. This does that and well enough for the price (in fact, it just beeped at me thru my phone while sitting at work and typing this). Again, it's in the $30 - $40 range... so it's not going to be \"high class\". But, to get to that range, you're \"usually\" jumping into the $200-1200+ per camera category, so... for my tight budget, no. It has some mounting options, nothing fancy (like all others in this price range). It's corded, but you can always find solutions for that (and it's not a hidden cam, so cord doesn't really matter, and no battery powered cam will give you good, constant operations without fast draining). Funny note - it picked up motion on our TV screen while binging Supernatural! As an IT person who does camera set-up security, if you're on a budget, I recommend this. I was going to get a Hiseeu cam because of their quality build, but honestly, the Kasa has audio detection, better audio quality, near the same range of vertical motion, does not have to be mounted up-side down (can sit on its base), is smaller / less obvious, does well at night, does lack the \"emergency lights\" option (unless I'm mistaken, someone please correct me), and has a \"patrol\" mode (which, if you've ever used 360 degree cameras, you suddenly realize that it can't see someone coming from a blind spot and becomes obnoxiously useless without a patrol mode and/or audio detection) - and altogether, even tho the Hiseeu motor is quiet and the build is stronger (and it can pair with an NVR whereas I have no idea if the Kasa can), that STILL makes Kasa the better option for me (on a budget)."
    },
    {
        "title": "",
        "rating": "",
        "text": "The effect far exceeded my expectations. The night vision and picture clarity are both excellent. The installation is very simple, and it can also be monitored through my own Wi-Fi, allowing me to keep track of the store's situation even when I'm out."
    },
    {
        "title": "",
        "rating": "",
        "text": "I love this camera. Rotates, adjusts to sound and movement. Playback and other options. Battery life is good and it has a charging cord to stay plugged in if needed. Quality is overall good. A variety of angles. Camera looks and functions well, with good wifi connectivity."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have like about five of these and they all work very well. Never had an issue purchased a few years ago for my son who is nonverbal autistic and it is great for monitoring him with the Kasa app."
    },
    {
        "title": "",
        "rating": "",
        "text": "Camera does the job and all without having to pay fees monthly. Angle is great but the zooming isn't the best. Overall design gets the basic job done!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Recently, became nearly full time caregiver for my 77 year old mother. we tried a wrist based call bell but her capacity to learn, sadly has diminished. so, needed a discrete way to monitor her remotely. this camera is very discreet and matches the tv stand. she loves framed pictures so there is a pretty discreet opening that alllows nearly 360 degree view of the living room where she spends most of her time. I can move the camera remotely, and it even has a feature that will follow her as she moves. however, thus far i haven't used that feature very much. I think if the camera is moving alot, it may wear out the mechanism prematurely. camera seems well built, and make sure you get a Class 10 micro sd card. I bought amazon basics brand, and it works flawlessly, and if it starts to fail, they are cheap enough to replace. name brands go for over 40.00! yikes. i bought 128gb card. you can go as high as 256gb cards. but 128gb will get you probably over a week of footage. (your mileage may vary) depending on how active the camera is and how busy the area your monitoring is. you can turn off the front LED indicator, so camera is super discrete. the kasa app is super easy to use, and you can subscribe to kasa care for 30 days of recording history if you chose to. it's pretty reasonably priced as well, i personally don't use it, but like having that option.\ncamera ONLY WORKS on 2.5ghz network so make sure your setup allows you to assign devices to 2.4ghz band, word of caution, if your using a ISP supplied router, this won't work. you will need to go with 3rd party router (i use tp link) and it works flawlessly.\nyou can set the camera to listen for sound/motion and even a baby crying. there are settings that can be changed for sensitivty, and you can use patrol mode. camera will move/tilt up and down, at preset intervals.\nyou can talk through the camera if needed, i don't use this feature because i'm doing discreet monitoring.\nI have a very old kasa spot camera (probably 13 years old now) and it still works, but having some intermittent issues. I prefer all my cameras to be of the same brand, so i don't have to cycle through 2 or 3 different apps on my phone. app works well. and you can even download it on your MacBook if using ios. not sure about windows though, ive read it doesn't work with windows based systems.\nThis is a very good deal and a good price point, and has served it's purpose well, and i have only used this particular model for a few days.\nif you need discreet monitoring or surveillance this is a cost effective way to do it. i suggest getting the black one opposed to white. the color white sticks out like a sore thumb, but the black color blends in and assures discretion.\nway to go kasa! great camera at a great price."
    },
    {
        "title": "",
        "rating": "",
        "text": "LOVE this camera! Pans the room AND tilts up and down and you can talk to your dog to comfort them. I am using it with my puppy when she is in her playpen if I can't take her with me. The camera and picture quality is great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera works well and does connect to our phones. The only problem is that you can save the videos or view outside of real time without a subscription."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is my 2nd Kasa camera and I really like it. Only thing to note is that sound is not the best compared to other cameras I have. If you need this camera for the sound, then I would look into getting a different one. Connection was pretty straight forward. Once you are connected to your network, I haven't had any connectivity issues. In terms of visibility, you can move all around. Also, you can save favorite views of the place so you don't have to set it up every time you use it. Overall I recommend getting this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "I like this camera because it doesn't need internet and I don't have to have a subscription to see 24/7 videos because you can put a SD card for that. Also you can maneuver the camera on your phone app and you can put it to see up down to the right and to the left also it has night vision you can see clearly when the room is dark. Really nice camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "This little camera was super easy to setup and provides a beautiful picture. I also purchased an SD card to save videos."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera was very easy to set up. The picture and sound quality were excellent. Very user friendly."
    },
    {
        "title": "",
        "rating": "",
        "text": "Love this. Some slight Delay with the notifications which is why it gets a 4 out of 5. However clear picture and easy to setup. If you want to store data you would need to add a SIM card!"
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera works perfect, night vision is great and I can always hold to zoom on my phone.\nComes with some items for mounting on your wall as well. Great purchase."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is an excellent security camera that you don’t have to pay a monthly fee and you are notified when ever someone enters the room. Set up is not explained very well but you can get telephone support and that is what I did and Ivan was excellent in his directions and I was up and running first time out. I would recommend this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera works great. It have good quality. Very sensitive. Good product"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m honestly impressed with how well this camera performs. Setup was super easy with the Kasa app. It connected right away and started working within minutes. The pan and tilt feature is smooth and quiet, which makes it great for keeping an eye on pets or checking different parts of the room without needing multiple cameras.\n\nThe video quality is crisp (especially for 1080p), and the night vision is surprisingly clear. Motion detection alerts come through quickly, and I love that I can view live footage anytime from my phone. It even integrates perfectly with Alexa, so I can pull up the feed hands-free.\n\nOverall, it’s reliable, easy to use, and the peace of mind it gives me is well worth it. Highly recommend to anyone looking for an affordable, high-quality indoor camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I couldn’t be happier with my Kasa Spot Pan Tilt Camera! The picture quality is crisp, the movement is smooth, and the app makes it so easy to keep an eye on things. I’ll admit, I was a little nervous about setting it up, but thankfully I had the incredible support of Paolo, who went above and beyond to walk me through every step. He explained everything so clearly and patiently that the whole process turned from intimidating to effortless.\n\nThe camera itself is fantastic, but what really made this purchase a 5-star experience was the customer support. Paolo’s kindness, professionalism, and thorough explanations gave me complete confidence in using my new camera.\n\nIf you’re looking for a reliable, easy-to-use home security camera, I highly recommend the Kasa Spot Pan Tilt—and make sure to ask for Paolo if you need help getting started. He made all the difference!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This little pet camera has been awesome. Guess my daughter peace of mind to be able to check on the dog while we are away. The image is terrific. It sets up quick and easy. It is electric, so we don't have to worry about batteries wifi connectability has not proven any issues with speed. Would totally buy again."
    },
    {
        "title": "",
        "rating": "",
        "text": "for a small camera this works really well very happy with it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Wanted a camera just to see what my dog does when we are not home. Turns out, he sleeps - a LOT. Easy to set up, app works great."
    },
    {
        "title": "",
        "rating": "",
        "text": "So far its had a few ticks but its day one and bug seems fix, I will update to 5stars if all goes well this month !\nIf it contiues to work this would be unbeatable for the price and would recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa EC71 offers sharp 1080p video, smooth pan-tilt control, and easy app integration at a great price. It’s perfect for indoor monitoring of pets or rooms, with night vision and two-way audio included. Setup is simple, though it only supports 2.4 GHz Wi-Fi and lacks outdoor durability. A solid, budget-friendly smart camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "I needed another camera to watch a particular part of the house. This one was reasonably priced, and works very well. Easy to install. I also installed a small infrared, LED light, and at night the whole area is lit up, almost like daylight."
    },
    {
        "title": "",
        "rating": "",
        "text": "So easy to set up and install very convenient. I like the way it follows any movement around without you having to look around manually. It's very light. So if you hang it on the ceiling, you don't have to worry about it. Falling off or pulling the screws out. Because it's very light, hardly weighs anything at all. I'm actually adding 2 outside kasa cameras to my Amazon cart"
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent little camera I use for my office. Make sure you order a Micro card for recording so you don't have to pay for an cloud subscription.\nI purchased a 64 and it is more than enough space to record your events.\nMy daughter purchased one for the kids room and she loves it for monitoring the baby and kids."
    },
    {
        "title": "",
        "rating": "",
        "text": "Me encantó, la calidad de la cámara es muy buena y lo mejor puedes comunicarte con tus hijos desde el trabajo. Es muy fácil de activar."
    },
    {
        "title": "",
        "rating": "",
        "text": "Hi, so far I love my Kasa Cameras, the picture quality is superb especially the night vision, I’m wowed. The only thing I don’t like is that there’s no Alarm Button on it, why is that when it’s a Security Camera??. And why is there no fast forward or rewind button?"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa Smart Indoor Pan-Tilt Home Security Camera (EC71) is a fantastic option for anyone looking to add reliable, high-quality security or monitoring to their home. I purchased a used version for only $16—what an absolute steal for everything this camera offers! From picture quality to functionality, this camera delivers in every category. Here's my detailed breakdown:\n\nPicture Quality:\nThe 1080p HD video is crystal clear, capturing every detail in both light and dark environments. The night vision is particularly impressive—easily some of the best I’ve seen in any camera at this price range. It provides sharp and clear images, even in complete darkness, which makes it perfect for monitoring pets, children, or your home at night.\n\nAudio:\nThe Audio quality is great and not laggy at all! I was seriously impressed by how clear it is.\n\nPan & Tilt Functionality:\nThis camera's ability to pan and tilt is a game-changer. It provides a full view of the room, from front to back, with no blind spots. The tilt mode can also be set to Activity Tracking, which allows the camera to automatically follow any person or motion it detects. This feature works seamlessly and adds an extra layer of security and convenience.\n\nStorage Options:\nThe ability to use an SD card is a major plus, as it allows for local storage without the need for a subscription. If you prefer cloud storage, that’s also an option, giving you flexibility based on your needs.\n\nMounting & Installation:\nThe camera comes with easy-to-use mounting hardware, making installation a breeze. Whether you want to place it on a shelf or mount it on a wall, it’s simple to set up in minutes.\n\nApp & Smart Integration:\nThe Kasa Smart app is incredibly user-friendly and intuitive. You can view live footage, set up motion zones, control the pan and tilt, and even receive motion alerts—all from your phone. Plus, it integrates perfectly with Alexa and Google Home, allowing you to use voice commands for added convenience.\n\nExtra Features:\nMotion Detection Alerts: Get instant notifications on your phone whenever motion is detected.\nTwo-Way Audio: Communicate directly through the camera using your smartphone, whether you’re checking in on a pet or giving instructions to someone at home.\nCustomizable Motion Zones: You can define specific areas for the camera to monitor, reducing unnecessary alerts.\nWiFi Connectivity: Works seamlessly on 2.4GHz WiFi networks, ensuring a stable connection.\nFinal Thoughts:\nFor just $16 (used), this camera has exceeded my expectations in every way. It’s perfect for monitoring pets, children, or your home, and the pan-tilt function and night vision make it stand out from other cameras in this price range. The Kasa Smart app is intuitive and reliable, and the ability to use local SD card storage means no additional subscription costs.\n\nIf you're looking for a budget-friendly, high-quality indoor security camera with all the bells and whistles, this is it. Whether new or used, the Kasa Smart Indoor Pan-Tilt Camera is an incredible value for its price. Highly recommended! 🌟"
    },
    {
        "title": "",
        "rating": "",
        "text": "These cameras are excellent! The price paid is minimal compared to the total amount of functionality.\nThey do track objects that trigger them, maybe not as smoothly as higher priced options (I don’t know, have not tried others).\nFor the mobility of relocating the camera by simply picking it up and finding a new location, it’s massively more practical than the full wired systems available. Until you know where you want those more expensive cameras to be permanently installed, these cameras are a great alternative! Also, great for keeping a watch on who’s passing by your place at window-level.\n\nWired cameras have to be mounted high enough to be safe from getting ripped down by trespassers, these see through windows during the day very well. Interior night vision is top notch, seeing outside through windows at night is more difficult.\n\nWith the sensitivity turned up, every time a tree branch blows it triggers the cameras. This leads to near constant triggering of alerts during the late Spring, Summer and early Fall.\nAnd, lots of recordings every day. So, you need to use the App to designate areas to watch for motion, or it’ll drive you nuts and frustrate you. To the point that you may start to ignore the notices.\n\nThe App provides great control, and allows remote on/off, sensitivity setting changes, you can set to record noise triggers or remove that, set trigger zones, move the camera via the App, and other adjustments.\nI have noticed that the App actually does offer more functions, and work a little more smoothly, through my phone than my very new tablet. No idea why, it should be the same App for both platforms, no?\nBut, of course watching the playback on the larger screen is so much better, so I do use both.\n\nThe service plan allows storage of recordings from up to 10 cameras for $10 per month. Much more cost effective than others I looked into.\n\nThe cons:\nCan’t see thru glass with the built-in lights, at night. Reflection off the glass blinds the camera.\nThat should have been obvious to me from the start, since these are designed for indoor use only. but I had naively hoped for better night vision performance.\nSo, if looking out a window, get a motion-activated light to trigger so you can see what’s going on out there. Just don’t set it up where it will shine in your bedroom and wake you up.\n\nApp functionality on phone is higher than on tablet, no idea why. You will want to have the App on at least a phone, if not both.\n\nSometimes, some cameras will trigger, others won’t, for the same event.\nDeer moving around the house sometimes are ignored by one camera, recorded by another. Also happened that another outdoor camera from another manufacturer recorded a vehicle trespassing, these cameras didn’t. Had to adjust the sensor sensitivity, but I think the baseline software settings should be set to trigger sooner on vehicles.\n\nBranches moving on the breeze cause constant notices, even with Person Detection Mode activated.\nA more elaborate software system might offer better monitoring, but for the pro systems, this requires fully wired systems with dedicated main recording components/control systems . Much more expensive, and I can’t afford to open the walls throughout the property.\n\nOverall, these are great! I have bought several models, both the fixed ones and the bigger moving ones. All look great when set to the highest recording resolution, seem to last a long time, and are a breeze to set up or switch from spot to spot.\nI very much recommend this camera! I also hope the manufacturer can produce a 4K version."
    },
    {
        "title": "",
        "rating": "",
        "text": "Exelente buen producto funciona muy bien"
    },
    {
        "title": "",
        "rating": "",
        "text": "This cámara is amazing"
    },
    {
        "title": "",
        "rating": "",
        "text": "Got this to replace an older pet cam we use for our dog. It was super easy to set up. The picture quality is great during daytime and night. Camera can easily be adjusted side to side or up and down in view mode. Also has zoom capabilities. Size of your hand and not noticeable right away. Has sound and you can also talk through camera when viewing. The security of knowing we can look in on our dog while we’re out is nice. It can easily be unplugged and taken on vacation as well! Great purchase!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Quality size and function is great on this came works as it says. App is nice."
    },
    {
        "title": "",
        "rating": "",
        "text": "Le daría un 5 pero, si tienes un celular que no permite tener una memoria micro externa no podrás guardar las grabaciones, solo podrás ver la cámara en vivo. Tampoco me permite comprar el almacenamiento que trae la aplicación."
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought this to watch my pups while I’m gone, it’s exactly what I needed , works great, haven’t bought the sad card yet so just using it live, but it’s great"
    },
    {
        "title": "",
        "rating": "",
        "text": "Very good! Camera is worth it! Nice size where it can fit anywhere."
    },
    {
        "title": "",
        "rating": "",
        "text": "I got this indoor cam months ago and couldnt figure out how to get it going-- then ive have had many health problems that has kept me from getting help. Finally today in July,\nI was able to speak to a Kasa customer service helper named Aldrin... I am so pleased: he had me getting the camera connected and working in just a few minutes. I'm so happy because now I can get my outdoor version of this camera that shows via motion detection who or what is happening. I'm very grateful to Aldrin at kasa support. So the cool part of this device is the sd card is safely tucked below in the tilt panel below camera lens. This model moves about in Pan and tilt and left and right 360 motions. I did need to download the kasa app.\nmake sure you know your wifi password before starting the process. It was way easier to set up with help. If you don't understand something don't be afraid to contact support. It appears to me this is a fine little security cam. I got this to monitor my cats (and visiting animals) inside my garage. Not exposed to rain etc. So its inside. It is set to notify me when they come into area of detection. I have other kasa smart home plugs so I wanted to stay with a company I already liked. I do recommend this if it's your first camera.\nIt can record 24/7 onto my 128gb SD card, after the first 24hrs it used very little memory of the128gb. I figure I will erase it at some point.\nBut I saw you can subscribe to a kasa \"cloud type\" service. I was in a hurry so I didn't read that offer. I figured I can do later."
    },
    {
        "title": "",
        "rating": "",
        "text": "The reason I gave it4 stars is because it doesn't record like ring so if you miss something you can't go back and see it it's a good product if you just sitting watching it ,and its very hard setting it up I had to get my daughter to set it up for me ,. I purchased this to watch my mom whom has Dementia So therefore when I'm upstairs doing something I could look on my phone to see if she's OK But I really wish it would record or at least take a snapshot Does not let you"
    },
    {
        "title": "",
        "rating": "",
        "text": "I like it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Me encanto esta Camara, es divetido ver las cosas que suceden en casa mientras se esta trabajando, tiene opcion de guardr los videos en una micro USB o en la nuve."
    },
    {
        "title": "",
        "rating": "",
        "text": "Tiene buena imagen, incluso nocturna. La tengo en la sala más que nada para ver qué hacen mis perritas sin embargo también la giro hacia la puerta."
    },
    {
        "title": "",
        "rating": "",
        "text": "The ameee are the best cameras I have ever had I love their quality the very strong material the very impeccable image and above all I listen and listen to me very well, it has a good night vision and easy to install 👏🏻"
    },
    {
        "title": "",
        "rating": "",
        "text": "The quality is honestly pretty decent for the price but it doesnt always catch all motion. 😔 i bought this camera to make sure my cat is okay when im not home or nearby but it only gives me SOME motion detection notifications not all, even when im in the room with my cat it doesnt detect me which is kind of annoying especially since me and my cat always have funny moments together. thought the camera would catch it but nope😔"
    },
    {
        "title": "",
        "rating": "",
        "text": "Se ve muy bien en colores es Perfecto el Precio"
    },
    {
        "title": "",
        "rating": "",
        "text": "Size is okay and is some what easy to setup if you know what your doing and brightness is okay battery life is good and quality is okay and great security"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa app wants you to buy the monthly subscription. Go to the Google play store and down load one of the other apps and you can by pass the subscription."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buena resolucion y es igual que en la foto"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera! Mounts easy. Picture quality is excellent!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought 3 of these for my inside my home. They work super great. Clear picture when you use it on your phone and you can also use your tv to view the cameras. You can also detail the camera if you need sounds for a baby or kids. Very nice 100% recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great quality and nice that it has the slot for the sd card."
    },
    {
        "title": "",
        "rating": "",
        "text": "Sometimes it turns on by itself and can't be turned off through the mobile app. In that case, you need to unplug the power and restart it."
    },
    {
        "title": "",
        "rating": "",
        "text": "Works great a must have for inside garage or porch as long as its under a covered porch it gets great day or night photos great inside security camera, you need a SD card to be able to record 24/7 and its not very costly either. Thanks for this amazing camera, a inside photo of me at work now if you can see how clear the image is here well the night vision is just as great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera is so great! I was definitely sceptical about it given how cheap it was, but I am so happy I bought it. It's so easy to turn on and set up. The app is great, besides having small issues with payment for kasa care. The quality of the image and the night vision are awesome. I love that it moves around to track any motion. I'm using it to keep an eye on my 9 week old foster kitten and it detects even the smallest movements she makes. You can change the motion sensitivity though. Overall I think this product is amazing and way worth the money!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Esta muy muy buena y a un excelente precio comprar con ella una tarjeta SD a mi falto pero yo feliz con mi compra"
    },
    {
        "title": "",
        "rating": "",
        "text": "This purchase was the second attempt to find a wi-fi camera for my elderly mom’s room. It helps us to see when she is awake at night. This camera was so easy to set up, unlike a previous purchase that would stop working. I will purchase this one again for other areas in my home. Picture is clear and the device provides clear sound quality to speak to your loved ones remotely. I think you will be happy with this device, like I am."
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s ok suited it’s purpose"
    },
    {
        "title": "",
        "rating": "",
        "text": "Mi vida si no has comprado esto no te lo\nPierdas es excelente las tengo en mi casa msravillosa las tengo cuarto sala donde quiera maravillosas"
    },
    {
        "title": "",
        "rating": "",
        "text": "Charlayne Oquindo Helped me from customer service! Very polite and patient. Now camera works perfectly"
    },
    {
        "title": "",
        "rating": "",
        "text": "I really like the cameras. I got them for the dogs when I am out the house. Connection is good, but the mic is delayed. But it’s a good product"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have more security and peace of mind since I acquired it because I can control my house in real time"
    },
    {
        "title": "",
        "rating": "",
        "text": "Lo mejor"
    },
    {
        "title": "",
        "rating": "",
        "text": "My first security camera and it did not disappoint. The flexibility of 360 of the best feature. It also has zoom which is an additional bonus"
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought two of these. Great camera and great price. The app is easy to follow. We used these to monitor my MIL while on hospice in our home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Totally recommended!!! Works perfect even in no light condition, easy to set up and works as expected."
    },
    {
        "title": "",
        "rating": "",
        "text": "I am writing this review for the Kasa smart indoor camera EC70, features may change from past to future models. I do have a separate security system for the outdoors, and I wanted something simple and portable to use indoors. I chose the Kasa camera because I already have the Kasa smart plugs. For about $20 dollars this is a camera with a lot of nice features. It is extremely easy to install and use. First, download the Kasa Smart App and create an account. Second, plug the camera into a power source, open the app add the camera and follow the directions. Once added, use the 3rd party tab to add to your Alexa account and google home account. If you already have added those accounts, then the camera will automatically be added and you can access it through the Alexa and google home app. The camera once added did require a firmware update and this took about 2 minutes. Some helpful tips I learned during my encounter with set up. The EC70 camera will accept a microSD card from 8 to 256GB used for local storage. Even though it tells you during set up to add, you will NOT be able to do so unless the camera is tilted up as high as it can go. So, you may have to finish set up, then start the camera and tilt it up before you can install it. For the Alexa app, the app will NOT turn the EC70 camera on or off. I am able to connect the camera to my Echo Show and FireTV only. The camera WILL send notifications to any Amazon device, and you are able to pick which devices to receive notifications. For google home, it is essentially the same, you need to have a Nest or Chromecast device in order to view the EC70 camera output. You probably will need to use the google help page for instructions on how to set it up. You can set the EC70 camera for different views of the area you wish to see, and can also place it on patrol mode to automatically move to each view. There are a wide range of positions available to meet your particular specifications and needs. The camera is mobile, unless you attach it to a wall or ceiling with the included bracket. The picture quality is great, and you do have options for the video quality settings depending on your wifi. I read other reviews and some of the negativity of the EC70 camera most likely is due to your wifi, not the actual equipment. I have used this camera to watch the front door when I am in the back, and also to watch the dogs. It is nice to receive the notification that they are at the door, so I can let them out to do their business. I am very happy with my purchase. I hope you find this review helpful."
    },
    {
        "title": "",
        "rating": "",
        "text": "This product deserves my first review. I do special needs pet rescue and this camera is easy to set up and lets me see how the animals are adapting when I’m not home. The night vision is incredible. Just ordered another!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Renald is a good agent, well explained & highly recommended"
    },
    {
        "title": "",
        "rating": "",
        "text": "Connects well, easy to use, and very affordable. I love it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great quality camera for a cheap price!!! Night vision and normal day vision video quality is excellent. Haven't had any issues with lagging either. The tilt and rotate all work great. We got 3 several months ago. 1 stopped working BUT it was dropped twice. No connectivity issues, super easy to set up and doesn't require reconnection after its unplugged and plugged back in."
    },
    {
        "title": "",
        "rating": "",
        "text": "EXTREMELY EASY TO USE • COST-EFFECTIVE • VERSATILE • SATISFYING: I happened to buy a 4-pack of Kasa smart plugs recently. After experiencing firsthand how easy it was to integrate them into my existing and very average home Wi-Fi system - not to mention tie their control into existing Amazon smart devices such as my Echo Dot and EchoPop - I simply couldn't resist the urge to (join the rest of you in the 21st century and) purchase a camera.\n\nAPPLICATION: I wanted an easy to buy, implement, use and maintain a remote controllable and reasonably 'smart' surveillance system - just to keep an eye on things that happen on the street. I learned very quickly the Kasa camera system has features that enable it to not only track motion but specifically people when desired (see Activity Zones IMG) ; features include various levels of tracking up to and including \"Patrol Mode\" which will cause the camera to rotate through the four savable \"scenes\" at the specified interval(s) allowing for 360° monitoring from just one camera. Even has NIGHT VISION.\n\nI actually bought two cameras and haven't even set up the second one because the first is already doing so much!\n\nTIPS & TRICKS: Make sure you purchase a reasonable quality 64 GB mini SD card. That is the maximum size card this model of Kasa camera can utilize. TO INSERT THE CARD: using the mobile interface pan the camera upward until the mini SD card port and reset buttons are exposed (see IMGs.) Insert the card LABEL UP and press until firmly clicked and secured in its final position. I have been running the camera \"24/7\" (the actual mode is known as \"24/7 Monitoring\") at maximum resolution of 1080p for ~ 3 days and have used less than 25% of the 64 GB capacity. (see IMGs)\n\nHOW TO SAVE EVIDENCE: Should something unfortunate occur and you find yourself in the position of needing to save that which your camera captured you can simply click on \"24/7 recording\" & move the saved timeline bar to the requisite point, wait for playback to start and click the 🔴 in the lower right-hand portion on the playback screen. (Note: Give the video recall some time - after all it is the camera having to go back and read saved data while still recording and saving new data, transmit saved data through the Wi-Fi network to your phone and ultimately save it in a new location. Even the fastest systems will take a moment.) Following these steps will save a video of what was recorded that you will find in your video gallery. *There is a portion of the app allocated to Activity Alerts Tracking which is available with a Kasa Care subscription; I do not have that subscription thus I am unable to speak to those features at this time but imagine they facilitate easier activity recall and saving.\n\nWHAT TO DO NOW: Click purchase. 😊 Seriously this thing is fabulous especially for the price point. Off the top of my head some of the easiest applications I can think of would be keeping an eye on your pets or your kids while they're at home or having an extra pair of eyes when needed.\n\n*** Keep in mind this review is written from the standpoint of someone seeking easy applications and easy use - If you are looking for something that is sturdy, has own/redundant power, data storage and signaling capacity, is designed to survive not only adverse weather/climate but also potential tampering this is not the device I would recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "Amazing camera for peace of mind. I’m a dog trainer, and have a “dog room” in my garage, and this camera was a LIFE saver! I seriously have so much more peace of mind knowing even if I leave my home, I can still see what’s going on and have a track record of everything that has happened if need be to show clients proof. It also allows others to join, so my employee can join as well and update accordingly. It’s very motion sensitive which I WANT and picks up even when the dogs are just barking and I need to go in there to see what’s going on. Amazing tool for pet owners, care takers, buisness owners, and people who just want general security in their home & want to know what’s going on and have a record of such.\n\nDisclaimer** amazing for nanny cams, pet cams, and general monitoring but it does have a monthly subscription to be able to save videos, but it’s very low & absolutely worth it to me as someone who operates a business and likes a paper trail.\n\nAll in all, have had no issues with connection (and mine is in my garage!!!) so far away from the router, no issues with the app, and I’ve been extremely satirized with all that it can do for the price!\n\nDefinitely worth it. 10 out of 10!"
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s a great product, I only wish it allowed storage in the case I can’t look at the camera immediately. However great quality for the price. You’re still able to move it from your phone when away, and can hear audio or turn off audio"
    },
    {
        "title": "",
        "rating": "",
        "text": "Setup was a breeze—just downloaded the app following the steps, and it was operational within 10 minutes.\" Also the video quality is excellent 👌"
    },
    {
        "title": "",
        "rating": "",
        "text": "Tried a WYZE v4 first but turns out it was about as useful a camera as a brick would be.\n\nIt would NOT connect to my WIFI from either of my routers(I have a Xfinity modem/router but it's old so I bought a Netgear Nighthawk some years ago to boost the signal at a one time cost rather than renting extra equipment every month from Xfinity cause they refuse to replace anything that's outdated), it would NOT get detected by the WYZE app whether I used the same wifi signal or not so I couldn't even troubleshoot it since the app didn't know it existed in the first place. To make matters worse it costs $45 which is the most expensive brick I ever owned in my life so I returned it for a full refund and decided to try 1 more time with a cheaper but comparable camera. That's when I picked this up.\n\nI went in a skeptic assuming I would have the same problems as I always did with WYZE(tried a v3 or maybe v2 years ago, same problem as the v4 so I guess WYZE is just incapable of actual improvement and favors dumb gimmicks instead. The only thing that changed was the app layout which admittedly LOOKS better now but looks can be deceiving...)\n\nTurns out I was wrong and NOT every camera on Amazon is an overpriced pile of junk! This camera is half the price, connected immediately with 0 delays and functions exactly as advertised. This cameras App has performed nearly perfectly and I can even move this camera FAR from my router without any impact on the signal quality. I can keep my phone on 5G and STILL use EVERY feature on the app. I can also be far away from my router, house, and this camera without losing any features. That means I can get notified of activities, pan/tilt manually, toggle NV, change app settings/schedules, set up to 4 viewpoints, set detection zones in said viewpoints, record manually, turn the status LED on/off, download recorded activities(manual recordings OR detection-based recordings) and Etc...\n\nThe cloud service is cheap but in a GOOD way. Only $3/month per device(up to 4) or $10/month for up to 10 devices which is extremely affordable.\n\nThe quality of videos is very good IMO although I do wish the Frame rate was a little higher(I don't KNOW the exact Frame Rate but I'm a big time Gamer who just loves loves LOVES to toggle his FPS display ON and set it to high accuracy mode.) Based on what I have seen so far I think it's about 10-15 FPS so really fast movements will look like a smudge but natural movements shouldn't have that problem. It might not be the BEST option for monitoring(I don't know WHAT is cause this is only my 3rd attempt at finding a decent camera for basic monitoring but it's gone above and beyond my expectations at this pricepoint.) I'm actually about to get 2 or 3 more of these once I finish and submit my updated review.\n\nSome notes:\nWhen you plug it in for the first time it will probably start moving suddenly on it's own, this is NORMAL. It's a way to test the motor and range of motion for the pan/tilt feature and can be done manually in the app as well. I've moved to different outlets twice now and it has not done that on it's own either time leading me to believe it's only a one-time automated check up of sorts.\n\nBy coincidence, I found one minor flaw on the app which I'm not sure was a fluke or an actual Bug. I was watching a live video feed and tried to manually record something I wasn't sure would trigger motion detection but apparently it DID and my fool self forgot about the minor delay so it popped up in my notification panel \"Activity detected on ___\" but did not appear in the app right away so I refreshed it. When I went to reciew download it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera, put in an SD card with a lot of memory, add the Kasa app and you’ve got an instant security system with no monthly fees. When we’re on vacation we can see what’s going on at our house, rotate the camera for different views, and have it notify us of unusual sounds. I have one looking out the front window and one on a back window, if it hears a noise inside I rotate it to look in the house. It sees in the dark. Works great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have 5 of these cameras. One has stopped working, after two years. It does not pan very much anymore. The otherd still work, but they sometimes have issues connecting while I am away from home and I have to re-add them when I get home for it to work again. The SD card for recording also gets \"corrupted \" occasionally and requires reformatting. But as I use them to monitor my dog when I'm not home, the recording is not 100% necessary."
    },
    {
        "title": "",
        "rating": "",
        "text": "To clarify, this is NOT a bad camera. Quite the opposite, as a matter of fact. I have the same camera, just the slightly \"cheaper\" version. When I say, \"cheaper\" I don't mean cheap. I just mean it costs less. I would not classify either version as cheap. If this review were for the \"basic\" model, it would have five stars. The reason for this model receiving just 3 of 5 possible stars is because there is an option for the camera to pan and tilt. It has motion detection and will automatically patrol if you choose it to do so. These functionalities all work fine and as expected. The motion sensing is actually pretty great and from an upstairs window it will catch people walking all the way across the street, which is much farther than the advertised 30 foot distance. The night vision works, but not through a window.\n\nI've never had any connection problems after having gotten it initially setup. That was kind of a pain, in all honesty. You wouldn't think it, but manually scrolling the camera to point upwards just to reach the reset button or to access the SD card is a poor design choice, in my opinion. The fact that's where the reset connection button is also makes it annoying, because you press and hold the button for it to begin doing its thing, searching for networks and devices and whatnot. Sometimes it will find the network and everything you're looking for right away, but other times it gives you the most confusing run around until you've disconnected and restarted the camera about a dozen times.\n\nThat being said, once you get the camera connected to your network and through the app, it works pretty flawlessly. It does load a little bit slow, so if you get a notification and open it up live, the motion that it caught may have already come and gone, but you can always revert to the 24/7 recording function and search through the recording history with footnotes that will take you right to the motion or object detection. Say a person walks by, it will save a bookmark for person detected. With a 256gb SD card, my camera tends to hold about 2-3 weeks worth of footage and I record 24/7.\n\nI used the motion tracking feature for a little while after I first got the camera so that I could follow people to see which direction they've gone after they pass my apartment. I have my parking space right in front of my unit, but someone still slashed the tires one night, hence the camera. It's a great feature, but I have a lot of car and foot traffic in front of my house that caused the camera to be panning left and right far too often. I didn't want to overwork it, so I turned it off. I don't think this is a quality issue here, but a motor/gear issue within the camera body itself that controls the panning and tilting functions that sound like they'll get pretty tired pretty soon if there's a lot of motion tracking. It doesn't sound terrible and it's only as loud as a very small fraction of a vibrating phone when it turns, but in a quiet room and it's tracking people in the early morning it's enough for you to want it to stop. But it's as easy as opening the settings and turning off motion tracking, but it will still record. If you have constant patrol or motion tracking, it's likely to run out of motor power sooner than later. I didn't want to put it to the test, because you can set \"viewpoints\" to your devices. I set up three viewpoints to cover my parking space and vehicle. I have a viewpoint to the left, with my vehicle on the right side of the frame. I have a second viewpoint that points directly at my vehicle, dead center in the parking space, and I have another viewpoint that keeps my vehicle in the left side of the frame. I can view a large swath of the street in front of my house and my neighbors feel better knowing I have a decent camera, because we all know that our complexes security cameras suck and point at nothing of importance.\n\nSo, to hit the algorithm for the cameras durability - I don't think they're waterproof, I wouldn't want to drop it, it is made out of cheap plastic after all, but I've never had any lens issues so far. My biggest worry about it's long-term durability would be focused mostly on the gears and motor that turns and pans the camera.\n\nWithin the My Kasa app, you can open it and it will display your list of devices, assuming you have multiple. If it's just a single device, it will show just the one device. You can select your device and it will pull up its real-time live feed. There is a microphone and audio settings on it, so if it's inside you can talk to your dog or whatever, you can hear your dog bark etc.\n\nMy other issue with this camera, and this is specifically about the white version of the camera that supposedly has a higher quality of video (something I could not tell the difference between, I'll explain here shortly) is the fact that when it does go through motion tracking or any sort of panning, it will return to its original viewpoint. That would be fine, having my vehicle dead center, but the viewpoint tells itself that the real viewpoint is several degrees off and is often pointing a bit higher than you originally had the viewpoint set. This leads you to having to reset the pan/tilt of the device almost every time it's done tracking motion.\n\nNow the difference in definition and quality, for me, was negligible, at best. Neither of the cameras could clearly read my license plate, so there was no difference in resolution quality there. I think the white version is supposed to be running a higher quality camera, but I think it's built off of the basic materials still used in the base model, which causes it to have a lag, slight delay, and it takes longer to load in the app. If anything, the higher \"quality\" is actually reduced because I don't think the hardware can withstand the power of the software and the lens capabilities.\n\nLong story short, get the base model for $20 and you won't be happier. Beats a $100 Ring by miles. If you really want a doorbell that badly, then I guess get a Ring and have fun changing the terribly short-lasting batteries every day. Or hardwire it into your wall, which, if we're being real here, is something that pretty much nobody ever feels like doing."
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s a great camera. It can rotate so that I can look around my whole room and I’m able to see clearly and speak through it. Very nice to see and talk to my pets while I’m not home.\nBUT! I do not like how hot the camera gets after my 10 hour work shift. When I get home the camera feels pretty hot to touch along with the power block. With how hot it gets, I am too nervous to continue using because I’m scared that one day I’m going to see the camera explode and my apartment on fire. The whole point of why I want a camera is to see my pets safe. Because of how hot it gets, I do not trust this camera and have not used it since.\n\nI have seen this camera do a 360 and stopped at me and titled up pointing the camera at my face. Idk if it’s like a calibration thing or what, but talk about freaky. 10/10 freaky overheating camera. I’m moving on to a different camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I had reservations about purchasing this camera due to reviews about the camera not lasting very long. So far, I've not experienced any issues with the camera.\n\nI don't like the fact that I can't set a schedule for when the camera is on/off. The only option is for the camera to run 24/7 or to manually turn the camera off by unplugging it or using a surge suppressor strip with a power switch.\n\nI love the ability to set specific locations that I can quickly access when viewing through the camera from my smartphone. That is a really nice feature in my opinion.\n\nNight vision is exceptional, especially if you have street lighting. I have my camera set up to view out of one of the windows at the front of our home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Product was super simple to set up and use. Many people find it's a hassle to set up the cameras to access the app on their phones to view while away from home. This one is super simple and so I no longer have to see which one of my 2 dogs started the horseplay and tore my freshly made bed up I simply review the footage and know already so I can call them out by name. Dogs are not happy because Chaos likes being able to blame his older brother Jaxson but now the gig is up. Chaos you are guilty!! But seriously all true it does work great and simple to set up. Motion sets the camera to run so no holding or finding a spot to sit it abd you still miss everything as it rotates too. Buy it you will love it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought this to keep an eye on my two \"house dogs\". that has a tendency to get a little wild when left alone very long. I wasn't sure it would work the way I wanted it to. I was afraid I would need to be connected to wi fi on both the camera and my phone, but only needs the camera connected. I was pleasantly surprised when I was out in the boonies, with no wi fi anywhere near, that I could watch the dogs and speak to them if I need to. Works great in the car also."
    },
    {
        "title": "",
        "rating": "",
        "text": "Ive purchased two of these cameras to spy on my birds while I'm at work and I love them! They are so simple to set up and use, the app is great! The camera visibility is very clear and you have the ability to zoom in and out. I think the best feature of this is the notification for movement detection! I appreciate having a notification to my phone when I am away and I see someone has entered my apartment, yep my maintenance loves to come in unannounced. And you better believe I am screen recording their movements and talking through the camera to them, also another nice feature! All in All, This Is a BUY!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This has been the BEST camera I’ve had! Just the one camera covers the entire room! I love the motion detection and the person detection features! You can record 24 hours a day with a SD Card , so you won’t miss a beat! Plus with the 2-way microphone, you can speak to whoever is in the room with the camera or your pets from far away! Definitely a great buy, totally worth the money!"
    },
    {
        "title": "",
        "rating": "",
        "text": "La cámara inteligente Kasa Pan/Tilt es una excelente opción para vigilar el hogar. La imagen en 1080p es muy nítida, incluso en condiciones de poca luz, y el modo visión nocturna ofrece buena claridad sin saturar los tonos.\n\nLa función Pan/Tilt permite mover la cámara desde la app con suavidad y amplio rango, ideal para cubrir toda una habitación. La configuración es rápida y sencilla, la app Kasa es intuitiva y se conecta fácilmente a redes de 2.4 GHz.\n\nEl audio bidireccional funciona muy bien: el micrófono capta con claridad y el altavoz es suficientemente fuerte para comunicarte con alguien en casa o con tu mascota. También se integra fácilmente con Alexa y Google Assistant, lo que añade comodidad.\n\nEn resumen, una cámara compacta, fiable y con excelente calidad de imagen, perfecta para seguridad doméstica o monitoreo de bebés y mascotas. Muy recomendable por su relación calidad-precio."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buy this camera!! It has everything needed. It pans all ways and it sounds quiet compared to another one I tired. It auto adjusts to day and night. It has a microphone to talk into and also one to hear from. You can insert a mini SD for 24 hr recording if needed. You connect the app to your phone and it will notify you if there is every any motion detected from a human or pet."
    },
    {
        "title": "",
        "rating": "",
        "text": "It takes great videos, but wasn’t tracking motion. I contacted the company and was told that we have to have BOTH patrol and motion tracking on for the motion tracking to work.\nThe view is clear, and colors are crisp and accurate, and after looking up the instructions found here on Amazon ( nothing included in the box) I found where the sd card goes. I can find the videos that were taken and are in the app, but cannot find the still shots that it says are saved to “photos”. The still shots (screenshots) are not in my phone photo gallery, nor can I see anywhere in the app that they are stored. That is frustrating.\nI already had to Kasa app because I have a bunch of the smart plugs, so this was incredibly easy to set up. If there were better information here on Amazon for this product, I might give it a 5*. But for now it only gets 4."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ve had this camera for over two years and it works perfectly. Due to poor WiFi signal I was having difficulty resetting it. Called Kasa and spoke w Jonathan. Very helpful and patient w me in adding my cameras as new devices. He walked me through in a professional manner and got my sense of humor. They were down for a while bc it’s for my Dad and we don’t live close, but now I have comfort in seeing his whereabouts. Highly recommend cameras and their support team!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice size of item, connects to wifi, and has options to set up areas of your choice to keep a close eye on. Also rotates anywhere when motion is detected, and can be used to talk to others. You can purchase a micro chip to record anything around. Has an app to download to keep an eye on things while you're away from home"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m a really anxious cat parent and had to leave my cat alone over the weekend while I was out of town. My friend has two of these cameras in her apartment and has had them for over three years while loving them. For the price, I decided to give one a try to ease my anxiety.\nThe camera was delivered quickly, easy to set up, and easy to connect to my WiFi. I set it up and connected it to my WiFi and the camera app the night before I left. It was easy to build the scope of your room and the camera gives you four options to set and main points of focus. I set them up for the places my cat likes to lay in my bedroom.\nChecking the camera was easy, even at night due to the night vision of the camera. It’s bright, clear, and easy to move as needed to view different parts of the room. It’s extremely compact and light, and comes with the hardware to hang from a wall/ceiling if desired.\nFor the money, this is absolutely worth the ease of mind when leaving your pet/home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Best thing for going out of town for a couple of days! My cat was leery of it at first but now he’s used to it. I will be going out of town for 3 night and 4 days in December. With this, he will not miss any of his wet food meals. I have it set for 4am for 3 days in a row and then I clean and refill."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have been having difficulty with this camera for months. Turns out the camera wasn’t picking up motion because I changed the settings a while ago because it was so sensitive my phone was going off with every little sound even sounds outside my apartment it was driving me crazy. I called customer service and spoke with Alexander and he jumped right in, listened to my issue and gave proper instructions to fix the issue And then I realized I made the sensitivity too low which made the camera stop picking up motion, He was very patient and kind I think I will hold on to this camera now."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera to talk/watch my dog who has bad separation anxiety. I can talk to him if he starts barking, can hear me from other rooms in home also. It’s set up in my living room, installation was easy. I do not pay for extra features."
    },
    {
        "title": "",
        "rating": "",
        "text": "I didn't know how well I would like this camera, but I've had it now for a couple of months and its been great. The camera brightness is really nice. It also has night vision which is helpful as well. You are able to turn the camera to any direction and will get a full view of any room. The app works very well its easy to use. Gives me peace of mind when not at home."
    },
    {
        "title": "",
        "rating": "",
        "text": "It works for what I wanted. You do have to purchase like $40 a year subscription to save pictures to look at or video and it is grainy when you’re looking out of the distance but up close you can figure it out.. I got what I paid for"
    },
    {
        "title": "",
        "rating": "",
        "text": "Works and cover all of the angles of my house the app works well and I keeping plug in every time so I have access all day, just if you want to record need to be premium membership is just that I don’t liked"
    },
    {
        "title": "",
        "rating": "",
        "text": "I recently bought this camera and I’m really happy with it.\nThe video quality is great, the connection is stable, and it lets me check on my dog anytime I want.\nThe setup was very easy and didn’t take more than a few minutes.\nOverall, I’m very satisfied and would definitely recommend it to other pet"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa Smart 2023 New Indoor Pan-Tilt Security Camera (EC71) is a versatile and feature-rich security solution for monitoring your home, pets, and babies. With its 1080p HD video quality, night vision, motion detection, and compatibility with Alexa and Google Home, it offers a comprehensive security package. Its ability to pan and tilt provides extensive coverage, and options for both local and cloud storage add to its flexibility.\n\nKey Features:\n1. 360° Pan/Tilt Field of View:\n- The camera's 360° horizontal and 113° vertical range allows you to monitor an entire room or walkway. The Patrol Mode feature lets you set intervals to monitor different regions automatically.\n\n2. Motion Tracking:\n- The camera can automatically track moving objects or people, providing real-time alerts to enhance your security system's effectiveness.\n\n3. Detection & Instant Notification:\n- Get push notifications when motion or a person is detected. You can also enable baby crying detection, making it suitable as a baby monitor. Notifications help you discern important events from everyday activities.\n\n4. 2-Way Audio with Built-In Siren:\n- The 2-way audio feature allows you to communicate with pets or family members remotely. The built-in siren can deter intruders, enhancing home security.\n\n5. Secure Local or Cloud Storage:\n- Save footage on a microSD card (up to 256 GB, not included) or subscribe to Kasa Care for cloud storage with a 30-day video history and additional features like Video Summary and Activity Notifications with Snapshots.\n\n6. Night Vision up to 30 Ft.:\n- The integrated IR system provides clear night vision up to 30 feet, ensuring you don’t miss any activity in low-light conditions.\n\n7. 1080P Full HD Video:\n- Capture detailed 1080p Full HD video, making it easy to see small details like what your baby is holding or what your pet is playing with.\n\n8. Works with Alexa & Google Home:\n- Compatible with Amazon Alexa and Google Home, you can use voice commands to view live streams on devices like Echo Show or Google Chromecast.\n\nPros:\n- Extensive Coverage: The 360° pan and 113° tilt provide comprehensive room coverage.\n- Versatile Monitoring: Suitable for home security, pet monitoring, and baby monitoring.\n- Real-Time Alerts: Instant notifications for motion, people, and baby crying.\n- 2-Way Communication: Interact with pets or family members remotely.\n- Multiple Storage Options: Choose between local microSD storage and cloud storage with Kasa Care.\n- Clear Night Vision: Up to 30 feet of night vision ensures you don’t miss activity in the dark.\n- High-Definition Video: 1080p HD video for clear and detailed footage.\n- Smart Home Integration: Works seamlessly with Alexa and Google Home.\n\nCons:\n- Occasional Slow Response: Some users report that the camera can be slow to respond at times.\n- SD Card Not Included: The microSD card for local storage is not included, which requires an additional purchase.\n- Subscription Cost: Accessing full cloud storage features requires a subscription to Kasa Care.\n\nConclusion:\nThe Kasa Smart 2023 New Indoor Pan-Tilt Security Camera (EC71) is a highly functional and flexible security solution for any home. Its wide range of features, including motion tracking, 2-way audio, night vision, and compatibility with smart home devices, make it a standout choice. While there may be occasional slow response times, the overall performance and ease of use make it a worthwhile investment for enhancing your home security.\n\nRecommendation:\nI highly recommend this camera to anyone in need of a reliable and versatile indoor security solution. Its extensive features, coupled with high-definition video quality and smart home integration, provide excellent value for the price. Whether you're monitoring pets, babies, or general home security, this camera is a robust and user-friendly choice."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ll start by saying I’m super tech challenged! This was so easy to set up and just as easy to use! I’m only using it as a pet cam & for that purpose it is perfect! The picture is crystal clear and I’m honestly obsessed with checking on my pets now! If you need a mid day pick you up, get this! I smile every time I see them playing or stretching out relaxing. Only flaw I’ve found is when trying to use the follow the motion option it ends up set on my ceiling fan that stays on 100% of the time. Otherwise for the purpose I intended it for it is great quality, it detects my pets and is a nice size to sit on the feeding table I use. I bought a memory card to make setting up that much easier. This way I didn’t have to join any membership or anything."
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice little camera. Pretty inconspicuous. Clear view. Motion sensors could be a little better. Also, wish didn’t require a fee for recording."
    },
    {
        "title": "",
        "rating": "",
        "text": "So, I do security cameras for other folks as part of my job, but I needed an inexpensive, basic camera for inside my own home. This camera does well. Noise and motion detection is good (sometimes too good - it catches reflections real easy!). Yes, you can hear the motor when it turns, so, a little less quality build encasing the motor, but for the price - hey, that's reasonable (so 4 stars). The tracker gets bored quickly and resets to home. There are multiple features on this camera, like the patrol mode and zone monitoring that seem like they might be GREAT features. Frankly, I'm just too lazy to go through all the learning curves to deal with that (and the added features are not overly \"user friendly\" - and if that's the case for me, that means it's not pleasant for the average user, so a bonus, but a waste unless you want to take the time to learn it all). My living room is not large enough to need the full 360deg, and its noise detection can tell if someone's coming from off-screen. It does recognize people (which substituted the patrol mode for me). Great for night vision. Not obnoxious in size. Not intrusive. It's app is pretty basic - just like every other app out there but I DO like NO subscription fees just to \"use\" it (there may be some to store to the cloud?). It may have ads, but I haven't noticed. I did buy my own SD card, got the class 10, 256 GB high fidelity card, and ran this at 2k. Quality was GREAT. I tried 1080. Quality was still amazing. I went down to the 720... and quality was STILL great (but not for face recognition in low light). I'm not looking more than 25 - 30 feet away and the details are MORE than sufficient, giving me even longer record times before it overwrites. It doesn't always alert me on the app when it sees motion, that is touch and go? Maybe a network issue. I did have a 1-time loss of wifi with router at the very beginning, but that remedied itself. (and sometimes, it is slow to connect - but that is all network dependent, not necessarily the camera). Long story short - if someone's breaking into your home, you want to know immediately. You want faces. And, you want to be able to report it. This does that and well enough for the price (in fact, it just beeped at me thru my phone while sitting at work and typing this). Again, it's in the $30 - $40 range... so it's not going to be \"high class\". But, to get to that range, you're \"usually\" jumping into the $200-1200+ per camera category, so... for my tight budget, no. It has some mounting options, nothing fancy (like all others in this price range). It's corded, but you can always find solutions for that (and it's not a hidden cam, so cord doesn't really matter, and no battery powered cam will give you good, constant operations without fast draining). Funny note - it picked up motion on our TV screen while binging Supernatural! As an IT person who does camera set-up security, if you're on a budget, I recommend this. I was going to get a Hiseeu cam because of their quality build, but honestly, the Kasa has audio detection, better audio quality, near the same range of vertical motion, does not have to be mounted up-side down (can sit on its base), is smaller / less obvious, does well at night, does lack the \"emergency lights\" option (unless I'm mistaken, someone please correct me), and has a \"patrol\" mode (which, if you've ever used 360 degree cameras, you suddenly realize that it can't see someone coming from a blind spot and becomes obnoxiously useless without a patrol mode and/or audio detection) - and altogether, even tho the Hiseeu motor is quiet and the build is stronger (and it can pair with an NVR whereas I have no idea if the Kasa can), that STILL makes Kasa the better option for me (on a budget)."
    },
    {
        "title": "",
        "rating": "",
        "text": "The effect far exceeded my expectations. The night vision and picture clarity are both excellent. The installation is very simple, and it can also be monitored through my own Wi-Fi, allowing me to keep track of the store's situation even when I'm out."
    },
    {
        "title": "",
        "rating": "",
        "text": "I love this camera. Rotates, adjusts to sound and movement. Playback and other options. Battery life is good and it has a charging cord to stay plugged in if needed. Quality is overall good. A variety of angles. Camera looks and functions well, with good wifi connectivity."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have like about five of these and they all work very well. Never had an issue purchased a few years ago for my son who is nonverbal autistic and it is great for monitoring him with the Kasa app."
    },
    {
        "title": "",
        "rating": "",
        "text": "Camera does the job and all without having to pay fees monthly. Angle is great but the zooming isn't the best. Overall design gets the basic job done!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Recently, became nearly full time caregiver for my 77 year old mother. we tried a wrist based call bell but her capacity to learn, sadly has diminished. so, needed a discrete way to monitor her remotely. this camera is very discreet and matches the tv stand. she loves framed pictures so there is a pretty discreet opening that alllows nearly 360 degree view of the living room where she spends most of her time. I can move the camera remotely, and it even has a feature that will follow her as she moves. however, thus far i haven't used that feature very much. I think if the camera is moving alot, it may wear out the mechanism prematurely. camera seems well built, and make sure you get a Class 10 micro sd card. I bought amazon basics brand, and it works flawlessly, and if it starts to fail, they are cheap enough to replace. name brands go for over 40.00! yikes. i bought 128gb card. you can go as high as 256gb cards. but 128gb will get you probably over a week of footage. (your mileage may vary) depending on how active the camera is and how busy the area your monitoring is. you can turn off the front LED indicator, so camera is super discrete. the kasa app is super easy to use, and you can subscribe to kasa care for 30 days of recording history if you chose to. it's pretty reasonably priced as well, i personally don't use it, but like having that option.\ncamera ONLY WORKS on 2.5ghz network so make sure your setup allows you to assign devices to 2.4ghz band, word of caution, if your using a ISP supplied router, this won't work. you will need to go with 3rd party router (i use tp link) and it works flawlessly.\nyou can set the camera to listen for sound/motion and even a baby crying. there are settings that can be changed for sensitivty, and you can use patrol mode. camera will move/tilt up and down, at preset intervals.\nyou can talk through the camera if needed, i don't use this feature because i'm doing discreet monitoring.\nI have a very old kasa spot camera (probably 13 years old now) and it still works, but having some intermittent issues. I prefer all my cameras to be of the same brand, so i don't have to cycle through 2 or 3 different apps on my phone. app works well. and you can even download it on your MacBook if using ios. not sure about windows though, ive read it doesn't work with windows based systems.\nThis is a very good deal and a good price point, and has served it's purpose well, and i have only used this particular model for a few days.\nif you need discreet monitoring or surveillance this is a cost effective way to do it. i suggest getting the black one opposed to white. the color white sticks out like a sore thumb, but the black color blends in and assures discretion.\nway to go kasa! great camera at a great price."
    },
    {
        "title": "",
        "rating": "",
        "text": "LOVE this camera! Pans the room AND tilts up and down and you can talk to your dog to comfort them. I am using it with my puppy when she is in her playpen if I can't take her with me. The camera and picture quality is great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera works well and does connect to our phones. The only problem is that you can save the videos or view outside of real time without a subscription."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is my 2nd Kasa camera and I really like it. Only thing to note is that sound is not the best compared to other cameras I have. If you need this camera for the sound, then I would look into getting a different one. Connection was pretty straight forward. Once you are connected to your network, I haven't had any connectivity issues. In terms of visibility, you can move all around. Also, you can save favorite views of the place so you don't have to set it up every time you use it. Overall I recommend getting this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "I like this camera because it doesn't need internet and I don't have to have a subscription to see 24/7 videos because you can put a SD card for that. Also you can maneuver the camera on your phone app and you can put it to see up down to the right and to the left also it has night vision you can see clearly when the room is dark. Really nice camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "This little camera was super easy to setup and provides a beautiful picture. I also purchased an SD card to save videos."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera was very easy to set up. The picture and sound quality were excellent. Very user friendly."
    },
    {
        "title": "",
        "rating": "",
        "text": "Love this. Some slight Delay with the notifications which is why it gets a 4 out of 5. However clear picture and easy to setup. If you want to store data you would need to add a SIM card!"
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera works perfect, night vision is great and I can always hold to zoom on my phone.\nComes with some items for mounting on your wall as well. Great purchase."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is an excellent security camera that you don’t have to pay a monthly fee and you are notified when ever someone enters the room. Set up is not explained very well but you can get telephone support and that is what I did and Ivan was excellent in his directions and I was up and running first time out. I would recommend this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera works great. It have good quality. Very sensitive. Good product"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m honestly impressed with how well this camera performs. Setup was super easy with the Kasa app. It connected right away and started working within minutes. The pan and tilt feature is smooth and quiet, which makes it great for keeping an eye on pets or checking different parts of the room without needing multiple cameras.\n\nThe video quality is crisp (especially for 1080p), and the night vision is surprisingly clear. Motion detection alerts come through quickly, and I love that I can view live footage anytime from my phone. It even integrates perfectly with Alexa, so I can pull up the feed hands-free.\n\nOverall, it’s reliable, easy to use, and the peace of mind it gives me is well worth it. Highly recommend to anyone looking for an affordable, high-quality indoor camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I couldn’t be happier with my Kasa Spot Pan Tilt Camera! The picture quality is crisp, the movement is smooth, and the app makes it so easy to keep an eye on things. I’ll admit, I was a little nervous about setting it up, but thankfully I had the incredible support of Paolo, who went above and beyond to walk me through every step. He explained everything so clearly and patiently that the whole process turned from intimidating to effortless.\n\nThe camera itself is fantastic, but what really made this purchase a 5-star experience was the customer support. Paolo’s kindness, professionalism, and thorough explanations gave me complete confidence in using my new camera.\n\nIf you’re looking for a reliable, easy-to-use home security camera, I highly recommend the Kasa Spot Pan Tilt—and make sure to ask for Paolo if you need help getting started. He made all the difference!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This little pet camera has been awesome. Guess my daughter peace of mind to be able to check on the dog while we are away. The image is terrific. It sets up quick and easy. It is electric, so we don't have to worry about batteries wifi connectability has not proven any issues with speed. Would totally buy again."
    },
    {
        "title": "",
        "rating": "",
        "text": "for a small camera this works really well very happy with it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Wanted a camera just to see what my dog does when we are not home. Turns out, he sleeps - a LOT. Easy to set up, app works great."
    },
    {
        "title": "",
        "rating": "",
        "text": "So far its had a few ticks but its day one and bug seems fix, I will update to 5stars if all goes well this month !\nIf it contiues to work this would be unbeatable for the price and would recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa EC71 offers sharp 1080p video, smooth pan-tilt control, and easy app integration at a great price. It’s perfect for indoor monitoring of pets or rooms, with night vision and two-way audio included. Setup is simple, though it only supports 2.4 GHz Wi-Fi and lacks outdoor durability. A solid, budget-friendly smart camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "I needed another camera to watch a particular part of the house. This one was reasonably priced, and works very well. Easy to install. I also installed a small infrared, LED light, and at night the whole area is lit up, almost like daylight."
    },
    {
        "title": "",
        "rating": "",
        "text": "So easy to set up and install very convenient. I like the way it follows any movement around without you having to look around manually. It's very light. So if you hang it on the ceiling, you don't have to worry about it. Falling off or pulling the screws out. Because it's very light, hardly weighs anything at all. I'm actually adding 2 outside kasa cameras to my Amazon cart"
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent little camera I use for my office. Make sure you order a Micro card for recording so you don't have to pay for an cloud subscription.\nI purchased a 64 and it is more than enough space to record your events.\nMy daughter purchased one for the kids room and she loves it for monitoring the baby and kids."
    },
    {
        "title": "",
        "rating": "",
        "text": "Me encantó, la calidad de la cámara es muy buena y lo mejor puedes comunicarte con tus hijos desde el trabajo. Es muy fácil de activar."
    },
    {
        "title": "",
        "rating": "",
        "text": "Hi, so far I love my Kasa Cameras, the picture quality is superb especially the night vision, I’m wowed. The only thing I don’t like is that there’s no Alarm Button on it, why is that when it’s a Security Camera??. And why is there no fast forward or rewind button?"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa Smart Indoor Pan-Tilt Home Security Camera (EC71) is a fantastic option for anyone looking to add reliable, high-quality security or monitoring to their home. I purchased a used version for only $16—what an absolute steal for everything this camera offers! From picture quality to functionality, this camera delivers in every category. Here's my detailed breakdown:\n\nPicture Quality:\nThe 1080p HD video is crystal clear, capturing every detail in both light and dark environments. The night vision is particularly impressive—easily some of the best I’ve seen in any camera at this price range. It provides sharp and clear images, even in complete darkness, which makes it perfect for monitoring pets, children, or your home at night.\n\nAudio:\nThe Audio quality is great and not laggy at all! I was seriously impressed by how clear it is.\n\nPan & Tilt Functionality:\nThis camera's ability to pan and tilt is a game-changer. It provides a full view of the room, from front to back, with no blind spots. The tilt mode can also be set to Activity Tracking, which allows the camera to automatically follow any person or motion it detects. This feature works seamlessly and adds an extra layer of security and convenience.\n\nStorage Options:\nThe ability to use an SD card is a major plus, as it allows for local storage without the need for a subscription. If you prefer cloud storage, that’s also an option, giving you flexibility based on your needs.\n\nMounting & Installation:\nThe camera comes with easy-to-use mounting hardware, making installation a breeze. Whether you want to place it on a shelf or mount it on a wall, it’s simple to set up in minutes.\n\nApp & Smart Integration:\nThe Kasa Smart app is incredibly user-friendly and intuitive. You can view live footage, set up motion zones, control the pan and tilt, and even receive motion alerts—all from your phone. Plus, it integrates perfectly with Alexa and Google Home, allowing you to use voice commands for added convenience.\n\nExtra Features:\nMotion Detection Alerts: Get instant notifications on your phone whenever motion is detected.\nTwo-Way Audio: Communicate directly through the camera using your smartphone, whether you’re checking in on a pet or giving instructions to someone at home.\nCustomizable Motion Zones: You can define specific areas for the camera to monitor, reducing unnecessary alerts.\nWiFi Connectivity: Works seamlessly on 2.4GHz WiFi networks, ensuring a stable connection.\nFinal Thoughts:\nFor just $16 (used), this camera has exceeded my expectations in every way. It’s perfect for monitoring pets, children, or your home, and the pan-tilt function and night vision make it stand out from other cameras in this price range. The Kasa Smart app is intuitive and reliable, and the ability to use local SD card storage means no additional subscription costs.\n\nIf you're looking for a budget-friendly, high-quality indoor security camera with all the bells and whistles, this is it. Whether new or used, the Kasa Smart Indoor Pan-Tilt Camera is an incredible value for its price. Highly recommended! 🌟"
    },
    {
        "title": "",
        "rating": "",
        "text": "These cameras are excellent! The price paid is minimal compared to the total amount of functionality.\nThey do track objects that trigger them, maybe not as smoothly as higher priced options (I don’t know, have not tried others).\nFor the mobility of relocating the camera by simply picking it up and finding a new location, it’s massively more practical than the full wired systems available. Until you know where you want those more expensive cameras to be permanently installed, these cameras are a great alternative! Also, great for keeping a watch on who’s passing by your place at window-level.\n\nWired cameras have to be mounted high enough to be safe from getting ripped down by trespassers, these see through windows during the day very well. Interior night vision is top notch, seeing outside through windows at night is more difficult.\n\nWith the sensitivity turned up, every time a tree branch blows it triggers the cameras. This leads to near constant triggering of alerts during the late Spring, Summer and early Fall.\nAnd, lots of recordings every day. So, you need to use the App to designate areas to watch for motion, or it’ll drive you nuts and frustrate you. To the point that you may start to ignore the notices.\n\nThe App provides great control, and allows remote on/off, sensitivity setting changes, you can set to record noise triggers or remove that, set trigger zones, move the camera via the App, and other adjustments.\nI have noticed that the App actually does offer more functions, and work a little more smoothly, through my phone than my very new tablet. No idea why, it should be the same App for both platforms, no?\nBut, of course watching the playback on the larger screen is so much better, so I do use both.\n\nThe service plan allows storage of recordings from up to 10 cameras for $10 per month. Much more cost effective than others I looked into.\n\nThe cons:\nCan’t see thru glass with the built-in lights, at night. Reflection off the glass blinds the camera.\nThat should have been obvious to me from the start, since these are designed for indoor use only. but I had naively hoped for better night vision performance.\nSo, if looking out a window, get a motion-activated light to trigger so you can see what’s going on out there. Just don’t set it up where it will shine in your bedroom and wake you up.\n\nApp functionality on phone is higher than on tablet, no idea why. You will want to have the App on at least a phone, if not both.\n\nSometimes, some cameras will trigger, others won’t, for the same event.\nDeer moving around the house sometimes are ignored by one camera, recorded by another. Also happened that another outdoor camera from another manufacturer recorded a vehicle trespassing, these cameras didn’t. Had to adjust the sensor sensitivity, but I think the baseline software settings should be set to trigger sooner on vehicles.\n\nBranches moving on the breeze cause constant notices, even with Person Detection Mode activated.\nA more elaborate software system might offer better monitoring, but for the pro systems, this requires fully wired systems with dedicated main recording components/control systems . Much more expensive, and I can’t afford to open the walls throughout the property.\n\nOverall, these are great! I have bought several models, both the fixed ones and the bigger moving ones. All look great when set to the highest recording resolution, seem to last a long time, and are a breeze to set up or switch from spot to spot.\nI very much recommend this camera! I also hope the manufacturer can produce a 4K version."
    },
    {
        "title": "",
        "rating": "",
        "text": "Exelente buen producto funciona muy bien"
    },
    {
        "title": "",
        "rating": "",
        "text": "This cámara is amazing"
    },
    {
        "title": "",
        "rating": "",
        "text": "Got this to replace an older pet cam we use for our dog. It was super easy to set up. The picture quality is great during daytime and night. Camera can easily be adjusted side to side or up and down in view mode. Also has zoom capabilities. Size of your hand and not noticeable right away. Has sound and you can also talk through camera when viewing. The security of knowing we can look in on our dog while we’re out is nice. It can easily be unplugged and taken on vacation as well! Great purchase!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Quality size and function is great on this came works as it says. App is nice."
    },
    {
        "title": "",
        "rating": "",
        "text": "Le daría un 5 pero, si tienes un celular que no permite tener una memoria micro externa no podrás guardar las grabaciones, solo podrás ver la cámara en vivo. Tampoco me permite comprar el almacenamiento que trae la aplicación."
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought this to watch my pups while I’m gone, it’s exactly what I needed , works great, haven’t bought the sad card yet so just using it live, but it’s great"
    },
    {
        "title": "",
        "rating": "",
        "text": "Very good! Camera is worth it! Nice size where it can fit anywhere."
    },
    {
        "title": "",
        "rating": "",
        "text": "I got this indoor cam months ago and couldnt figure out how to get it going-- then ive have had many health problems that has kept me from getting help. Finally today in July,\nI was able to speak to a Kasa customer service helper named Aldrin... I am so pleased: he had me getting the camera connected and working in just a few minutes. I'm so happy because now I can get my outdoor version of this camera that shows via motion detection who or what is happening. I'm very grateful to Aldrin at kasa support. So the cool part of this device is the sd card is safely tucked below in the tilt panel below camera lens. This model moves about in Pan and tilt and left and right 360 motions. I did need to download the kasa app.\nmake sure you know your wifi password before starting the process. It was way easier to set up with help. If you don't understand something don't be afraid to contact support. It appears to me this is a fine little security cam. I got this to monitor my cats (and visiting animals) inside my garage. Not exposed to rain etc. So its inside. It is set to notify me when they come into area of detection. I have other kasa smart home plugs so I wanted to stay with a company I already liked. I do recommend this if it's your first camera.\nIt can record 24/7 onto my 128gb SD card, after the first 24hrs it used very little memory of the128gb. I figure I will erase it at some point.\nBut I saw you can subscribe to a kasa \"cloud type\" service. I was in a hurry so I didn't read that offer. I figured I can do later."
    },
    {
        "title": "",
        "rating": "",
        "text": "The reason I gave it4 stars is because it doesn't record like ring so if you miss something you can't go back and see it it's a good product if you just sitting watching it ,and its very hard setting it up I had to get my daughter to set it up for me ,. I purchased this to watch my mom whom has Dementia So therefore when I'm upstairs doing something I could look on my phone to see if she's OK But I really wish it would record or at least take a snapshot Does not let you"
    },
    {
        "title": "",
        "rating": "",
        "text": "I like it"
    },
    {
        "title": "",
        "rating": "",
        "text": "Me encanto esta Camara, es divetido ver las cosas que suceden en casa mientras se esta trabajando, tiene opcion de guardr los videos en una micro USB o en la nuve."
    },
    {
        "title": "",
        "rating": "",
        "text": "Tiene buena imagen, incluso nocturna. La tengo en la sala más que nada para ver qué hacen mis perritas sin embargo también la giro hacia la puerta."
    },
    {
        "title": "",
        "rating": "",
        "text": "The ameee are the best cameras I have ever had I love their quality the very strong material the very impeccable image and above all I listen and listen to me very well, it has a good night vision and easy to install 👏🏻"
    },
    {
        "title": "",
        "rating": "",
        "text": "The quality is honestly pretty decent for the price but it doesnt always catch all motion. 😔 i bought this camera to make sure my cat is okay when im not home or nearby but it only gives me SOME motion detection notifications not all, even when im in the room with my cat it doesnt detect me which is kind of annoying especially since me and my cat always have funny moments together. thought the camera would catch it but nope😔"
    },
    {
        "title": "",
        "rating": "",
        "text": "Se ve muy bien en colores es Perfecto el Precio"
    },
    {
        "title": "",
        "rating": "",
        "text": "Size is okay and is some what easy to setup if you know what your doing and brightness is okay battery life is good and quality is okay and great security"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Kasa app wants you to buy the monthly subscription. Go to the Google play store and down load one of the other apps and you can by pass the subscription."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buena resolucion y es igual que en la foto"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera! Mounts easy. Picture quality is excellent!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought 3 of these for my inside my home. They work super great. Clear picture when you use it on your phone and you can also use your tv to view the cameras. You can also detail the camera if you need sounds for a baby or kids. Very nice 100% recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great quality and nice that it has the slot for the sd card."
    },
    {
        "title": "",
        "rating": "",
        "text": "Sometimes it turns on by itself and can't be turned off through the mobile app. In that case, you need to unplug the power and restart it."
    },
    {
        "title": "",
        "rating": "",
        "text": "Works great a must have for inside garage or porch as long as its under a covered porch it gets great day or night photos great inside security camera, you need a SD card to be able to record 24/7 and its not very costly either. Thanks for this amazing camera, a inside photo of me at work now if you can see how clear the image is here well the night vision is just as great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera is so great! I was definitely sceptical about it given how cheap it was, but I am so happy I bought it. It's so easy to turn on and set up. The app is great, besides having small issues with payment for kasa care. The quality of the image and the night vision are awesome. I love that it moves around to track any motion. I'm using it to keep an eye on my 9 week old foster kitten and it detects even the smallest movements she makes. You can change the motion sensitivity though. Overall I think this product is amazing and way worth the money!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Esta muy muy buena y a un excelente precio comprar con ella una tarjeta SD a mi falto pero yo feliz con mi compra"
    },
    {
        "title": "",
        "rating": "",
        "text": "This purchase was the second attempt to find a wi-fi camera for my elderly mom’s room. It helps us to see when she is awake at night. This camera was so easy to set up, unlike a previous purchase that would stop working. I will purchase this one again for other areas in my home. Picture is clear and the device provides clear sound quality to speak to your loved ones remotely. I think you will be happy with this device, like I am."
    },
    {
        "title": "",
        "rating": "",
        "text": "It’s ok suited it’s purpose"
    },
    {
        "title": "",
        "rating": "",
        "text": "Mi vida si no has comprado esto no te lo\nPierdas es excelente las tengo en mi casa msravillosa las tengo cuarto sala donde quiera maravillosas"
    },
    {
        "title": "",
        "rating": "",
        "text": "Charlayne Oquindo Helped me from customer service! Very polite and patient. Now camera works perfectly"
    },
    {
        "title": "",
        "rating": "",
        "text": "I really like the cameras. I got them for the dogs when I am out the house. Connection is good, but the mic is delayed. But it’s a good product"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have more security and peace of mind since I acquired it because I can control my house in real time"
    },
    {
        "title": "",
        "rating": "",
        "text": "Lo mejor"
    },
    {
        "title": "",
        "rating": "",
        "text": "My first security camera and it did not disappoint. The flexibility of 360 of the best feature. It also has zoom which is an additional bonus"
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought two of these. Great camera and great price. The app is easy to follow. We used these to monitor my MIL while on hospice in our home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Totally recommended!!! Works perfect even in no light condition, easy to set up and works as expected."
    },
    {
        "title": "",
        "rating": "",
        "text": "I am writing this review for the Kasa smart indoor camera EC70, features may change from past to future models. I do have a separate security system for the outdoors, and I wanted something simple and portable to use indoors. I chose the Kasa camera because I already have the Kasa smart plugs. For about $20 dollars this is a camera with a lot of nice features. It is extremely easy to install and use. First, download the Kasa Smart App and create an account. Second, plug the camera into a power source, open the app add the camera and follow the directions. Once added, use the 3rd party tab to add to your Alexa account and google home account. If you already have added those accounts, then the camera will automatically be added and you can access it through the Alexa and google home app. The camera once added did require a firmware update and this took about 2 minutes. Some helpful tips I learned during my encounter with set up. The EC70 camera will accept a microSD card from 8 to 256GB used for local storage. Even though it tells you during set up to add, you will NOT be able to do so unless the camera is tilted up as high as it can go. So, you may have to finish set up, then start the camera and tilt it up before you can install it. For the Alexa app, the app will NOT turn the EC70 camera on or off. I am able to connect the camera to my Echo Show and FireTV only. The camera WILL send notifications to any Amazon device, and you are able to pick which devices to receive notifications. For google home, it is essentially the same, you need to have a Nest or Chromecast device in order to view the EC70 camera output. You probably will need to use the google help page for instructions on how to set it up. You can set the EC70 camera for different views of the area you wish to see, and can also place it on patrol mode to automatically move to each view. There are a wide range of positions available to meet your particular specifications and needs. The camera is mobile, unless you attach it to a wall or ceiling with the included bracket. The picture quality is great, and you do have options for the video quality settings depending on your wifi. I read other reviews and some of the negativity of the EC70 camera most likely is due to your wifi, not the actual equipment. I have used this camera to watch the front door when I am in the back, and also to watch the dogs. It is nice to receive the notification that they are at the door, so I can let them out to do their business. I am very happy with my purchase. I hope you find this review helpful."
    },
    {
        "title": "",
        "rating": "",
        "text": "This product deserves my first review. I do special needs pet rescue and this camera is easy to set up and lets me see how the animals are adapting when I’m not home. The night vision is incredible. Just ordered another!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Renald is a good agent, well explained & highly recommended"
    },
    {
        "title": "",
        "rating": "",
        "text": "Connects well, easy to use, and very affordable. I love it"
    },
    {
        "title": "",
        "rating": "",
        "text": "PROS:\n1. Very easy to set up, even for someone not tech savvy.\n2. Arrived quickly\n3. picture is very clear with a wide view\n4. Sound is clear\n5. You can turn off motion or put camera in sleep mode when you’re home\n6. App is very user friendly\n7. Price point is great for this camera.\n8. I’ve also tested BLINK cameras and found this one to work better than the Blink cameras that I had set up for my dogs. I had 3 set up and this one camera shows more area than the 3 BLINK cameras did.\n\nOnly CON:\nNot entirely pleased with the yearly subscription cost of $47.49 a year. To be honest, we pay less than that for 3 RING cameras. I’ll only be doing the 7 day free trial at this point. This means that I can see live views, but nothing will be recorded."
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera is pretty impressive. The video quality is sharp and crystal clear, even in low light. Setup was very simple, and the motion detection works great for keeping an eye on things while I’m away. I also like the two-way talk feature. This is a super handy way to be able to check in on pets or family. The only thing to note is that you’ll need a paid plan if you want to store recordings in the cloud. Otherwise, it’s a solid, reliable option for home monitoring."
    },
    {
        "title": "",
        "rating": "",
        "text": "I recently got the 2K Pan/Tilt Security Camera, WiFi Indoor Camera with AI Motion Detection, and I’m seriously impressed.\nThe setup was super easy—I had it up and running in minutes without needing to be a tech genius. My absolute favorite feature is the alarm system and the away-from-home security options. It gives me real peace of mind knowing it can keep an eye on things (and sound the alarm if needed) even when I’m not home.\nThe video quality is crisp, and the pan/tilt option lets me see the whole room. But let’s be honest—the real fun part? Now I can spy on my cat. 🐾 Watching what he’s up to when I’m away has become my guilty pleasure.\nIf you’re looking for a camera that’s reliable, easy to set up, and packed with smart features, this one is a great choice."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ve been really happy with this home security camera so far! The video quality is clear both day and night, and the motion alerts come through quickly, giving me peace of mind when I’m away. The app is easy to use, and setup took just a few minutes. While there is a subscription fee to unlock the best features—like cloud storage and advanced motion detection—it’s well worth it for the added convenience and security. Overall, a reliable and user-friendly camera that helps me feel safer at home!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I got this camera to setup in my kids play room. I needed something to see the full room and with sound. This camera has exceeded all of my expectations, and is exactly what I needed. I also love that it has voice controls, and pan and tilt options. The 2K image quality is very clear! The WiFi and app setup was very easy and took no time at all. It also has motion detection that you can easily turn on and off.\nDefinitely worth the price! Highly recommend this camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ve been using the Cloarks 2K Pan/Tilt Security Camera for a few weeks, and it has truly exceeded my expectations. The video quality is outstanding—crisp and clear even in low-light conditions. The 2K resolution provides a noticeable difference compared to standard HD cameras.\n\nThe pan and tilt functions are smooth and responsive, allowing me to monitor every corner of the room effortlessly. The AI motion detection works impressively well, sending timely alerts only when real movement is detected, which helps reduce false alarms.\n\nSetup was quick and straightforward thanks to the intuitive app interface and stable WiFi connection. I also appreciate the two-way audio feature—it’s clear and makes it easy to communicate when I’m away from home.\n\nOverall, the Cloarks 2K Pan/Tilt Security Camera is an excellent investment for anyone looking to enhance their home security. It combines reliability, smart features, and ease of use in a sleek design. Highly recommended!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I absolutely love this ClOARKS panoramic security camera. I installed it in my daughter’s room, and it has given me total peace of mind. The wide-angle view allows me to monitor her at any time of the day, and the image quality is clear and reliable. It’s easy to set up, user-friendly, and perfect for keeping an eye on loved ones. Highly recommended!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m really impressed with this WiFi camera! The setup was quick and easy — it connected to my network within minutes. The picture quality is crystal clear during the day and surprisingly good at night. I love the two-way audio feature — it’s super convenient to talk through the camera when I’m away from home. The motion detection is sensitive but not overly so, and I get instant alerts on my phone whenever there’s movement. Definitely worth the price and gives me peace of mind knowing I can check in anytime."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have been using this 2K panoramic/tilting security camera for about a month to monitor my pet and the common areas of my house. After this time, I have a mostly positive impression, although with some nuances that they should consider.\n\nWhat I like (Pros):\n\n· Sharp 2K image: The video quality is excellent for an indoor camera. 2K resolution allows you to see details clearly, even when the image is enlarged. Night vision is equally effective, illuminating the room completely in crisp black and white.\n\n· Panoramic movement and excellent inclination: This is, without a doubt, its best feature. The 360° movement and tilt are smooth and allow you to virtually cover an entire room without blind spots. It is perfect for following a playful pet or for scanning a large room.\n\n· Precise AI motion detection: The \"AI Motion Detection\" function works quite well. I have been able to configure it to send me alerts only when it detects people, which drastically reduces fake notifications for shadows or movements of small pets. It's a great advantage."
    },
    {
        "title": "",
        "rating": "",
        "text": "Set up was easy. It took less than 20 minutes.\n\nThese cameras are amazing. We wanted to keep an eye on my dog when we’re not at home. I set up multiple cameras up in different rooms. So cool to see what she does during the day. Picture quality is excellent.\n\nSnooping for food, setting where she’s not allowed, reacting to people or dogs outside, we trigger the alarm and tell her NO! These work like a charm.\n\nThe value can’t be beat. I highly recommend the Cloarks."
    },
    {
        "title": "",
        "rating": "",
        "text": "The Cloarks 2K Pan/Tilt Security Camera is very easy to install and works exceptionally well. The installation was as simple as downloading a phone app, plugging in the unit and choosing the add sign in the app. Then follow a few steps and you are up and running. Both the daytime and totally dark captured videos are very clear. I was pleased with the camera’s ability to detect movement and if desired, follow the detected subject. Your recorded videos are immediately accessible through the app.\n\nIn addition I installed a micro SD card so the images are also stored on the card. Using the app on your phone you can remotely access the recorded videos. The videos are labeled with a time stamp and sorted by month and day. I’m impressed with the unit’s sensitivity and how quickly I receive notifications of detected movement. Upon receiving a notification you can view a live feed from the camera. I found the pan and tilt feature allowed me to remotely scan the entire field of view.\n\nI now have a reasonably priced and reliable option to monitor my property in my absence."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m genuinely impressed with this 2K Pan/Tilt Security Camera. From the moment I opened the box, setup was a breeze just plug it in, scan the barcode with the app, and you're connected in seconds. The video quality is outstanding it’s crisp, clear, and surprisingly good even in low light. The pan and tilt feature gives me full control over the view, so I can monitor every corner of the room without needing multiple cameras.\n\nMotion detection is fast and accurate, sending alerts right to my phone when something moves. I especially love the two-way audio it’s perfect for checking in on my cat or when I’m away. It’s packed with features you'd expect from a much more expensive device, and honestly, you can't beat the price.\n\nThis camera delivers and I highly recommended!"
    },
    {
        "title": "",
        "rating": "",
        "text": "The picture is fantastic! It has about a 3 second lag. It has froze a couple of times, but not for long. I bought it for my dog. I only need to watch her by the dining room table as she likes to grab stuff from it. The 1st time that I used it she walked right up to the table. I told her NO through the speaker. Her reaction was hilarious. I laughed at her face up close to the camera! For the price it's a really good camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "The Cloarks 2K Pan/Tilt Security Camera has exceeded my expectations. The video quality is sharp and clear, and the pan/tilt function gives full coverage of my space. I love the AI motion detection — it’s accurate and gives me peace of mind whether I’m monitoring pets, checking in on family, or keeping my home secure.\n\nThe phone app is easy to use, and the 2‑way audio makes communication simple. With 24/7 monitoring, siren capability, and flexible TF/Cloud storage options, this camera offers everything I need in one device.\n\nHighly recommend for anyone looking for a dependable indoor security solution!"
    },
    {
        "title": "",
        "rating": "",
        "text": "First I purchased a ring.com camera. I was disappointed that it seemed so lightweight and, well, just not sturdy. I’m not saying that it wasn’t. It just didn’t seem to be. I returned it. I purchased this camera and I like it very much. Then I purchased a blink mini. We couldn’t get it on the free video setting. It was so frustrating and by the time we were done, we didn’t know what we had done if you know what I mean, you follow so many instructions that you literally feel as though you’re giving all your personal information by the time it said and done. Returned the blank. Seriously considering buying a second one of these. It’s easy, it’s inexpensive, it’s a basic camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is a great camera and for the cheap sale price I grabbed it at, I was shocked how well it works. I got this mainly for the wife and daughters to do their laundry. The washer and dryer are located downstairs and they have to guess when the loads are done and usually come storming back upstairs complaining there are still 10 minutes left, etc. Now, they can take a look at the live view with the app and clearly see (and hear!) before even getting off the couch or whatever if it's done or not! No more wasted trips- they love it! The camera has some really neat features also. The live view can be zoomed just like a photo on your phone with your fingers. You can pan the camera up/down and left/right. You can get it set perfectly where you want it and set that as a named position, then on the app you can press those position buttons and it adjusts the camera exactly to that view. If someone else is down there you can talk back and forth with each other. Fortunately, the app also gives you the ability to enable or disable alarms, notices, etc- which is perfect for our scenario where we only want to look at the live view when we want and nothing else! Great buy!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera is an excellent deal. Set up was super easy, just download the app and it walks you through set up. Video is great quality even in low light and it has a wide view. You can control the camera from your phone and move it around but it also tracks movement by itself. The movement alert I receive on my phone is within seconds of the initial movement. I like that multiple users can access the camera as well from different devices. The talk feature is also a plus."
    },
    {
        "title": "",
        "rating": "",
        "text": "An affordable camera that delivers excellent quality and durability for its price. The camera offers an array of settings and recording if you opt into their subscription Plan. I also have several Ring cameras, and I noticed that the annual and monthly plan subscriptions are significantly more affordable, making it easier to secure your home/property. I noted a slight lag that may have been due to the wifi service. A feature I wish this camera offered is the ability to keep a view of the live footage on your main screen after exiting the app. Like Ring offers. With this camera, you have to keep the application open on your main screen to monitor activity. The app allows you to receive motion alerts, which are very accurate and driven by sensitivity settings. The camera is efficient and offers mounting options. It is an inexpensive way to protect your home."
    },
    {
        "title": "",
        "rating": "",
        "text": "I didn’t know what to expect, but this camera has a lot of features. I did have a problem in the beginning connecting it through my Bluetooth, but once I connected it I was very impressed how good it worked. The motion detection follows you wherever you go, good picture quality, an alarm, talk feature etc. Great, for the price."
    },
    {
        "title": "",
        "rating": "",
        "text": "Amazing Product! I was Kind of Skeptical at first because of the Price Of the Camera but I wanted to give it a Try and Omg!! Yesssss Wonderful Clear Video, the Connection is perfect! It’s very easy to set up and use and it’s Very compatible! And very Durable! I would Most definitely recommend this camera and I will Definitely be Buying More!"
    },
    {
        "title": "",
        "rating": "",
        "text": "So far I absolutely love the camera. Very simple and easy set up. I did get this camera for my pups and the quality is great. I can pan the camera to check on them if they are in the crate too. I also get alerts if there's movement detected. The only downfall I would say is the short cord. I did have a 10ft cord on hand and it works perfect."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great little camera, I like that you don’t have to sign up or pay for an app if you don’t want to. You just use the memory card to get your videos. Videos are very clear and easy to download. Will probably buy more of these for other rooms in the house."
    },
    {
        "title": "",
        "rating": "",
        "text": "I recently purchased the Cloarks 2K Pan/Tilt Security Camera, and I’ve been very impressed with its performance for the price. Setup was quick and easy using the phone app. The camera was set up after 3 mins and the instructions were well written and easy to follow.\n\nI originally bought the camera to watch my dogs while I was at work and the video quality is really clear. This helps me observe my dogs and see how they are doing throughout the day. The pan/tilt feature gives me full coverage of the room. I use it mainly for to check in on my pets, and the motion detection alerts work reliably without being overly sensitive. The two-way audio is surprisingly clear—I can hear what’s going on and also speak through the camera with no major lag.\n\nFor under $30, this camera is an excellent value. If you need an indoor security camera for monitoring pets, kids, or just extra peace of mind, I definitely recommend it."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera was very easy to set up. It chimes so you know that it is ready for pairing. And so long as you have the Bluetooth on, the setup was very quick to my home Wi-Fi.\n\nThey were also way more features than I expected. The feature where the motion detector follows the motion that it sees was better than any other camera I have used before. Also, the responsiveness of the pan tilt was excellent.\n\nThe only thing I would say, and this is very common with many of these cameras, is that the communication of the talk feature back-and-forth could have been a little crisper. My voice from the mobile device back to the camera seemed a little garbled. But again that is very common on all of these cameras."
    },
    {
        "title": "",
        "rating": "",
        "text": "So inexpensive. So easy to set up. Inexpensive monthly charge IF DESIRED - not required! Fast simple app download and it was up and running in less than 10 minutes. The day and night videos are clear and audible, and the user interface kindergarten simple. Highly recommended!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Camera was well packaged. I had no worries about damage in shipping. I had the camera set up minutes. It was simple even for the not so tech savy as myself. The picture was crisp and the zoom worked well. We now use this to check on our cats throughout the day. Would recommend for anyone needing a great quality product at this price point."
    },
    {
        "title": "",
        "rating": "",
        "text": "I recently got this WiFi indoor camera for my home , been using it for a while now and I am really impressed so far. It’s very easy to install and set up, the app features make it easy to set up the camera it gives you home and away features, you can rotate the camera head so can have different view angles , great motion alerts and very informative, it keeps me in known with what’s going on especially when I am keeping a eye on my teenager and my pets . The camera quality is great too . All and all I really like and enjoy this camera very much , Will definitely be getting more for other area of my home ."
    },
    {
        "title": "",
        "rating": "",
        "text": "This 2K Pan/Tilt Security Camera exceeded my expectations. The image quality is sharp day and night, and the pan/tilt feature covers the entire room effortlessly. The AI motion detection is accurate without being overly sensitive, and I love being able to check in on my home and pets through the phone app anytime."
    },
    {
        "title": "",
        "rating": "",
        "text": "I swear i just set this up 10 minutes ago and it’s literally the perfect thing. My mom watches my baby while im working and i wanna be able to see him when i feel like it and i can do just that !"
    },
    {
        "title": "",
        "rating": "",
        "text": "This is a great camera for the price! I would honestly say the video quality is better than a Kasa or other popular options. I also like that it moves and tracks motion"
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought two of these camera. The work great. Haven't bought the sd card yet, but the notification is on point; almost instant. One of the cameras for some reason night vision keeps opening and closing the shutters I turned the automatic switch off. Its probably because its in the basement where its dark, but light sometime shine though the curtains. Overall all these cameras are great with a clear picture day and night."
    },
    {
        "title": "",
        "rating": "",
        "text": "I love the standing indoor camera. Very easy to set up with the app. And it provides increased security just in case. For instance\nIf someone were to come in unexpectedly I not only have the view from outside watching their approach but can get another view of them inside. Since there is a cloud connection I can also see it any time afterwards if I realize something is amiss.\n\nPlus I can check on my dog when I'm away from home. It works on the Vico app so you can control it from anywhere. It's also small enough you can stand it in a corner or out of the way. In short i highly recommend this camera. It has excellent video quality."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is a great camera. The quality of video is fantastic is has AI motion detect so it follows movement. The app is easy to use. I love this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera works very well. The quality is good and I like how you can move the angles of the camera from the app live so you can see what’s going on. You don’t need the subscription for it to work and there are no annoying ads either."
    },
    {
        "title": "",
        "rating": "",
        "text": "For the price I was worried that it wouldn’t be that great. But OMG this is sooo clear and works great. I will be adding another one to my cart soon."
    },
    {
        "title": "",
        "rating": "",
        "text": "This was literally the easiest camera I have ever connected . I set up 2 of them in less than 5 mins. Amazing! Ty:) camera quality is great, sound communication is great."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m really impressed with this Cloarks 2K security camera! The picture quality is super clear, both day and night, and the 2-way audio works perfectly for talking to my pets or checking in at home. The motion detection alerts are accurate and fast, and I love being able to pan and tilt the camera right from my phone.\n\nSetup was a breeze. I had it connected to my WiFi and app within minutes. The app is easy to use, and I really appreciate having both TF card and cloud storage options. It gives me peace of mind knowing I can check my home anytime, anywhere.\n\nOverall, this camera is an excellent value for the price, reliable, high-quality, and full of useful features. Highly recommend!!!!!!!!!!!!!!!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Pleasantly surprised by this camera! I had no problems connecting it to the WiFi. The picture quality is great! It has so many functions on it. I purchased it to keep an eye on any sick kitty I may have when I’m away. These would be ideal for indoor cameras. It seems to be durable. The tilt feature is awesome. So many things I will never use on it, but cool nonetheless."
    },
    {
        "title": "",
        "rating": "",
        "text": "Got it to keep an extra eye on my daughter with disabilities . Cannot say enough about this ! Notifies me of movements ( if I choose ) great quality! Bought 3!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This is a great little camera at a great price. Works as described. I bought it for my dog that has separation anxiety."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera is amazing, I love it! I can see so clearly from my phone. I really like that I can move the camera from side to side using the app. I love all the features it has, and the price is fantastic compared to others. Highly recommended!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Camera has clear picture when it works. However, automatic night vision does not work. During daylight, I have to turn night vision off or the camera doesn’t focus. At night, I manually turn it on. I have contacted the manufacturer, but have not received a response yet.\n\nUpdate November 29. I have increased my rating. I moved the camera to where it is only used during the day. For the price, it works well and has many useful features."
    },
    {
        "title": "",
        "rating": "",
        "text": "Unboxed and set up on my Wi-Fi in a few minutes and it was surprisingly easy. The best part is definitely the pan-tilt feature. I can just swipe around on the app and see every corner of the room. The picture is sharp and clear, and the night vision works great too."
    },
    {
        "title": "",
        "rating": "",
        "text": "Camera was easy to install and used friendly. The images are clear and alerts are quick to respond to movement detections."
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera is super practical; besides being foldable and rotating, it records sound perfectly and the images are super clear. This camera is super cool and also comes with all the tools to install it. The zoom is great, it doesn't lose much quality and the connection is excellent."
    },
    {
        "title": "",
        "rating": "",
        "text": "It's a camera with a very clear image, I use it to see my baby when the nanny stays taking care of him and it helps me to be calm"
    },
    {
        "title": "",
        "rating": "",
        "text": "The video and audio quality on this little camera is great. Connecting it with the required app is simple and the camera controls in the app are responsive with very little lag."
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera for the price is a steal works great definitely happy with it it does many security features it’s amazing"
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent camera for the home. The image is very clear, even at night, and detects movements with great precision. It easily connects to WiFi and allows you to see everything from your cell phone in real time. It offers good security and peace of mind by being able to review recordings from anywhere. Ideal for watching the house or pets. Highly recommended for its quality and ease of use."
    },
    {
        "title": "",
        "rating": "",
        "text": "It works well except at intermediate low light levels. In subdued light, neither light nor dark, the IR lights cycle on and off. Apparently, turning the IR lights on and off is controlled by a relay, because there's a loud clicking noise that accompanies the cycling, which is very annoying. In daylight and dark, it nevertheless performs very well."
    },
    {
        "title": "",
        "rating": "",
        "text": "Exactly as described. We got it for our dogs. So far so good!"
    },
    {
        "title": "",
        "rating": "",
        "text": "we are very happy this camera and App both cam and app work great and also has great video and with this cam you can keep an eye on your house went your gone. we are thinking of getting another one"
    },
    {
        "title": "",
        "rating": "",
        "text": "Very happy with the security cameras. I ordered two.\n\nEasy set up, had to download the app. I was able to start using them within about 15 minutes. There is a subscription service but you don’t have to join. You can bypass that.\n\nI like the way they tilt and the motion sensor seems to work very well. I’ve been using them now for just over a week and I’m really impressed. I especially like the fact that I can talk to my cat when I’m out with the microphone.\n\nI also think they look quite attractive."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great littlr camera for general home use. Control app runs on Android phone or PC with Bluestacks Android emulator. Much better detail than 1080P camera. With app defaults to recording to web but has option to use 128 GB SD memory card. Motion tracking may be useful for some, but I turned it off since it wanted to track tree limbs outside my sun room. Night vision IR light can be turned off if needed. Many options, so flexible use possibilities. Pan /tilt works smoothly."
    },
    {
        "title": "",
        "rating": "",
        "text": "Very happy with this camera. Does exactly what it says it will do. The ability to pan and tilt is very useful for both live viewing and for recording of events. The tracking of movement has come in handy. The app for viewing on my iPhone has the features I need. One quibble might be the too frequent attempts by the app company to subscribe to their cloud service, although the service might be of interest to some purchasers (so having the service available is a plus potentially).\n\nConstruction seems solid and durable. The response time for camera is nearly real-time (my wifi connection is not the strongest, so that also is impressive).\n\nAm considering buying another one."
    },
    {
        "title": "",
        "rating": "",
        "text": "This little camera is amazing! I loved it so much that I bought another. I use it to watch my sweet kitties when I am away for work. It gives me peace of mind. It was very easy to set up (took less than 30 seconds) and the picture is very clear. The camera can rotate so I can see many angles of the room. You can’t beat it for the price! I just use the free version for the app. It’s all I need. Highly recommended."
    },
    {
        "title": "",
        "rating": "",
        "text": "Very clear image and no need to subscribe to any service. The app is easy to use."
    },
    {
        "title": "",
        "rating": "",
        "text": "I love it it's works great my dog trys to get it to move I will buy again"
    },
    {
        "title": "",
        "rating": "",
        "text": "Installation was a breeze and quality of the video is amazing. Love this product"
    },
    {
        "title": "",
        "rating": "",
        "text": "This is the absolute best security camera I have ever had. The range is unmatched, and the video quality is excellent."
    },
    {
        "title": "",
        "rating": "",
        "text": "Got to recommend this one for sure! Very good video and picture quality. Clear audio and I love the fact that can tilt/ rotate. It has also an alarm feature. Can be shared by multiple users. Easy to install and set up."
    },
    {
        "title": "",
        "rating": "",
        "text": "These cameras are wonderful! Don’t hesitate… Buy them!!!! Amazing camera for the price. The quality of the pictures are outstanding. Easy to setup. The app has been great so far. Easy to hook up to WiFi."
    },
    {
        "title": "",
        "rating": "",
        "text": "Best camera out there to watch ur pets!!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera works great unbeatable price love ❤️ it ty"
    },
    {
        "title": "",
        "rating": "",
        "text": "This WiFi indoor camera have been a fantastic addition to my home security setup. The video quality is crystal clear, even at night with the infrared feature. Setup was quick and seamless, and the mobile app makes it so easy to monitor everything in real time from anywhere. I really like the motion detection alerts – they’re accurate without being overly sensitive, and the two-way audio is a great bonus for checking in on family or pets. The cameras are compact, blend in nicely with the home, and provide great coverage for the areas I need. Overall, this is a reliable and affordable home security solution that gives me real peace of mind. Highly recommended"
    },
    {
        "title": "",
        "rating": "",
        "text": "Super fast shipping. The camera works great. I love that I can move it around as needed. I haven’t try all the features yet but I mainly got it for my kids play area so it works great for that."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is an excellent indoor security camera with impressive high-resolution video quality. Features like two-way talk, an audible siren, and cloud storage make it especially appealing. I also love the motion detection feature—it provides great coverage and peace of mind."
    },
    {
        "title": "",
        "rating": "",
        "text": "The setup was super easy and the image quality is clear, even at night. The app works well and lets me check my home anytime. For the price, it’s definitely i love this."
    },
    {
        "title": "",
        "rating": "",
        "text": "Really nice camera! Everything work as listed."
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent camera with all the great features. Easy installation of camera and phone app. Excellent clarity of viewing day and night, has all the app features you need and easy to use. Overall a great camera for a super low price."
    },
    {
        "title": "",
        "rating": "",
        "text": "Amazing product for the price with a high quality and technology camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "Easy set up, great quality picture!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Muy buena cámara tiene buen lente es muy útil"
    },
    {
        "title": "",
        "rating": "",
        "text": "The product was super easy to set up and easier to use."
    },
    {
        "title": "",
        "rating": "",
        "text": "The quality of the camera is great, it moves automatically to the direction of motion. My only complaint is that you need to pay for a subscription in order to view and save recordings. Live view is the only free option with this camera, which is good to know before buying"
    },
    {
        "title": "",
        "rating": "",
        "text": "Love this camera! Super easy to set up and picture is super clear."
    },
    {
        "title": "",
        "rating": "",
        "text": "Placed by my sump in my basement. Excellent peace of mind."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great Camera! Very durable and easy to use and setup."
    },
    {
        "title": "",
        "rating": "",
        "text": "It's a good quality camera"
    },
    {
        "title": "",
        "rating": "",
        "text": "amazing camera quality!! especially for the price omg"
    },
    {
        "title": "",
        "rating": "",
        "text": "This affordable camera came and was well packaged and very easy to set up. The quality of the image is very good in bright and/or dim light. I downloaded the app and received notifications when there was motion. The app is adaptable to your needs. The only thing that I could not do was \"turn off\" the camera from the app, I had to physically unplug it...not sure if I just couldn't find it on the app, or it doesn't exist. Nevertheless, great little product that looks good and works well."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera! Highly recommend this camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice and simple to set up!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This Camera is so good that I ordered another one!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Very good security camera. You can pull up the feed from anywhere you are and move the camera around from your phone. Really good. Highly recommend"
    },
    {
        "title": "",
        "rating": "",
        "text": "For an inexpensive camera, this one is great! I had the app already downloaded due to my having another camera associated with it. The directions were simple and set up went smoothly. It only took a few minutes. Picture quality is good and following the motion it senses is right on. You do have to make sure the power cord is plugged entirely into the camera. The only thing I wish is that it had a longer power cord, but that is a personal preference. For the money, you can't go wrong."
    },
    {
        "title": "",
        "rating": "",
        "text": ""
    },
    {
        "title": "",
        "rating": "",
        "text": "Love it !! Easy set up & cheap subscriptions"
    },
    {
        "title": "",
        "rating": "",
        "text": "Installation was very simple; I just followed the instructions in the manual and it was up and running in just a few minutes. The image quality is very good, even at night thanks to night vision.\n\nI like that you can move it from the app to view different angles and that it sends notifications when it detects motion. It also has two-way audio, allowing me to talk or listen from my phone, which is very useful."
    },
    {
        "title": "",
        "rating": "",
        "text": "Works great!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent"
    },
    {
        "title": "",
        "rating": "",
        "text": "Was extremely easy to set up! Good quality video & you can pan it from the app. Very pleased with this camera!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I love this camera! It's perfect to watch my cat while I am away from home and I can make sure he doesn't break any rules! The Wi-Fi Connectivity is great! It comes with a mount for it so I can hang it if I want to use it upside down! I have knocked it over a couple times and it hasn't sustained any damage. The picture is clear and in HD and you can control it's movement. The app is easy to use! Doesn't really have any sensitivity issues!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This replaced my furbo dog camera and this is so much better it works amazing and set up was super easy 👌"
    },
    {
        "title": "",
        "rating": "",
        "text": "This product is worth it"
    },
    {
        "title": "",
        "rating": "",
        "text": "It's economical and works well.\nIt moves up and down, and side to side.\nImage is clear.\nIt has a alarm function that I like."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great product! Does everything it says. Very quiet."
    },
    {
        "title": "",
        "rating": "",
        "text": "Really good ! Easy to set up. Good image and functional app. Bought to talk to my kids across the house and track my cat while traveling."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great picture, love the microphone feature. I use it for my dogs when theyre home alone. I would like to purchase a 2nd one soon, worth the cost."
    },
    {
        "title": "",
        "rating": "",
        "text": "Super easy to setup, connect, and control via the app. I have 5 of them but I will buy three more. I recommend buying the cloud storage, unlimited, so you can have all the videos under one account, its easier. The customer service is super responsive and helpful. Remember to set your came to record for 3 min each time it detects motion."
    },
    {
        "title": "",
        "rating": "",
        "text": "Love this, very high quality and really good for the price, I have 3 helps to keep a peace of mind with my littles in another room I can check on them at any time, camera has good function and 360 view, app is easy to install and use took less than 15 minutes to install and the picture quality for A1."
    },
    {
        "title": "",
        "rating": "",
        "text": "The TP-Link Tapo camera works great as a pet camera and it’s an excellent value for the price. This camera was super easy to set up and has all the features I need to check in on my pets when I am sat work or away from home. Picture quality is good and the field of vision adequate, and with the panning feature it is easy to look into different areas of a room. You can pan side to side at least 180 degrees as well as up and down to a certain degree.\n\nThe camera plus into a wall outlet so there is no concern over battery life. I have another security camera that I use in another area of the house that is rechargeable which is great for an area that isn’t close to a power outlet but you always have to worry about battery life and recharging. No concern with this one.\n\nAs with other security camera you can set up alerts for motion and it has other features. One feature I like is being able to use a SD card to store pictures and videos rather than use a cloud account although you still have that option for a price. Picture quality is good, the only issue I’ve experienced is when the camera is pointed to a window which makes the picture much darker trying to adjust to the bright light. Other than that it’s worked great for me."
    },
    {
        "title": "",
        "rating": "",
        "text": "Simple to install and hood up to the app. The video quality is clear and easy to see. Like that you can set alerts for specific times and that it can notify you of movement or when a person is detected. Quality video camera to give you piece if mind."
    },
    {
        "title": "",
        "rating": "",
        "text": "I was looking for a second cat camera to monitor our cats when we’re away from home, with specific needs: two-way audio, local and cloud recording, motion detection with alerts, and clear video with night vision. The TP-Link Tapo Pan/Tilt Security Camera, on sale for just $19, checked all my boxes and exceeded expectations with some unexpected bonuses. Here’s my experience to help you decide if this camera is right for you.\n\nPerformance and Features\n\nThe 1080P video is sharp and clear, providing enough detail to see what my cats are up to, even in low light thanks to the reliable night vision. The pan/tilt feature allows me to cover a wide area of the room, and the motion detection works flawlessly, sending alerts to my phone and triggering house lights when set up. The two-way audio is a fun bonus—I tested it and startled my cats by speaking through the camera when I wasn’t in the room! My wife loves that we can share video clips easily through the app, which adds a nice touch for capturing cute moments.\n\nSetup and Integration\n\nSetup was a breeze, and I was thrilled to find that the Tapo app automatically integrated with my existing Kasa app, adding the camera to my master device list without any extra effort. It works seamlessly with both Alexa and Google Home, allowing voice commands and linking motion alerts to control smart lights in the house. I inserted a 128GB Class 10 micro-SD card for local recording, which provides up to 16 days of continuous storage, and I also set up cloud recording for added peace of mind. Both recording options work perfectly for my needs.\n\nVerdict\n\nAt $19, this camera is an absolute steal for a pet or baby monitor. It delivers clear video, reliable motion detection, two-way audio, and night vision, with the added flexibility of local and cloud storage. The seamless integration with the Kasa app, Alexa, and Google Home makes it incredibly user-friendly, and the ability to share clips is a fun perk. Whether you’re keeping an eye on pets, kids, or your home, this camera offers premium features at a budget-friendly price. I highly recommend it for anyone looking for a versatile, high-quality security camera.\n\nPro Tip: Pair it with a high-capacity micro-SD card (like a 128GB Class 10) for extended local recording, and take advantage of the Alexa/Google Home integration to link motion alerts with smart home devices for added convenience. If you find this useful please mark as Helpful!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have these security cameras outside my home. They are easy to install and connect to the main system right away. I like the tracking feature, it helps me keep an eye on my mischevious puppy dog. The picture is clear and I can zoom in on any area in the view of the camera."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ve been using this Tapo Pan/Tilt camera for a few months now and it’s been perfect. The motion detection works exactly as it should, the video is clear, and the app is easy to use. No complaints at all — reliable and worth it."
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera works very well. Easy setup, long cord to plug in an electrical outlet easily for power. I love that it pans 360. Sound is very clear. I have already recommended it to family members who have purchased it."
    },
    {
        "title": "",
        "rating": "",
        "text": "I returned this after one day. Initial setup took about 25 minutes, not bad. And for a day, it worked fine: good camera quality, decent Android app, appropriate alert messages. But the second day, the app lost its network connection, and could not be fixed with 30 minutes of troubleshooting. Worse, the app caused my phone to claim that its wifi connection had no internet. (The wifi was fine--I confirmed via my laptop that the wifi network had a working internet connection). Rebooting and restarting the app and the phone multiple times did not fix the problem. There is zero manufacturer documentation on how to troubleshoot this. The only document available online simply indicates the names of the buttons, and says to \"make sure your network settings are correct,\" without detailing in any way what those correct settings might be. After poring over the comments on Amazon and other sites, I learned that repeatedly losing network connectivity is common, and you can try fixing it by calling your internet provider and/or the manufacturer and/or tweaking a bunch of advanced network-related settings, but I don't have the time, energy or bandwidth for that. So I returned it. Fortunately, after uninstalling the app from my phone, my phone once again had a working internet connection via the wifi network.\nI'm now considering simpler technologies to monitor my 102-year-old mother: either a no-wifi baby monitor, or a simple motion detector alarm. Ironically, both of these less-complex items cost more than twice as much as this high-tech camera, but I figure it'll be worth it in headaches and aggravation saved. (Note: in my day, I worked as a programmer, so I am reasonably adept at these things. But the older I get, the less patience I have for things that don't work out of the box).\nBottom line: if you're tech-savvy and/or enjoy long calls with customer service and have plenty of time to troubleshoot, this is a great camera monitor. Really, it does a lot for the price, and does it well. When it works."
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought this Tapo pan/tilt camera to keep an eye on my place and to check in on my dog when I’m away. Setup was straightforward with the Tapo app, and the camera synced to WiFi in under two minutes. The pan and tilt movement is much smoother than expected at this price, and I really like that it doesn’t overshoot when adjusting angles.\n\nVideo quality is solid with clear detail in both daylight and room-light conditions. The biggest surprise was the night vision. The infrared mode produces a sharp image where facial features and objects are actually recognizable instead of foggy blobs. Motion detection works well and sends timely alerts, though I reduced sensitivity to avoid notifications every time my pet moved.\n\nTwo-way audio is clean enough for quick check-ins. The speaker isn’t loud, but it’s clear. I tested both cloud storage and an SD card; the SD card option is the better long-term value.\n\nOverall, this is a very dependable indoor camera with smooth controls and better clarity than I expected at this price. It’s been a great addition to my home setup."
    },
    {
        "title": "",
        "rating": "",
        "text": "Tapo Camera/Monitoring System\n\nCertainly a fairly economical video monitoring system. We made 2 purchases initially then added another a few weeks later and 1 more for a total of 4 covering 4 different areas/rooms. 3x was 1080HD and 1x was 2k version. It’s been a few months of daily usage and monitoring, for the most part they have been quite beneficial but not without some shortcomings. Below are some pros and cons:\n\nPROS:\n\nVideo: High enough quality for 1080HD, the 2k version does add a bit of extra clarity but at a distance greater than 25 feet it’s only slightly noticeable.\n\nPan/Tilt: It’s a pretty nice feature to have, although a bit of a limitation for the tilt part when it’s standing upright; when it’s mounted on say the ceiling, it offers better range for the tilt.\n\nMotion Detection & Tracking: both are nice features to have to trigger the camera, the tracking appears to do a good job in following the movements.\n\nCloud or physical SD card storage: good to have both options available but given our needs a few 128GB and 256GB SD cards worked\n\nModes: day mode, night mode and auto mode settings can be easily toggled depending on the time of day and lighting for better video clarity. In addition, the camera has a built in night vision to aid in video capture during dim lighting.\n\nAudio: is sufficient and clear enough during recording and live 2-way\n\nEcosystem: Tapo ecosystem/app isn’t too bad, since we have multiple cameras it’s one Tapo app and all the videos/cameras can be streamed/stored in 1 app and displayed 1 screen at a time or split screens in 2s,3s,4s etc.\n\nCONS:\n\nOne of the features that can be improved is the 2 minute pause. During this time, a note will be prompted “you have viewed the live video for 2 minutes without any operation. continue the viewing? “. We find this feature to be a bit of a nuisance especially if one is looking for a continual visual feed.\n\nVideo capture: the camera appears to have a sleep mode so there may be a bit of a delay before recording begins, thus sometimes some footages aren’t fully captured, sometimes a few seconds are noticeably missing if not longer; at times we also notice with distances greater than 25 feet, footages aren’t always captured or only partially captured.\n\nIt’s probably not the cameras fault but if there a bit of a weaker WiFi signal,\nInterference or dead spot then the monitoring system may not sync with the Tapo camera so no video can be seen. We find the kitchen area next to all the appliances may be causing some interference. During this temporary “outage” the (camera) recording seems to be working just not able to view/monitor. Troubleshooting is as simple as getting closer to the camera with the mobile device, restarting the app or WiFi or restarting the Tapo camera by pulling and replugging it."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera! We use it to watch our puppy while she’s in her crate at night. The night vision is really good and you can see everything really clearly. The camera is motion detecting and lets you know when a person is in the room. It even has a feature to let you know when a baby is crying but that doesn’t really work for a puppy cry lol. Overall, we are very happy with this purchase and would definitely buy more for around the house!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Amazing quality for the price. Only problem is when you try to change the wifi for the camera, only solution is to reset the whole camera before you can be allowed to connect to a different wifi, though this is a software issue that might be fixed with a firmware upgrade whenever they'll decide to fix that."
    },
    {
        "title": "",
        "rating": "",
        "text": "I had this set up in about 5min. I wasn't sure how it would work out because it looked top heavy, but there is really no problem with it set on top of something so far. I will have my daughter mount it for me so that its more permanent. I love the app they use with it, there is no lagging or having to return to the app. My others will kick me out and then I have to replica the app to get them started again, and I miss what I wanted to record. This one stays on and has different modes you can set up for humans, baby crying or just movement. I cant believe the price this was even if it was only for indoors but this one is indoor/outdoors. I love it so far and think I might want a few more of these. I haven't used the light so far but if its anything like the pleasant surprise the camera and app gave me, then I'm sure it will be top notch too.\nYep, I really live it!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I use one of these to monitor my dogs when I'm away from home. It's been so great to be able to check on them i got another to put in my chicken coop. Then I bought 2 solar outdoor tapo cameras that I also get to use as a driveway alert, a motion alarm can be set to scare predators away from the coop, and I can check on the dogs and chickens any time without having to go outside. All 4 cameras bought over the last 18 months work flawlessly still and it's great to be able to easily cycle through them in the app or live view multiple at once."
    },
    {
        "title": "",
        "rating": "",
        "text": "I now own 4 of these cameras. They are awesome! The video quality is awesome. The sound is pretty good for the price. We use them in our livingroom, garage, shed and winter home. Great for security purposes."
    },
    {
        "title": "",
        "rating": "",
        "text": "I have ordered four of these and installed two so far I was using another brand for the past 5 years and they decided to cut out the forward and backward by 30 seconds review unless you subscribe to their cloud ....No thanks. These cameras allow for your micro sd card to be viewed at any time placement. My old uses use to do this bu the company has gotten greedy. I now have 4 inside of these and 4 of the outside ones.. Good night vision, easy to set up and the best quality ive seen in this price point. My security is back on track using these."
    },
    {
        "title": "",
        "rating": "",
        "text": "Camera initially unstalled easily; however, repeated attempts to re-install and connect it to our WiFi have been difficult."
    },
    {
        "title": "",
        "rating": "",
        "text": "Installation instructions are simple overall. The app walks you through the setup process, although I feel the app could be updated slightly to be a bit clearer for those less tech savvy. I'm tech savvy enough where it didn't really give me any grief, but for some folks it may cause some frustration.\n\nThe camera itself is silent when it moves, which is great. I placed it in a bedroom with the blinds shut (low light) and I'm really impressed with the picture quality that it has. For the money, I'd say this is a great buy!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Para su precio tiene una calidad de imagen y funcionalidad muy completa.... Y lo mejor, se puede de ver desde dos equipos a la vez"
    },
    {
        "title": "",
        "rating": "",
        "text": "Bought this for when we are out of town and want to keep an eye on our cats. Great purchase! Day and night functions great, panning and tilting work perfect as well as the microphone. He cats were definitely surprised as well m. LOL! Loved checking in on them throughout the day. Everything worked perfectly and well worth the money."
    },
    {
        "title": "",
        "rating": "",
        "text": "Once you finally get it connected it work well. The issue is getting it connected to the wifi. I had to take out the extra space in my password that it automatically created on its own then it connected. But so far it's ok"
    },
    {
        "title": "",
        "rating": "",
        "text": "I purchased C200 first, and C210 later on. C210 has been working smoothly, way better than C200. They shared same Wi Fi, at the same level; but C200 shows “offline”, “Network is unstable” often, really often! Or it has been recording for all night; but I can’t download any the next day. Or when I talk to my cat through the mic, it usually gets delayed or my cat only can hear incomplete sentence…Nothing wrong with picture quality, night vision though."
    },
    {
        "title": "",
        "rating": "",
        "text": "I empathize with other reviewers who staate \"Tapo is Crappo\". This new ONVIF/RTSP camera does not compare to the quality or functionality of the older PTZ cameras which had many options and were easy to view/manage in just about any IP Camera viewer app.\n\nFor starters, there is no way you can use this camera without installing the Tapo app. Why must you eat up your precious phone memory by installiing a NEW app for every piece of hardware you want to access remotely? Well folks, that seems to be the Brave New World of proprietary products and self-centered corporations manufacturing the products we need.\n\nThis camera has no setup where you can browse into the camera and change all the settings.\nCan you assign a static IP? NOPE.\nCan you assign a custom camera port #? NOPE\nCan you assign preset positions? NOPE\nCan you use an http browser to connect to the camera, adjust settings, and view streaming video? NOPE, NOPE, and NOPE\n\nThe mounting options are cheap. In the past you were given a bracket that allowed you to adjust in the vertical and hoizontal planes. This comes with the cheapest mounting bracket that would be possible for the human brain to conceive.\n\nIs horizontal adjustment possible? NOPE\nIs vertical adjustment possible? NOPE\n\nYou essentially stick this on any horizonal or surface the way you want it with no possibility to fine turn where the camera is pointing, via bracket. You must \"hope\" that the PTZ movement of the camera is able to point it where you want to view. If not, then you're either SOL or you must purchase a camera mounting bracket to give you the movements that should have been included as standard.\n\nGiven all I say above, you might be surprised to know that my opinion this camera is that it's not a bad camera and could be consideered better than average, considering the competition.\n\nYes, many would consider this crappo and I'd have to include myself in that crowd, but if you consider the limitations vs. price, then this camera becomes a little less crappo because its' limations can be managed, especially when you consider that all the newer ONVIF/RTSP cameras that I've investigated, many at a MUCH higher price, has the same or worse defects than this camera.\n\nSo, what were considering is what is the LEAST Crappy camera available?\n\nBelieve or not, folks, this is probably the Least Crappy camera out there.\n\nYour system prerequisite if you want to use a non-Tapo view app to view/operat this camera is that you need to setup Port forwardings of 2020 (internal) and 554 (internal) to the IP Address for EACH C200 camera on your network. Your router must be able to make IP Reservatons for DHCP for the IP of this camera. If not, your IP will keep changing and you'll continually lose remote access to this camera because setting a statis IP Address in camera setup is impossible. But, if you can setup and IP Reservation on your router and can port forward for EACH camera to 2020 and 554 to each camera then you're likely okay with this camera.\n\nOnce this is done, you might be able to view this camera on 3rd party IP Camera viewer app that support ONFIV/RTSP.\n\nBecause TAPO is an Alexa skill, it's pretty easy to view this camera on any Alexa Echo SHOW device. I setup a routine (Named for my cat) that will cause Alexa echo Show to view a fixed position stream of my camera. You CANNOT move the camera using Alexa echo Show, but you can view the camera stream from where it's positioned right now.\n\nThe Tapo cloud service is worthless, but if you add a 128gb micro SD card, then you can save detected motion to know what's happening when something moves in front of the camera to trigger recoding. This works pretty well and gives you several minutes of recording time. You cannot just click and download these clips, which is idiotic. But, if you play the clip, then click \"Record\" you can record the playing clip, then download this recording. It's convoluted, but better than removing the SD card, placing into PC, and copying over the clip(s).\n\nI definitely am not in LOVE with this camera, and if a REAL camera came along that would allow me to view on Alexa echo Show, browse into configure all aspects of the camera, and use on any 3rd party remote view app, then I'd jump ship in a second and buy THAT camera.\n\nBut... given that ALL these type cameras SUCK, I woudl choose THIS camera because it sucks at a LOWER price. So, if your camera sucks, it's better to pay less for a sucky camera, if you can.\n\nRight now with the state of suck in IP Cameras, I'd recommend this camera as a BUY. I don't like it much, but it's better than whatever else you might be able to buy at a reasonable price.\n\nJust like when voting for political candidates, sometimes you just have to go with the one that sucks less out of a field of choices that all suck.\n\nGood Luck!!"
    },
    {
        "title": "",
        "rating": "",
        "text": "I have a Furbo at home but needed a smaller version while I am on assignment for my little furbaby .. this is perfect .. I can’t toss treats at him but I can talk to him and it alerts me when he is moving around so I can check on him .. I love this !! Thanks so much ! Highly recommend !!"
    },
    {
        "title": "",
        "rating": "",
        "text": "Won’t turn on at all right out of the box, doesn’t work!!!!"
    },
    {
        "title": "",
        "rating": "",
        "text": "It works really cheap material and picture not as clear but its really for my pet so I don’t need anything fancy for that reason other than that"
    },
    {
        "title": "",
        "rating": "",
        "text": "The Tapo security camera is an excellent choice for anyone looking to keep their home or business protected. The image quality is clear both day and night, and the night vision feature works surprisingly well. Plus, the Tapo app is very easy to use — it lets you watch live, receive motion alerts, and even talk directly through your phone thanks to the two-way audio.\n\nIts design is compact and elegant, easy to install, and connects smoothly to Wi-Fi. In short, it offers great value for the price and provides the peace of mind of being able to monitor what matters most from anywhere.\n\n⭐ Rating: 5/5"
    },
    {
        "title": "",
        "rating": "",
        "text": "A good pet camera. It has a nice range and good quality video."
    },
    {
        "title": "",
        "rating": "",
        "text": "Me pareció acorde con la descripción lo único es q no tiene para usb pero si fue q yo no me di cuenta"
    },
    {
        "title": "",
        "rating": "",
        "text": "Well, they were relatively easy to install. It comes with an app, but to view beyond your home, you need to install a 3rd party app, to view cameras on a PC. That was a bad experience. Although I was able to view cameras, all of the functions like pan and rift were very erratic. After 1 week, one of three cameras lost configuration and would not work.\n\nI replaced my BluRams because they did not have capabilities of recording locally, these Tp-Link did, via SD card that user furnishes. I am not impressed. My mesh routers work great, but these cameras do no. The PTZ control is crap.."
    },
    {
        "title": "",
        "rating": "",
        "text": "Helped walk me through setting up my Tapo. Great help to me I'm not electronically and computer inclined."
    },
    {
        "title": "",
        "rating": "",
        "text": "A popular choice for a baby monitor or pet camera due to its features and relatively affordable price. It offers 1080p video quality, pan and tilt functionality for a wide field of view, two-way audio, night vision, and both cloud and SD card storage options.\n\nClear Video Quality: The camera delivers crisp 1080p video, allowing users to see details clearly, whether monitoring a baby or a pet.\n\nPan and Tilt: The pan and tilt functionality (360° horizontal and 114° vertical) provides a wide view of the room, eliminating blind spots.\n\nMotion Detection and Notifications: The camera detects motion and sends instant notifications to the user's smartphone. This feature can be customized to trigger alerts for specific events, like baby crying.\n\nTwo-Way Audio: The built-in microphone and speaker allow for two-way communication, enabling users to interact with their pets or soothe a baby.\nNight Vision:\nThe camera's infrared night vision allows for clear visibility even in low-light conditions, extending its usability to nighttime monitoring.\nStorage Options:\nUsers can choose between cloud storage (with Tapo Care subscription) or local storage on a microSD card.\n\nIntegration with Smart Home Systems: The camera works with Alexa and Google Assistant, allowing for voice control and integration with other smart home devices.\n\nPrivacy Mode: A privacy mode allows users to disable the camera's monitoring functionality when needed.\n\nPotential Drawbacks: Some users have reported occasional delays in loading the live view, and motion blur can occur in some instances, according to a review on SafeWise.\n\nOverall: The TP-Link Tapo C200 is a well-regarded option for a versatile indoor security camera, particularly for those seeking a baby monitor or pet camera with a good balance of features and price."
    },
    {
        "title": "",
        "rating": "",
        "text": "Love this product. I recently got a kitten over the summer and I was afraid to keep him home during the day time we are all out of our home. This indoor pet camera is life saving where I get to talk with my baby kitten and it gives me a sense of relief."
    },
    {
        "title": "",
        "rating": "",
        "text": "Muy buena camara calidad/precio el modo noche es bastante bueno. Puede mejorar el seguimiento de movimiento pero en mi caso no es algo que necesite. Si el espacio es pequeño es bastante buena."
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent, ease of setup, smartphone APP, firmware update, joystick toggle, low data usage at 1080P! I bought 4. TAPO network is awesome!"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera works so well for being as cheap as it is. I use it to monitor 3d prints and my friend uses his to check on his cat at home. Highly recommend."
    },
    {
        "title": "",
        "rating": "",
        "text": "Small, easy to use, good quality"
    },
    {
        "title": "",
        "rating": "",
        "text": "Funciona perfecto, la calidad del video es muy buena. Recomendada."
    },
    {
        "title": "",
        "rating": "",
        "text": "Purchased this to replace 2 more expensive ones and it’s easy to install and use"
    },
    {
        "title": "",
        "rating": "",
        "text": "Exelente calidad y la entrega a tiempo"
    },
    {
        "title": "",
        "rating": "",
        "text": "Es fantástico, funcional, intuitivo y super resistente. Al principio lo instale mal y se ha caído del techo y no le pasó nada. Pese a que fue un accidente. La imagen súper nitida"
    },
    {
        "title": "",
        "rating": "",
        "text": "Si estás buscando una cámara de seguridad para bebé que ofrezca visión panorámica completa, buena resolución, audio bidireccional y facilidad de uso, esta cámara es una compra excelente. Nos brinda la tranquilidad que buscábamos, y cada noche entramos a su cuna sabiendo que lo estamos vigilando correctamente sin estar presentes todo el tiempo."
    },
    {
        "title": "",
        "rating": "",
        "text": "Easy to setup. Great value Hopefully it helps me feel more secure in my home 🤞🏽"
    },
    {
        "title": "",
        "rating": "",
        "text": "Ideal por el precio"
    },
    {
        "title": "",
        "rating": "",
        "text": "Great camera. Still works amazing and never fails me. Can't go wrong with this and it's a great price"
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera is great and worth the money. Somewhat user friendly."
    },
    {
        "title": "",
        "rating": "",
        "text": "I was able to look back and watch my dog eat my sofa."
    },
    {
        "title": "",
        "rating": "",
        "text": "The TP-Link Tapo Pan/Tilt Camera works great as a baby monitor. The video quality is clear, even at night, and I love being able to pan and tilt the camera from my phone. The app is easy to use, and the two-way audio makes it simple to check in without entering the room."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera arrived next day and was super easy to setup. Picture quality is what you would expect. This camera works well for our pet monitoring needs"
    },
    {
        "title": "",
        "rating": "",
        "text": "Installation was very simple and quick; within a few minutes, it was up and running from the phone app. The image quality is excellent in Full HD, both day and night thanks to night vision.\n\nI really like the pan and tilt feature, as I can move the camera from my phone and cover almost the entire room. It also has motion detection and sends me instant notifications, which gives me great peace of mind.\n\nThe two-way audio is quite useful for communicating remotely, and I find the privacy mode to be a great feature when I don't want it to record.\n\nOverall, it's a practical camera, with a good design and complete features for keeping your home secure. Highly recommended for its value."
    },
    {
        "title": "",
        "rating": "",
        "text": "I bought a set of four cameras and have been impressed with their performance. The setup process was surprisingly straightforward, and I had all four connected to my 5G network in no time.\"\n\nPros: Easy and fast connection to 5G.\nCons: My SD card was not compatible, but this did not impact my specific use case.\n\nMy main reason for getting these cameras was to check in on my pets, and for that purpose, they have worked perfectly. I don't need the internal recording, so the SD card issue was minor. The stable 5G connection has been a huge plus. I'm so satisfied that I'll be expanding my coverage with more of these units if there is a price drop."
    },
    {
        "title": "",
        "rating": "",
        "text": "Excelente, la visión nocturna espectacular, configuración muy facil"
    },
    {
        "title": "",
        "rating": "",
        "text": "Tengo mi casa con vigilancia y lo puedo mirar desde el teléfono excelente producto"
    },
    {
        "title": "",
        "rating": "",
        "text": "Ok, just received this camera today, and got it working both on my smart phone and my NVR. Hope not to early for a review but we'll see. Didn't take to long to get it working on my wifi to view on my smart phone. Instructions were straight forward. Also using instructions, I was able to view it on my NVR. Instructions for TP-Link Tapo for this part wasn't to bad either. However, you must know how to program your NVR to get it to display on PC via NVR.\nSo far good, I like. Hope it will last, for the price, this is a good deal. But then there is \"you get what you paid for\"."
    },
    {
        "title": "",
        "rating": "",
        "text": "Good camera. Used the double sided tape to mount it and it fell off the wall so be careful. It broke when it fell and I had to put it back together. Amazingly I was able to get it back together and it worked. Had to call the company to get the WiFi to work. No night vision."
    },
    {
        "title": "",
        "rating": "",
        "text": "Tapo’s app is way better than the app that came with a random brand camera I bought before."
    },
    {
        "title": "",
        "rating": "",
        "text": "Todo bien"
    },
    {
        "title": "",
        "rating": "",
        "text": "Amazing camera for the price. The tilt offers a great deal of viewing capacity and works very well with the app. If you use an SD card you do not need to pay for the tapo app storage which is really helpful. We also bought the outdoor cameras with solar and those work well but would be nice to have a tilt feature there too. We like having all 4 cameras at easy view/notice through the app. The only one thing that would make it perfect would be a cordless feature. We have one that is portable/cordless but the battery will run out eventually and cannot be replaced."
    },
    {
        "title": "",
        "rating": "",
        "text": "This is a great camera. The space the camera picks up is very good. I can see even peripherally."
    },
    {
        "title": "",
        "rating": "",
        "text": "Si me gustó mucho tiene nitidez y cumple con su espectativa es muy útil y genial para vigilar tu hogar"
    },
    {
        "title": "",
        "rating": "",
        "text": "I tried a couple of other cameras and this is the best combination of privacy and functionality in my experience."
    },
    {
        "title": "",
        "rating": "",
        "text": "The camera itself is decent for the price and should suit most users. However, if you're looking for something even slightly more functional, this isn't the right choice. It claims to support Google Home, but the video stream doesn’t load in the Google Home app in my case. According to other users, it only works on the Google Home Hub. I also couldn’t connect it to an NVR, despite enabling IP access. All control is limited to the TAPO app.\n\nSo you either have to buy a cloud subscription or insert a memory card and hope the camera doesn’t get stolen along with it and all your footage. There's also an issue with connecting to Wi-Fi networks that contain special characters — the camera only supports SSIDs with A–Z and 0–9. Otherwise, it simply won't connect. I had to return it and buy a Reolink instead."
    },
    {
        "title": "",
        "rating": "",
        "text": "Really good camera. The only thing I wish the app had is picture in picture like my Furbo. But really good quality for a decent price."
    },
    {
        "title": "",
        "rating": "",
        "text": "Excellent little camera. I purchased this camera to replace the aging Wyze camera in my garage. I am just amazed at the night vision video quality especially when compared to my former camera. I also love that I have the option to aim it exactly where I want within the app."
    },
    {
        "title": "",
        "rating": "",
        "text": "Me gustó mucho, tiene muy buen definición, yo lo quería para observar a mi mascota y cumplió con su objetivo perfectamente, estoy muy complacida"
    },
    {
        "title": "",
        "rating": "",
        "text": "A little nervous getting a camera attached to WiFi but works great! Amazing quality"
    },
    {
        "title": "",
        "rating": "",
        "text": "Works really well on its own without a SD card or subscription. Need either to record. The only thing is when the night vision engages it can make a noticeable popping sound. If you are watching tv in the dark it can pop on and off and is annoying."
    },
    {
        "title": "",
        "rating": "",
        "text": "Excelente producto"
    },
    {
        "title": "",
        "rating": "",
        "text": "Excelente"
    },
    {
        "title": "",
        "rating": "",
        "text": "Fácil de usar"
    },
    {
        "title": "",
        "rating": "",
        "text": "I use to watch my dogs when they are home alone. They work well and have great radius and pan tilt. Nice clear picture."
    },
    {
        "title": "",
        "rating": "",
        "text": "This camera shipped fast, properly packaged. I had a-bit of an issue setting up; connecting to WIFi . It just wouldn't puck up at first but eventually i got it. I like the rotation so i can see the whole entire room. Picture quality is decent as i use the camera to just check up on my dog. It also has tracking which i like. The day / night vison is nice too u can take snap shots of events, but you do need to add an SD card to keep recordings without subscription. Its not perfect but for the price and quaity i gave it a 4 star, will be ordering more."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’m giving this 5 stars for the price and what it’s capable of! I got this to know when to close the bulkhead to trap my cat inside so I wanted something cheap. The night vision is insanely impressive for the price and just the quality overall. the camera itself is light and is able to be mounted. The app was SUPER easy to set up and the phone accessibility was so impressive. it notified me when motion was detected and captured a short video of it, and you can watch it live aswell as move the camera on a swivel with just your phone. You are able to talk through it and hear audio aswell. I will say the audio is not the greatest as it’s fuzzy and hard to hear stuff so I wouldn’t rely on it but it you need something for just visual it’s amazing. If it was expensive and had the audio issue i’d rate it less stars but for 17$ you really can’t go wrong it’s worth every penny. super impressed."
    },
    {
        "title": "",
        "rating": "",
        "text": "Really great quality . Love that it has night vision"
    },
    {
        "title": "",
        "rating": "",
        "text": "Muy buena"
    },
    {
        "title": "",
        "rating": "",
        "text": "Value for money. Although it is cheap, it is really good. The image quality is good and the application is easy to use"
    },
    {
        "title": "",
        "rating": "",
        "text": "Easy to setup but not to view on a computer. Have to use third party software to see as a moniter on computer. Andriod software is easy to setup and use. Picture quality is great for this price range. Zoom and head movemnt work well. Would be nice to be able to hardwire directly to computer, they are only wireless, but most cameras in this price range are that way. Great choice for simple camera needs without a lot of hassle or expense."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buen funcionamiento, buena calidad"
    },
    {
        "title": "",
        "rating": "",
        "text": "I am so impressed with this camera! It is the best investment I have made since adopting a kitten. The night vision is amazing, the camera quality is HD and since it’s used to make sure my kitten is safe I love that you can pan and tilt as well as zoom in on the app! Another thing I love is that you can set up motion alerts for only a specific area (or the whole area if you want). Genuinely I would buy this thing over and over again it is so good."
    },
    {
        "title": "",
        "rating": "",
        "text": "Exelente calidad funciona muy bien y fácil de configurar"
    },
    {
        "title": "",
        "rating": "",
        "text": "Es muy practico lo recomiendo 100%"
    },
    {
        "title": "",
        "rating": "",
        "text": "Very good video quality"
    },
    {
        "title": "",
        "rating": "",
        "text": "Buen producto"
    },
    {
        "title": "",
        "rating": "",
        "text": "A great product works well even has motion detect"
    },
    {
        "title": "",
        "rating": "",
        "text": "Installed in my airplane hangar. Works great day and night. Great price. Tapo App is easy to use."
    },
    {
        "title": "",
        "rating": "",
        "text": "Amo esta camara es muy facil de instalar y muy buena resolución"
    },
    {
        "title": "",
        "rating": "",
        "text": "This thing works, real well, I use it for secondary security monitoring, and people are really scared of getting caught in my building with very high drug use related crime, it's a joy to work with"
    },
    {
        "title": "",
        "rating": "",
        "text": "This has been a game changer since we set it up in our baby's room. It has all the essential features, works reliably, and was very easy to install. It gives us peace of mind by letting us keep an eye on our baby while she sleeps, even when we’re not in the room. A great, affordable alternative to expensive baby monitors."
    },
    {
        "title": "",
        "rating": "",
        "text": "Great product, easy install...great picture, easy to operate. Would highly recommend. I use it for my dog."
    },
    {
        "title": "",
        "rating": "",
        "text": "I got this off Amazon Resale for more than 70% off its retail price. Even though it was used, the condition was \"Like New\", had no complaints. It powered on fine. No cosmetic problems. Did a factory reset and setting up the camera was straightforward. No issues. All of the features work. Really happy with this purchase. For 1080p, it's more than enough for normal live streaming. Recommend getting an SD card for recording and storage."
    },
    {
        "title": "",
        "rating": "",
        "text": "Basica, y funcional tplink nunca falla"
    },
    {
        "title": "",
        "rating": "",
        "text": "Me gustó mucho puedo vijilar a mi bebé 24/7 gira a todos lados da toda la vuelta atrapa en más mínimo movimiento y ruido se puede poner en el teléfono tableta o computadora con una aplicación que es fácil de conectar"
    },
    {
        "title": "",
        "rating": "",
        "text": "The video quality is clear both day and night, and the pan/tilt feature makes it easy to check every corner of the room. Two-way audio works well for talking to my baby or pet, and setup with Alexa was simple. I also like having the option of cloud or SD card storage. The only small downside is that the motion detection can be a bit too sensitive at times, but overall it’s a solid and reliable camera for the price."
    },
    {
        "title": "",
        "rating": "",
        "text": "I’ve purchased a few security cameras before, but this is by far the best value I’ve found. The quality is fantastic, it was very easy to set up, and the camera tilts nearly 140° up and down and side. I currently have two Tapo cameras installed inside my basement, so I can’t speak to outdoor performance, but for indoor use I highly recommend this product."
    },
    {
        "title": "",
        "rating": "",
        "text": "Buena imagen buena calidad y El artículo corresponde con la descripción del vendedor"
    },
    {
        "title": "",
        "rating": "",
        "text": "I use it to keep an eye on my aquarium because of my fear of leaks. For the price it’s good quality. I wish it didn’t need to be plugged in all of the time"
    },
    {
        "title": "",
        "rating": "",
        "text": "The setup of the app can be a little confusing. If you experience trouble disconnect your cell phone from the cellular providers Network in settings on your phone and then set the camera up. Then connect your phone back to the network and everything is awesome"
    },
    {
        "title": "",
        "rating": "",
        "text": "Excelente la calidad de la imagen y en general"
    },
    {
        "title": "",
        "rating": "",
        "text": "Cuando la instalé funcionó con Google Home, pero al actualizarle el software, dejó de conectarse; en todo caso aun me funciona perfecto con la app Tapo, así que sigue siendo funcional, pero me gustaría que volviera a funcionar con google home."
    },
    {
        "title": "",
        "rating": "",
        "text": "Nice"
    }
]